{
  "schedule": [
    {
      "speakers": [
        45001,
        45030,
        45031,
        45032
      ],
      "location": 45008,
      "link": "https://www.meetup.com/Application-Security-OWASP-Melbourne/events/265725809/",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45001,
      "title": "Pushing Security and Inclusion Left - Like a Boss",
      "description": "A special and diverse Security evening with Tanya Janca (@shehackspurple, Co-founder and CEO of Security Sidekick), Liam O (@liamosaur, Director of Consulting Assurance) and Michael Tozer (@michaeltozer, CEO @XceptionalTech). For the lead-up to our upcoming AppSec Day Conference we are putting on a special meetup to talk about adding security controls earlier into the SDLC and how to build stronger teams with more diverse perspectives and experiences. So come along, bring your interested friends, have fun, meet some great people before the AppSec Day Conference and be surprised to learn about some new perspectives. We would like this to be a welcoming evening, for anyone interested in learning or actively working in the security or engineering space. Plus, there’s going to be pizza & (non-alcoholic) drinks.",
      "start_date": "2019-10-30T06:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45009,
      "end_date": "2019-10-30T09:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45005
      ],
      "location": 45010,
      "link": "https://appsecday.io/documents/training/appsec.pdf",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45002,
      "title": "Application Security Essentials (28th & 29th)",
      "description": "Application Security is constantly evolving. Engineering teams use new technologies, frameworks and tools to make apps more responsive, easy-to-use and functional. At the same time attackers are constantly looking to infiltrate and find new security weaknesses in modern applications.\n\nThis program is a defense-focused training that delves deep into essential topics of Web Application Application Security. The training expounds attacks and defenses against full-stack applications, right from client-side vulnerabilities to advanced server-side vulnerabilities and defenses.\n\nThe training is replete with hands-on exercises where participants can engage with vulnerable applications and more secure variants to identify the real impact of these vulnerabilities on their applications.\n\nThe training contains code snippets and implementation examples from various platforms, programming languages and frameworks, thereby delivering a rich experience of application security to the participants.",
      "start_date": "2019-10-27T22:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45006,
      "end_date": "2019-10-29T06:00+0000",
      "includes": ""
    },
    {
      "speakers": [
        45008
      ],
      "location": 45010,
      "link": "https://appsecday.io/training/",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45003,
      "title": "Attacking and Defending Containers and Kubernetes",
      "description": "With Organizations rapidly moving towards micro-service style architecture for their applications, container technology seem to be taking over at a rapid rate. Leading container technologies like Docker have risen in popularity and have been widely used because they have helped package and deploy consistent-state applications. Orchestration technologies like Kubernetes help scale such deployments to a massive scale which can potentially increase the overall attack-surface to a massive extent, if security is not given the attention required.\n\nSecurity continues to remain a key challenge that both Organizations and Security practitioners face with container orchestrated deployments. While container orchestrated deployments may be vulnerable to security threats that plague any typical application deployments, they face specific security threats related to the containerization daemon, shared kernel, shared resources, secret management, insecure configurations, role management issues and many more! Attacking an infrastructure or Applications leveraging container technology requires specific skill-set and a deep understanding of the underlying architecture.",
      "start_date": "2019-10-27T22:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45006,
      "end_date": "2019-10-29T06:00+0000",
      "includes": ""
    },
    {
      "speakers": [
        45012
      ],
      "location": 45010,
      "link": "https://appsecday.io/training/",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45004,
      "title": "Hacking and Securing Cloud Infrastructure",
      "description": "Brand new for 2019, this 2-day course cuts through the mystery of Cloud Services (including AWS, Azure and G-Cloud) to uncover the vulnerabilities that lie beneath. We will cover a number of popular services and delve into both what makes them different, and what makes them the same, as compared to hacking and securing a traditional network infrastructure. Whether you are an Architect, Developer, Pentester, Security or DevOps Engineer, or anyone with a need to understand and manage vulnerabilities in a Cloud environment, understanding relevant hacking techniques, and how to protect yourself from them, is critical. This course covers both the theory a well as a number of modern techniques that may be used to compromise various Cloud services and infrastructure. Prior pentest / security experience is not a strict requirement, however, some knowledge of Cloud Services and a familiarity with common Unix command line syntax will be beneficial.",
      "start_date": "2019-10-27T22:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45006,
      "end_date": "2019-10-29T06:00+0000",
      "includes": ""
    },
    {
      "speakers": [
        45009,
        45013
      ],
      "location": 45010,
      "link": "https://appsecday.io/training/",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45005,
      "title": "Mobile Security Testing Guide Hands-On",
      "description": "Have you ever wanted to know how to bypass SSL Pinning on Android or iOS? Or were just curious if it’s possible to do a proper penetration test on a non-jailbroken iOS device? If so, this training is perfect for you. All of these topics and more will be covered during our hands-on course that is based on the OWASP Mobile Security Testing Guide (MSTG) and is conducted by one of the authors himself. The OWASP MSTG is a comprehensive and open source guide on modern mobile security testing for both iOS and Android. This course will provide a customised mobile testing environment including many hands-on mobile security challenges. Wide ranges of topics will be covered such as Mobile Operating System fundamentals to using Frida (Dynamic Instrumentation Framework) to bypass advanced client-side security controls.",
      "start_date": "2019-10-27T22:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45006,
      "end_date": "2019-10-29T06:00+0000",
      "includes": ""
    },
    {
      "speakers": [
        45005
      ],
      "location": 45010,
      "link": "https://appsecday.io/training/",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45006,
      "title": "DevSecOps and AppSec Automation MasterClass",
      "description": "Scalable and comprehensive application security is an essential requirement for any product, especially within mature software delivery environments utilising DevOps practices and principles allowing you to move faster. However, incorporating robust and resilient application security practices within a continuous delivery pipeline can be challenging.\n\nTo compound these challenges, application security and engineering teams grapple with a host of capacity issues. From a more reactive model, where security assurance was done periodically, and in bursts, we now have to embed application security practices throughout an organization’s product development life cycle. This has resulted in teams being stretched in multiple directions, and unable to cope with the ever increasing demands. While your product may be delivered to your customers faster, application security still remains difficult to integrate within your continuous delivery environment.\n\nThis training addresses these challenges and more, and is focused towards enabling and delivering application security at scale to organizations. This is a largely hands-on program, with a plethora of anecdotes, examples and real-world case studies. This gives the participants a comprehensive view of implementing practical DevSecOps and application security automation practices within their organizations. In fact, most of the participants have reported that they were able to use learnings from this training almost immediately.",
      "start_date": "2019-10-29T22:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45006,
      "end_date": "2019-10-31T06:00+0000",
      "includes": ""
    },
    {
      "speakers": [
        45002,
        45007
      ],
      "location": 45010,
      "link": "https://appsecday.io/training/",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45007,
      "title": "Seth & Ken’s Excellent Adventures in Secure Code Review",
      "description": "This course introduces security and technology professionals alike to the nitty-gritty details of performing secure code reviews.\n\nHave you ever been asked to review code manually with the intention of finding security issues such as SQL Injection, XSS, and Access Control flaws? What about assessing the security reputation of a new framework or library? Or being asked to review a pull request from a sensitive part of the code base? This course addresses all of these common challenges in modern secure code review.\n\nCode Review Methodology used to cover security issues\nPractical methods for identifying OWASP Top 10 vulnerabilities in:\nGo\nRuby/Rails\nDjango/Python\nNode/Express\nJava/Spring\n.Net/MVC\nOpen source code review tools available for different languages\nHands-on experience identifying vulnerabilities in known-vulnerable code bases.\nWe have concentrated on taking our past adventures in code review, the lessons we’ve learned along the way, and made them applicable for others who perform code reviews. We will share our methodology to perform analysis of any source code and suss out security flaws, no matter the size of the code base, or the framework, or the language.\n\nYou as a student will learn the methodology, techniques, approach, and tools used by Seth Law and Ken Johnson to understand code flows, trace user input, identify vulnerabilities, and effectively secure an application code base.",
      "start_date": "2019-10-29T22:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45006,
      "end_date": "2019-10-31T06:00+0000",
      "includes": ""
    },
    {
      "speakers": [
        45011
      ],
      "location": 45010,
      "link": "https://appsecday.io/training/",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45008,
      "title": "Web Hacking Essentials: Applying a hacker’s mindset",
      "description": "The course focuses on core web application penetration testing skills from the offensive side. This course is suitable for developers, anyone new to penetration testing or anyone wishing to explore the area by gaining real hands on skills. The aim of the course is to provide attendees with a hacker’s mindset and the methodology and skills required for testing web application security. Students who complete the course will actively detect and exploit the OWASP Top Ten on their own laptops in class. The structure of the two day course includes a deep drive into each topic, followed by alternating hands on learning exercises to support the learning. Each topic is also supported by coverage of the latest research in the field with references for post course development and progression. The guided hands on exercises support students in developing a hacker’s mindset and thinking in abuse cases rather than use cases.\n\nOWASP Top Ten.\nDetection and exploitation of security issues.\nLearn how to think like an attacker.\nA solid methodology and skillset for continuing the journey into advanced web application hacking and bug bounties.",
      "start_date": "2019-10-29T22:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45006,
      "end_date": "2019-10-31T06:00+0000",
      "includes": ""
    },
    {
      "speakers": [
        45006
      ],
      "location": 45010,
      "link": "https://appsecday.io/training/",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45009,
      "title": "Bughunting bootcamp - Discovering 0day",
      "description": "This intense two day, lab based, course will teach you the skills to find new security bugs, evaluate the root cause, assess impact and write exploits to prove the existence of vulnerabilities in applications. The course will cover both manual and automated vulnerability hunting in web applications, source code and compiled binaries.\n\nAdditionally we will cover how to chain bugs together to achieve unauthenticated remote code execution, vendor notification, vulnerability disclosure and how to obtain a CVE. The training prioritizes real world vulnerabilities across several languages.",
      "start_date": "2019-10-29T22:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45006,
      "end_date": "2019-10-31T06:00+0000",
      "includes": ""
    },
    {
      "speakers": [
        45010
      ],
      "location": 45010,
      "link": "https://appsecday.io/training/",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45010,
      "title": "Advanced Whiteboard hacking – Aka hands-on Threat Modeling",
      "description": "As skilled and experienced professionals we know that there is a gap between academic knowledge of threat modeling and the real world. To close that gap we developed practical use cases, based on real-world projects. Each use case includes a description of the environment, together with questions and templates to build a threat model. Using this methodology we provide our students with the best training possible and the templates to incorporate threat modeling best practices in their daily work. Students will be challenged in groups of 3 to 4 people to perform the different stages of threat modeling on\n\nB2B web and mobile applications, sharing the same REST backend\nAn IoT deployment with a gateway and a cloud based update service\nOAuth scenarios for an HR application\nPrivacy of a new face recognition system in an airport\nGet into the defenders head, attacking a nuclear facility",
      "start_date": "2019-10-29T22:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45006,
      "end_date": "2019-10-31T06:00+0000",
      "includes": ""
    },
    {
      "speakers": [],
      "location": 45009,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45011,
      "title": "Early Registration",
      "description": "Early registration, come and pick up your badges :D",
      "start_date": "2019-10-31T06:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45004,
      "end_date": "2019-10-31T06:00+0000",
      "includes": ""
    },
    {
      "speakers": [],
      "location": 45011,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45012,
      "title": "Registration",
      "description": "Registration will open at 8am sharp, make sure to have your QR code ready, located on your EventBrite ticket (mobile app or printed), to pick up your badge and your complimentary barista made coffee on arrival :)",
      "start_date": "2019-10-31T21:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45004,
      "end_date": "2019-10-31T22:00+0000",
      "includes": ""
    },
    {
      "speakers": [],
      "location": 45001,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45013,
      "title": "Welcome",
      "description": "Event welcome and information.",
      "start_date": "2019-10-31T22:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45008,
      "end_date": "2019-10-31T22:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45001
      ],
      "location": 45001,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45014,
      "title": "Security Learns to Sprint: DevSecOps",
      "description": "This talk will argue that DevOps could be the best thing to happen to application security since OWASP, if developers and operations teams are enabled to make security a part of their everyday work. With a ratio of 100/10/1 for Development, Operations, and Security, security now needs to concentrate on creating tools, processes and opportunities for dev and ops that result in more-secure products, instead of trying to do it all themselves like they did in days past. We must build security into each of “The Three Ways”; automating and/or improving efficiency of all security activities to ensure we don’t slow down developers, speeding up feedback loops for security related activities so that we fix the bugs faster and sooner, and providing continuous learning opportunities in relation to security, for both teams. Security can no longer be a gate or stumbling block, and ‘adding security in’ can no longer be used as a justification for project delays. If developers are sprinting, then we need to sprint too. So put on your running shoes; it’s time for DevSecOps!",
      "start_date": "2019-10-31T22:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-10-31T23:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45017,
        45018
      ],
      "location": 45001,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45015,
      "title": "Session IPA: Sessions' Interesting Protection Anomalies",
      "description": "PHPSESSIONID, rack.session, play_session, JSESSIONID.... do these terms seem familiar? In most languages and frameworks, the internals of session management are completely hidden from developers. In this talk, we are going to cover how sessions work across different languages and frameworks as well as what advantages and disadvantages these implementations bring. We will also look at vulnerabilities impacting session management in recent years.",
      "start_date": "2019-10-31T23:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T00:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45024
      ],
      "location": 45002,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45016,
      "title": "Hunting Bugs to Extinction with Static Analysis",
      "description": "Static Analysis can be a useful tool to help hunt for security bugs, and even prevent them occurring in the first place. However, it is a difficult tool to use effectively or efficiently. Out-of-the-box code scanning tools often have rulesets too generic for your special codebase, and writing custom static analysis tooling is complex and can be costly to setup and run. So let’s walk through a number of case studies of various approaches to static analysis:\n\nExperiences writing AST-based analysis tool (ScanJS)\nEradicating dom-based XSS in Firefox with linting\nWriting custom rules to hunt bug variants in Firefox JS code with Semmle/LGTM\nWe will then review successes and failures, and answer the eternal question: “maybe should I just use grep?”",
      "start_date": "2019-10-31T23:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T00:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45023
      ],
      "location": 45003,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45017,
      "title": "Tears from The Cloud",
      "description": "When ‘getting pwned’ doesn’t even fully describe what happened\" When building your systems and infrastructure in the cloud, you should always consider the attack vectors that you open yourself up to and continually strive to proactively close them. It is common knowledge that when bringing up cloud computing resources you should implement controls such as preventing SSH logins as the root user, disabling password authentication for all users, and limiting which IP addresses can talk to the different services on your virtual machines, as well as requiring multifactor authentication for employees accessing cloud control panels. You can be fairly certain that an alarm would go off if an attacker was able to gain access, and that their access would be limited. But what happens if an attacker takes a different path and your infrastructure provider is compromised instead? Are your systems protected from that vector, and will your heuristics catch it? In this talk, we will tell a story, not from Netflix, but from the not too distant past around a successful targeted attack against a company using infrastructure providers as the vector. Details surrounding the methods used by the attacker will be shared, including the steps they took to attempt to cover their tracks. We will also look at how the attackers attempted to regain access after the initial vector was closed. Finally, we will look at what steps you can take to help mitigate the risks you incur if your infrastructure provider is compromised.",
      "start_date": "2019-10-31T23:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T00:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45009
      ],
      "location": 45004,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45018,
      "title": "Fixing Mobile AppSec",
      "description": "There are numerous ways of developing mobile apps today, but how do you ensure that security is part of the development process? What are the attacks I should be concerned about and what can I do to avoid being an easy target? The Mobile Security Testing Guide (MSTG) and Mobile AppSec Verification Standard (MASVS) are books written by a team of numerous contributors that describe the attack surface of mobile apps, how to exploit them and what you can do to protect your apps. In this talk we will make a deep dive into both books, show some nice mobile hacking demos for iOS and Android, and ultimately help you secure your apps.",
      "start_date": "2019-10-31T23:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T00:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45007
      ],
      "location": 45001,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45019,
      "title": "The Absolute AppSec Secure Code Review Framework",
      "description": "Let’s face it, performing a manual review of someone else’s source code is hard. It takes time, effort, expertise, and grit to actually figure out what the application does, how the developer implemented it, and if there should be any changes. From an application security perspective, this becomes even more difficult because of the security nuances of multiple languages that must be understood in order to identify and squash vulnerabilities. On top of that, most security reviews must be performed within a limited amount of time against more lines of code than recommended in standard code review best practices. After performing secure code reviews for over a decade, it becomes easier to identify a pattern and framework to address security concerns within code quickly and efficiently. This talk will introduce the Absolute AppSec Secure Code Review Framework to attendees and discuss lessons learned, code review tips and tricks, and strategies for quickly assessing code that can be used by reviewers immediately.",
      "start_date": "2019-11-01T00:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T01:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45028
      ],
      "location": 45002,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45020,
      "title": "Keeping up with the Joneses - Security from a Developers Perspective",
      "description": "A real life story about staying Sane and Secure when you're working on the bleeding edge of web application development. Guaranteed to be filled with laughter, tears, anger, and awe at the incessant challenges developers face to build a modern product for millions of users, with as few vulnerabilities as possible, all while “Keeping up with the Joneses”. This talk is designed to breed empathy for the developers that are faced with far more than just writing secure code. It will highlight the things we can do as a security community to empathise and assist developers facing a variety of pressures on a daily basis.",
      "start_date": "2019-11-01T00:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T01:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45014
      ],
      "location": 45003,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45021,
      "title": "Keeping up with Open Source Security - An Automated, Developer Focused Approach",
      "description": "Over 85% of a modern application is built from open source components. There are security issues being discovered regularly in open source components. Staying on top of those security issues is hard, especially when you are moving fast with DevSecOps. This talk will cover our approach to making security an enabler rather than a bottleneck. We created some tools around open source scanners to allow self-service of security and automating time-based waivers.",
      "start_date": "2019-11-01T00:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T01:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45016
      ],
      "location": 45004,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45022,
      "title": "How Do I Content Security Policy?",
      "description": "Content Security Policy (CSP) helps you secure your Web site, by declaring which javascript and resources it uses. This means that XSS attacks will be greatly limited. However, setting up CSP on an existing Web site is hard. We’ll discuss an easy approach that you can follow to set up CSP.",
      "start_date": "2019-11-01T00:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T01:30+0000",
      "includes": ""
    },
    {
      "speakers": [],
      "location": 45006,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45023,
      "title": "Lunch Break",
      "description": "A diverse selection of complimentary hot and cold lunch options (including Veg & GF) will be provided. Also a great chance to network with the speakers and other like minded passionate attendees. ( I mean, this is food. Does it need an explaination? )",
      "start_date": "2019-11-01T01:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45002,
      "end_date": "2019-11-01T02:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45004
      ],
      "location": 45001,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45024,
      "title": "K-rail: A tool to manage k8s securely at speed",
      "description": "Kubernetes is a popular and powerful tool for workload management, and doesn’t always have the best security defaults. Even the best-intentioned engineers may define insecure configurations which lead to critical misconfigurations in production.\n\nAt Cruise, we use Kubernetes for a multi-tenant Platform as a Service (PaaS). One of the hardest things to get right was effective tenant isolation in a mulit-tenant container environment.\n\nFor attackers: this combination of freedom-without-guardrails potentially exposes workloads and clusters to issues such as pulling assets from untrusted sources, accidental public exposure, elevated privileges, etc. We provide cases when this has gone wrong (i.e. known vulnerabilities), and walk through how to exploit them. For attackers, this is a pwning k8s 101 talk, no dropping 0dayz here.\n\nFor defenders: we wrote a tool to prevent this. K-rail is a tool for workload policy monitoring and enforcement in Kubernetes that enables you to safely lock down your cluster while maintaining high developer productivity. During this talk we will open source this tool, and share some common policies from lessons learned of running this in production at Cruise.\n\nNo matter what colour hat you wear, you'll come away from the talk with an understanding of what kinds of security issues commonly arise within k8s environments, some effective policies to deploy in your environment, how to deploy them, and a new tool for doing so.",
      "start_date": "2019-11-01T02:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T03:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45020,
        45027
      ],
      "location": 45002,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45025,
      "title": "10 Things I Hate About You — How (Not) to Auth 100's of API's",
      "description": "This talk will cover the adventures of SEEK's five-year voyage in providing secure forms of authentication to the millions of active users that visit our web and mobile applications daily. SEEK's complex software delivery environment has imparted many challenges along this journey, with hundreds of micro-services, diverse software stacks, utilization of both public and private hosting providers, legacy authentication protocols, non-standard authentication protocols, and fast product deadlines thrown into the mix. Specifically, we will cover the following:\n\nChallenges of having a variety of bespoke, non standard authentication systems (SWS tokens, OAuth, Unsigned JWT, HMAC, .Net Forms and more!).\nOur approach to designing a migration and standardization strategy for several authentication use cases such as s2s, b2b and resource owner flow (via signed JWT's, OAuth flows, OIDC).\nThe documentation, tooling and metrics that helped during the migration (bridging API's, container sidecars, RFC's).\nOur future authentication plans to keep improving the way we authenticate our users and services (MFA, password breach detection, one way to auth, “Sign in with SEEK”, IdP’s).",
      "start_date": "2019-11-01T02:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T03:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45001,
        45019
      ],
      "location": 45003,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45026,
      "title": "DIY Azure Security Assessments",
      "description": "PenTesters, Blue & Red teamers, network admins and cloud enthusiasts, this talk will layout from start to finish how to verify the security of your Azure implementation. This talk will explain where to look, what to do, and how to prioritize what you find. Topics include: Azure Security Center, setting scope, setting policy, threat protection, and more.",
      "start_date": "2019-11-01T02:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T03:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45033,
        45034
      ],
      "location": 45004,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45027,
      "title": "Lockpicking - Compromising Physical Security",
      "description": "Want to tinker with locks and tools the likes of which you've seen in movies featuring police, spies, and secret agents? You will have the opportunity to learn hands-on how the fundamental hardware of physical security operates and how it can be compromised. Visitors can learn about the vulnerabilities of various locking devices, techniques used to exploit these vulnerabilities and practice on locks of various levels of difficulty to try it themselves in our locking workshop.",
      "start_date": "2019-11-01T02:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T03:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45006
      ],
      "location": 45001,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45028,
      "title": "Spot the vuln - Identifying security problems in source code",
      "description": "Do you know source code? or perhaps you know vulnerabilities? See where they intersect and how most vulnerabilities are created. This talk will present a plethora off *common* vulnerabilities introduced by programming mistakes. Perhaps you have seen a \"spot the vulnerability\" challenge on social media before? Come along and see if you can spot the vulnerability in the presented code snippets before they are explained. Come participate in this light-hearted \"spot the vuln\" session. Several languages will be presented, audience participation will be rewarded.",
      "start_date": "2019-11-01T03:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T04:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45025
      ],
      "location": 45002,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45029,
      "title": "When Bots Attack - Mischievous Puppets and Stolen Treasures",
      "description": "As a leading source of Australian property market data, REA’s website is a pot of gold to a wide variety of actors. The value of this data attracts a broad range of interest not only from prospective buyers or renters but from those keen to fold it into their own business models or others attempting to infiltrate customer accounts. We will talk about their approach to protecting their data assets, the business impact of malicious attacks and how their strategies have had to evolve beyond the WAF to safeguard property data and user accounts. Witness the effectiveness of a range of bots, mitigation strategies and hear about the techniques used by adversaries to evade defence. We will then outline the evolution of REA’s defences and the efforts that they have taken to stay one step ahead. Attendees will gain an understanding of how to assess the business impact of bots on their own organisations and gain a better understanding of how they can protect their services and corporate data.",
      "start_date": "2019-11-01T03:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T04:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45015
      ],
      "location": 45003,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45030,
      "title": "Hunting the Modern Attacker: Prepping for Appsec Incident Response",
      "description": "Today, a huge portion of our data lives in web applications, often in multitenant, high-exposure environments. Yet despite this centralization of valuable information, the diversity of application platforms has made responding to incidents in the webapp layer difficult. This lack of standardization in combination with a traditional focus on the systems side of incident response means that many security teams do not have the tools to effectively analyze attacks on their web applications. Web application incidents have gotten even harder to handle in the last few years: complex architectures and custom components mean that without special preparation, defenders may be left to decipher a heap of low-signal logs to determine what happened. The processes for investigating an application security flaw also tend to diverge from traditional incident response, since attacker behavior is significantly different. Heightened scrutiny of breaches due to new regulations has led to even greater pressure on responders to quickly understand the scope of an event. This talk introduces a flexible framework of technologies, tools, and procedures that has been essential to responding to threats to a major modern web platform. This provides a system to evaluate the capabilities currently in place to handle appsec incidents and plan new efforts to help security teams confidently investigate and respond to attackers on the web.",
      "start_date": "2019-11-01T03:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T04:30+0000",
      "includes": ""
    },
    {
      "speakers": [
        45026
      ],
      "location": 45004,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45031,
      "title": "Protecting the Damned: Deploying Insecure Applications at Scale",
      "description": "Most defense talks are about how to code and pentest applications to secure them before deployment. As a security education company, we have had to deploy extremely insecure applications on our infrastructure, providing thousands of hackers around the world low level access to sensitive files, debugging capabilities and even kernel manipulation abilities on our lab environment. All this while still maintaining control of the infrastructure, protecting users from each other and monitoring all activities performed within our network. The resulting scenario is literally one of \"assumed breach\" where we must ensure that the \"attackers\" who have access to these insecure machines cannot cause any further havoc beyond this scope. To accomplish this, we have built our systems from the ground up, leveraging entirely open source technologies such as Docker and KVM. Lots of lessons were learned and many things were done in unconventional ways to secure this infrastructure. In this talk, we wish to share our experience on how to go about building a secure infrastructure hosting extremely insecure applications mirroring an assumed breach scenario!",
      "start_date": "2019-11-01T03:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T04:30+0000",
      "includes": ""
    },
    {
      "speakers": [],
      "location": 45006,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45032,
      "title": "Coffee Break",
      "description": "☕☕☕ ... keeping you fueled.",
      "start_date": "2019-11-01T04:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45002,
      "end_date": "2019-11-01T05:00+0000",
      "includes": ""
    },
    {
      "speakers": [
        45003
      ],
      "location": 45001,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45033,
      "title": "Bulletproof Shoes: Protecting from Accidental Token Leaks",
      "description": "Version control software has come a long way, and the barrier to creating an open source project has been lowered to a point of being negligible. However, this has also increased the instances of accidental leakage of credentials or sensitive data into public repositories. Numerous tools now exist which trawl repositories for such information and abuse it almost instantly. For platform developers time is of the essence. We will talk about the history and evolution of our “token nuker” - the automation we use to find and disable exposed Slack tokens in the wild, before they can be abused. We will cover general tactics for preventing developers from shooting themselves in the foot (or mitigating damage if they do).",
      "start_date": "2019-11-01T05:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T06:00+0000",
      "includes": ""
    },
    {
      "speakers": [
        45005
      ],
      "location": 45002,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45034,
      "title": "A Purple Team View of Serverless and GraphQL Applications",
      "description": "Serverless Technology (Functions as a Service) is fast becoming the next \"big thing\" in the world of distributed applications. Especially with widespread support from cloud vendors, this technology is going to only become more influential. However, like everything else, Serverless apps are subject to a a wide variety of attack possibilities, ranging from attacks against access control tech like Function Event Injection, JWTs, to NoSQL Injection, to exploits against the apps themselves (deserialization, etc) escalating privileges to other cloud components. GraphQL (API Query Language) is the natural companion to serverless apps, where traditional REST APIs are replaced with GraphQL to provide greater flexibility, greater query parameterization and speed. GraphQL is slowly negating the need for REST APIs from being developed. The convergence of serverless functions and graphic provides attackers with some unique attack possibilities that can lead to lateral movement across Cloud APIs or financial attacks (DoS) that can literally run organizations out of business This talk presents a red-team perspective of the various ways in which testers can discover and exploit serverless and/or GraphQL driven applications to compromise sensitive information, and gain a deeper foothold into database services, IAM services and other cloud components. The talk also features real-world serverless and graphql implementations, specifically to highlight the lack of frameworks, tooling and security mechanisms that makes life much harder for developers to implement, therefore, easier for attackers to compromise",
      "start_date": "2019-11-01T05:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T06:00+0000",
      "includes": ""
    },
    {
      "speakers": [
        45029
      ],
      "location": 45003,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45035,
      "title": "Adding the Sec to DevOps",
      "description": "Ever wondered how to add the Sec to your DevOps? In this talk we will walk through the phases of an Agile SDLC and look at how we can add security at them all. What methodologies can work and the kinds of tooling you can use. With a focus on application security I hope people will learn some of the Why’s and How’s of starting to deliver secure code in an agile manner.",
      "start_date": "2019-11-01T05:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T06:00+0000",
      "includes": ""
    },
    {
      "speakers": [
        45021,
        45022
      ],
      "location": 45004,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45036,
      "title": "Ephemeral Vulnerabilities and the Case for Continuous Security",
      "description": "As companies have shifted to a cloud-first architecture and adopted continuous deployment and DevOps practices the exposed attack surfaces of these organisations have become more fluid and evolve rapidly. This pace has exposed new types of vulnerabilities and security issues including those that are ephemeral in nature but often have critical security impact and static, point in time security assessment is failing to keep up. This presentation will explore our research into ephemeral application security vulnerabilities and our experience applying this to real world environments through bug bounties. Specifically we will detail how ephemeral application security vulnerabilities are introduced and explore methods and techniques to find ephemeral vulnerabilities with detailed examples of critical ephemeral issues found when applying our research to bug bounty programs. We will also present the case for continuous application security assessment as well as strategies and techniques that organisations can apply to prevent these issues.",
      "start_date": "2019-11-01T05:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45005,
      "end_date": "2019-11-01T06:00+0000",
      "includes": ""
    },
    {
      "speakers": [
        45001,
        45004,
        45019
      ],
      "location": 45001,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45037,
      "title": "Security Panel",
      "description": "A panel discussion with industry leaders, discussing all things security!",
      "start_date": "2019-11-01T06:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45003,
      "end_date": "2019-11-01T07:00+0000",
      "includes": ""
    },
    {
      "speakers": [],
      "location": 45001,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45038,
      "title": "Wrap up",
      "description": "A quick wrapup of the day, giveaways, location of the after party and more! Usual closing ritual things.",
      "start_date": "2019-11-01T07:00+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45008,
      "end_date": "2019-11-01T07:30+0000",
      "includes": ""
    },
    {
      "speakers": [],
      "location": 45007,
      "link": "https://appsecday.io/schedule",
      "updated_at": "2019-10-25T02:37+0000",
      "id": 45039,
      "title": "After Party",
      "description": "Located walking distance from the venue, the after party will provide complimentary food and drinks and is a great way to finish off an intense, full day of learning :) All attendees (18+ years) with a conference badge will be granted entry.",
      "start_date": "2019-11-01T07:30+0000",
      "conference": "APPSECDAY2019",
      "event_type": 45001,
      "end_date": "2019-11-01T12:00+0000",
      "includes": ""
    }
  ],
  "updated_at": "2019-10-25T02:37+0000"
}