{
  "speakers": [
    {
      "description": "Tanya Janca is the co-founder and CEO of Security Sidekick. Her obsession with securing software runs deep, from starting her company, to running her own OWASP chapter for 4 years and founding the OWASP DevSlop open-source and education project. With her countless blog articles, workshops and talks, her focus is clear. Tanya is also an advocate for diversity and inclusion, co-founding the international women’s organization WoSEC, starting the online #MentoringMonday initiative, and personally mentoring, advocating for and enabling countless other women in her field. As a professional computer geek of 20+ years, she is a person who is truly fascinated by the ‘science’ of computer science.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45001,
      "title": "",
      "name": "Tanya Janca"
    },
    {
      "description": "Ken Johnson, has been hacking web applications professionally for 11 years. Ken is both a breaker and builder and currently works on the GitHub application security team. Previously, Ken has spoken at RSA, You Sh0t the Sheriff, Insomnihack, CERN, DerbyCon, AppSec USA, AppSec DC, AppSec California, DevOpsDays DC, LASCON, RubyNation, and numerous Ruby, OWASP, and AWS events about appsec, devops security, and AWS security. Ken’s current projects are WeirdAAL, OWASP Railsgoat, and the Absolute AppSec podcast with Seth Law.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45002,
      "title": "",
      "name": "Ken Johnson"
    },
    {
      "description": "Max Feldman is a member of the Product Security team at Slack, where he works on the bug bounty and security assessments of Slack features, as well as the development of security tools and automation. He was previously a member of the Product Security team at Salesforce.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45003,
      "title": "",
      "name": "Max Feldman"
    },
    {
      "description": "Frenchie is far too biased to answer this question, and instead chooses to break the 4th wall. Originally from Batmania. Currently, he is part of the Skynet prevention squad where he improvises the role of Infrastructure Security Engineering Manager at Cruise.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45004,
      "title": "",
      "name": "Sam (Frenchie) Stewart"
    },
    {
      "description": "Abhay Bhargav is the Founder of we45, a focused Application Security Company. Abhay is a builder and breaker of applications. He is the Chief Architect of “Orchestron\", a leading Application Vulnerability Correlation and Orchestration Framework. He has created some pioneering works in the area of DevSecOps and AppSec Automation, including the world’s first hands-on training program on DevSecOps, focused on Application Security Automation. In addition to his work in Application Security Automation, he has created “ThreatPlaybook”, a unique open-source framework that marries Threat-Modeling (as-Code) with Application Security Automation. ThreatPlaybook has been featured in several industry events and been recently featured in BlackHat USA 2018’s Arsenal event. In addition to this, Abhay is active in his research of new technologies and their impact on Application Security, namely Containers, Orchestration and Serverless Architectures. Abhay is a speaker and trainer at major industry events including DEF CON, BlackHat, OWASP AppSecUSA, EU and AppSecCali. His trainings have been sold-out events at conferences like AppSecUSA, EU, AppSecDay Melbourne, CodeBlue (Japan) and so on. He will be training at BlackHat USA 2019. He writes on IT and IT Security-focused areas in his blog. Abhay is the author of two international publications “Secure Java: For Web Application Development” and “PCI Compliance: A Definitive Guide",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45005,
      "title": "",
      "name": "Abhay Bhargav"
    },
    {
      "description": "Eldar is a lead security researcher with xen1thLabs. He has worked closely with Bugcrowd in the past and was a recipient of the first CVE 10K candidate numbers.In addition to finding vulnerabilities he contributes to and maintain several open source projects in his spare time aimed at web application security and penetration testing. These include graudit, doona, lbmap, dotdotpwn, nikto and more.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45006,
      "title": "",
      "name": "Eldar Marcussen"
    },
    {
      "description": "Seth Law is an experienced Application Security Professional with over 15 years of experience in the computer security industry. During this time, Seth has worked within multiple disciplines in the security field, from software development to network protection, as a manager and individual contributor. Seth has honed his application security skills using offensive and defensive techniques, including tool development. His understanding of the software development lifecycle and ability to equate security issues with development tasks has allowed him to speak at conferences ranging from Blackhat and DEF CON to local security meetups. In his spare time, Seth revels in deep-level analysis of programming languages and inherent flaws, helps develop the iOS version of Hacker Tracker, and co-hosts the Absolute AppSec podcast with Ken Johnson.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45007,
      "title": "",
      "name": "Seth Law"
    },
    {
      "description": "Nithin Jois is a Solutions engineer at we45 - a focused Application Security company. He has helped build ‘Orchestron’ - A leading Application Vulnerability Correlation and Orchestration Framework. He is experienced in Orchestrating containerized deployments securely to Production. Nithin and his team have extensively used Docker APIs as a cornerstone to most of we45 developed security platforms and he has also helped clients of we45 deploy their Applications securely. Nithin is a passionate Open Source enthusiast and is the co-lead-developer of ThreatPlaybook - An Open Source framework that facilitates Threat Modeling as Code married with Application Security Automation on a single Fabric. He has also written multiple libraries that complement ThreatPlaybook.Nithin is an automation junkie who has built Scalable Scanner Integrations that leverage containers to the hilt and is passionate about Security, Containers and Serverless technology. He speaks at meetup groups, webinars and training sessions. He participates in multiple CTF events and has worked on creating Intentionally Vulnerable Applications for CTF competitions and Secure Code Training. Nithin was a trainer and speaker at events like AppSecUS, LasCon, AppSecCali, DevSecCon, CodeBlue-Japan and SANS Secure-DevOps-Summit. In his spare time, he loves reading about personal finance, leadership, fitness, cryptocurrency, and other such topics. Nithin is an avid traveler and loves sharing stories over a cup of hot coffee or a mug of cold beer.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45008,
      "title": "",
      "name": "Nithin Jois"
    },
    {
      "description": "Sven made several stops at big consultant companies and small boutique firms in Germany and Singapore and became specialised in Penetration Testing and Application Security. He has supported and guided software development projects for iOS and Android Apps and Web Applications through the whole SDLC. Besides his day job Sven is one of the core project leaders and authors for the OWASP Mobile Security Testing Guide and OWASP Mobile Application Security Verification Standard and has created the OWASP Mobile Hacking Playground. Sven is giving talks and workshops about Mobile and Web Application Security worldwide to different audiences, ranging from developers to students and penetration testers.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45009,
      "title": "",
      "name": "Sven Schleier"
    },
    {
      "description": "Joris Van den Broeck is a cyber security consultant at Toreon experienced in application security (threat modeling, training, secure development, penetration testing) and security operations (SIEM, incident response, policy). He worked on security projects across industries and facilitated threat model sessions for several critical applications. These range from mobile and web applications to IoT and ICS. Joris has a web development background going back to 2001 and graduated with a master in computer sciences - secure software from the KU Leuven. For his thesis he worked on a general game player which was 5th in the AAAI / Stanford general game playing competition.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45010,
      "title": "",
      "name": "Joris Van den Broeck"
    },
    {
      "description": "Pamela O’Shea is director of Shea Information Security. Pamela started as a software developer in PHP, Java and C# for companies such as an internet service provider, Discovery Channel Animal Planet and the London Stock Exchange. Since then, Pamela has worked as a security consultant for the last ten years. Eight of these have been as a full-time penetration tester for some of Australia’s largest companies across the financial, government, media, resources and telecommunications sectors. Pamela is also a university lecturer for the practical ethical hacking module in the RMIT master’s in cyber security programme. Pamela is on the paper review boards for Black Hat Asia, BSides Canberra and OWASP Melbourne and has taught workshops at hacking conferences such as 0xCC, BSides Canberra, Ruxcon, OWASP Melbourne and Platypuscon. In her spare time, Pamela loves radios and is the founder of CyberSepectrum Melbourne, a meetup with a focus on software defined radio (SDR) and security of the airwaves. Pamela has also been featured in the Sydney Morning Herald and The Age newspapers for careers in cyber security, as well as being interviewed on the Risky Business security podcast on web application security.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45011,
      "title": "",
      "name": "Pamela O'Shea"
    },
    {
      "description": "Anthony Webb works as a Principal Consultant with NotSoSecure. His expertise involves Cloud Security, Infrastructure Security, penetration testing and red teaming. he has delivered multiple advanced training at conferences such as Black Hat, CPX360, as well as smaller classroom groups and live web-based training delivery.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45012,
      "title": "",
      "name": "Anthony Webb"
    },
    {
      "description": "Ryan (OSCE, OSCP, CRT) is a Security Engineer with a strong focus on Mobile Security. He spends a considerable amount of time in iOS kernel exploitation, contributing to the iOS security testing chapter and the iOS Crackmes which are part of the OWASP Mobile Security Testing Guide. That aside, he is active on both private and public bug bounty programs and has successfully bagged several critical mobile security bugs. Ryan is a strong believer in knowledge sharing - initiated a security blog on top of facilitating workshops to security engineers, developers and students about mobile security, dynamic instrumentation and reverse engineering of mobile applications.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45013,
      "title": "",
      "name": "Ryan Teoh"
    },
    {
      "description": "Edwin is the Application and Software Security Team Lead for Tyro Payments. His approach toward application and software security is to raise security awareness, provide light touch controls to the software development life cycle to increase visibility of security issues and work closely with engineering teams to quickly develop secure applications. He has presented at a number of events, including RSA, All Day DevOps, AppSec Day and DevSecOps Leadership Forum. Edwin started out as a software engineer and transitioned into the application security role to lead a range of security initiatives when the company was working towards obtaining an unrestricted banking licence.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45014,
      "title": "",
      "name": "Edwin Kwan"
    },
    {
      "description": "Max is a security engineer from San Francisco, California. He's been playing on the blue team for 3 years after starting his career on the offensive side in pentesting. Over the last year, Max has been focusing on how to instrument web applications more effectively to respond to attacks and level up appsec DFIR. When he's not trying to make things secure for work, he enjoys messing around with software-defined radio and Clojure.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45015,
      "title": "",
      "name": "Maximilian Burkhardt"
    },
    {
      "description": "Kirk works at RedShield, leads the OWASP Wellington-area Meetup in New Zealand, and has previously helped organise the annual OWASP NZ Day in Auckland. Kirk worked as a Web developer before switching to the defence team - setting up Xero’s security practice, working as a pen tester, and in defence roles at several companies.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45016,
      "title": "",
      "name": "Kirk Jackson"
    },
    {
      "description": "Louis is a security engineer based in Melbourne, Australia. He performs pentest, architecture and code review. Louis is the founder of PentesterLab, a learning platform for web penetration testing.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45017,
      "title": "",
      "name": "Louis Nyffenegger"
    },
    {
      "description": "Luke is a security researcher working for Elttam in Melbourne, Australia. He enjoys playing CTFs as part of the team TheGoonies, which recently won the Kiwicon and Crikeycon CTFs.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45018,
      "title": "",
      "name": "Luke Jahnke"
    },
    {
      "description": "Teri Radichel has helped 1000's of companies with cloud security through consulting, writing, research, and training. She moved a web hosting business to the cloud and then started the Seattle AWS Architects and Engineers Meetup in 2013 which now has close to 3000 members. She was on the original team that helped Capital One move production workloads to AWS. Another company recruited her to help them move to the cloud. She led a team of 30 people in two countries, architected a SAAS IOT solution on AWS, and delivered a secure CI/CD pipeline based on her white paper, Balancing Security and Innovation with Event Driven Automation. She then moved into security research, writing articles for security publications and reverse engineering malware. She now offers training, pentesting, and other cloud security services through her company, 2nd Sight Lab. Teri has presented on cloud security at major security conferences including RSA, AWS re:Invent and re:Inforce, Countermeasure, SANS Networking, SANS Cloud Summit, Microsoft Build, Serverless Days London, and BSides. She is an IANS Faculty member and received the SANS Difference Makers Award for security innovation. She holds many security certifications including a GSE.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45019,
      "title": "",
      "name": "Teri Radichel"
    },
    {
      "description": "Ryan Cumming is a Senior Principal Developer at SEEK. He has over 15 years of industry experience as a web, mobile and application developer. While at Electronic Arts he was one of the leads of EA’s cloud transition for online gaming. After joining SEEK he has been in various roles, including moving SEEK’s job application experience to microservices and moving user authentication to signed JWTs. He is currently the technical lead for SEEK’s business-to-business integrations as well as being on their service-to-service authentication team. He is also a sporadic open source contributors which led to him becoming the proud father CVE-2002-1224.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45020,
      "title": "",
      "name": "Ryan Cumming"
    },
    {
      "description": "Michael Gianarakis is the co-founder and CEO of Assetnote, a platform for continuous monitoring of your external attack surface. Michael has presented at various industry events and meetups including DEF CON, Black Hat Asia, Thotcon, BSides Las Vegas, 44Con and Hack in the Box. Michael is also actively involved in the local security community in Australia where he is one of the organizers of the monthly SecTalks meetup as well as the hacker camp TuskCon.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45021,
      "title": "",
      "name": "Michael Gianarakis"
    },
    {
      "description": "Shubham Shah is the co-founder and CTO of Assetnote, a platform for continuous monitoring of your external attack surface. Shubham is a prolific bug bounty hunter in the top 50 hackers on HackerOne and has presented at various industry events including 44Con, QCon London, Kiwicon, BSides Canberra and WAHCKon. Shubham is also a founder of the charity Hackers Helping Hackers which provides hackers from under-represented and less privileged groups access to industry events, mentorship and training.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45022,
      "title": "",
      "name": "Shubham Shah"
    },
    {
      "description": "Tim is a Site Reliability Engineer at Netflix, working on the team responsible for the reliability of the Streaming Platform. Prior to becoming an SRE at Netflix, he worked at startups in roles focused on the operation, reliability, and security of their applications and infrastructure; as well as assuming the commander role in active security incidents. While he has primarily relinquished security responsibilities in his current position, it is still an area he is deeply passionate about and is a focus of the work he does. When not managing an incident or hacking on Go code, you are likely to find him up in San Francisco either vegging out with games on his PC, behind his mixer, or helping out in the Go community.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45023,
      "title": "",
      "name": "Tim Heckman"
    },
    {
      "description": "Paul Theriault runs the security testing team for Firefox, working to secure both the browser and the Web as an application platform. He has an extensive background in web security, from web app pentesting to contributing to web standards, and is currently the security lead for the FirefoxOS project.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45024,
      "title": "",
      "name": "Paul Theriault"
    },
    {
      "description": "Andrew Logue is a Systems Manager at REA Group. He leads a team of systems engineers supporting the consumer face of www.realestate.com.au, a leading source of Australian property data.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45025,
      "title": "",
      "name": "Andrew Logue"
    },
    {
      "description": "Vivek Ramachandran has been researching Wi-Fi security for over a decade. He discovered the Caffe Latte attack, broke WEP Cloaking, conceptualized enterprise Wi-Fi Backdoors, created a number of projects including Chellam (a Wi-Fi Firewall), WiMonitor Enterprise (802.11ac monitoring), Chigula (Wi-Fi traffic analysis via SQL), and Deceptacon (IoT Honeypots). He is the author of multiple five star rated books on Wi-Fi security which have together sold over 20,000+ copies worldwide and have been translated into several languages.Vivek has over a decade of experience in security and has keen interest in the areas of wireless, mobile, network and web application pentesting, shellcoding, reversing, and exploit research. He loves programming in Python, C and Assembly. Vivek’s work on wireless security (Caffe Latte attack) has been quoted in a number of publications including BBC online, InfoWorld, MacWorld, The Register, and IT World Canada. He has also delivered training and spoken at several industry conferences including BlackHat USA, Europe and Abu Dhabi, Defcon, Brucon, HITB, and Hacktivity. Vivek is also the Founder and CEO of Pentester Academy, AttackDefense.com and Hacker Arsenal. Pentester Academy now trains thousands of customers from government agencies, Fortune 500 companies and smaller enterprises from over 90 countries.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45026,
      "title": "",
      "name": "Vivek Ramachandran"
    },
    {
      "description": "Will Hackett is a Senior Developer at SEEK — Australia's no. 1 employment, career and recruitment site. Will has had previous roles as a Lead Developer at Localz and Senior Developer at InnoWell; as well as being a co-founder and technical lead at OpenClub. Since joining SEEK, Will has focussed on the Single Sign On transformation, specifically rolling out OAuth 2.0 + OIDC to the growing array of progressive web apps at SEEK.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45027,
      "title": "",
      "name": "Will Hackett"
    },
    {
      "description": "Toni is a snowboarder turned software engineer turned security consultant. She's won a few scholarships in her quest to get more women into tech and her superpower is supporting others to do 'all the things'. She's a firm believer in ‘you need to see it to be it’ and puts herself out there so others will step up and challenge the status quo.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45028,
      "title": "",
      "name": "Toni James"
    },
    {
      "description": "Andrew is an experienced Software Engineer, who has more recently focused on Application Security, specifically Secure Code.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45029,
      "title": "",
      "name": "Andrew Bailey"
    },
    {
      "description": "Liam is a former developer turned pentester. His passion is not just breaking systems, but providing empathetic and actionable advice on how they can be improved. Liam is Director of Consulting at Assurance and is a duck enthusiast \\_o",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45030,
      "title": "",
      "name": "Liam O"
    },
    {
      "description": "Mike is the founder & CEO of Xceptional, a tech platform that connects autistic people to jobs in IT and has been featured on ABC’s Employable Me. Xceptional has been recognised by a number of awards, including Westpac Business of Tomorrow and the Google.Org Impact Challenge. In his spare time, Mike is an elite runner with Team Brooks and has the world record for the fastest half marathon in a business suit!",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45031,
      "title": "",
      "name": "Mike Tozer"
    },
    {
      "description": "Victoria is an Agile Technology Leader in the Cyber Security space. Having kicked off her Technology career as a Software Engineer for 7 years, she loves working in Tech with diverse groups of people to collaborate on complex business - and now Security challenges. Her passion lies in fostering thriving Technology teams, in innovative leadership, coaching and continuous learning (which comes in handy now having moved into Security).",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45032,
      "title": "",
      "name": "Victoria Schiffer"
    },
    {
      "description": "errbufferoverfl was born of a moon-less night in an undisclosed location along the cyber ley lines. For the past three years errbufferoverfl has been using the mystical powers handed down for generations to write Python code and consult on security dark arts. She specialises in divination via web applications and calling upon the clouds to tell their dark secrets. She has strong opinions about client-side validation and how CSRF tokens should be handled. When she isn't testing web applications, writing code and zines you can find her in her garden tending to her poisonous plants and terrariums. Like all good cyber witches if unattended too long she will start divination by your laptop.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45033,
      "title": "",
      "name": "errbufferoverfl"
    },
    {
      "description": "Ozmart is a principal consultant at Aura Information Security in Australia, where he goes by the handle of 'Martin', pentests things, and writes reports. He's worked at a number of consultancies over the years, on both interesting and mundane (like this bio) engagements, across most industries.",
      "link": "",
      "conference": "APPSECDAY2019",
      "twitter": "",
      "updated_at": "2019-10-25T13:37+0000",
      "id": 45034,
      "title": "",
      "name": "Ozmart"
    }
  ],
  "updated_at": "2019-10-25T13:37+0000"
}