{
  "updated_at": "2019-10-21T02:23+0000",
  "schedule": [
    {
      "end_date": "2019-10-25T22:00+0000",
      "updated_at": "2019-10-21T02:02+0000",
      "description": "Follow the signs to the registration area, through the lobby, down the escalators and straight ahead. Please be sure to have your ticket QR code ready for scanning to facilitate the registration process. Please wear your badge at ALL times while at the event. Those that are badge-less will be asked to leave. Friday is a training-only day; please see the schedule for details.",
      "link": "",
      "includes": "",
      "id": 43110,
      "speakers": [],
      "start_date": "2019-10-25T11:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42013,
      "location": 42018,
      "title": "Training Registration"
    },
    {
      "end_date": "2019-10-25T16:00+0000",
      "updated_at": "2019-10-21T02:03+0000",
      "description": "What goes into building a secure kubernetes cluster? Most of the reading you’ll find focuses on TLS and container design. An area that is often overlooked is identity management. Who’s accessing the cluster? Why do they need access? Do they still need access? Are they accessing the cluster using the correct credentials? In this class we’ll build a kubernetes cluster with identity management as the primary focus. You’ll learn how to:\r\n\r\n* Use centralized authentication for the nodes and masters at the host level\r\n* Integrate a running cluster with OpenID Connect\r\n* Automate the creation of network and pod security policies\r\n* Lock down access to the Kubernetes dashboard\r\n* Integrate Jenkins into your cluster and lock down its access\r\n\r\nIn addition to building your cluster, we’ll explore how identity interacts through your pipeline and container registry strategies. By the time you’re done with this class you’ll have seen how identity and automation plays a crucial role in securing your clusters.",
      "link": "",
      "includes": "",
      "id": 43111,
      "speakers": [
        43135
      ],
      "start_date": "2019-10-25T12:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42014,
      "location": 42019,
      "title": "Building Secure Kubernetes Clusters with Identity Management"
    },
    {
      "end_date": "2019-10-25T16:00+0000",
      "updated_at": "2019-10-21T02:03+0000",
      "description": "Want to learn more about digital forensics? Curious about tools like Volatility, Autopsy, FTK Imager, and Wireshark just to name a few? In this workshop we will conduct an investigation, examining artifacts from a \"case\" and putting the pieces together to figure out the how, what, why, and who. There will also be flags to discover in the evidence for additional fun!\r\n",
      "link": "",
      "includes": "",
      "id": 43112,
      "speakers": [
        43136,
        43137
      ],
      "start_date": "2019-10-25T12:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42014,
      "location": 42020,
      "title": "Dead Box...Not Dead Body"
    },
    {
      "end_date": "2019-10-25T21:00+0000",
      "updated_at": "2019-10-21T02:03+0000",
      "description": "With all new logs and updated material from our previous threat hunting workshops, this hands-on training class will walk attendees through leveraging the open source Elastic (ELK) stack to proactively identify malicious activity hiding within diverse data sets. The basic tools and techniques taught during this class can be used to investigate isolated security incidents or implemented at scale for continuous monitoring (SIEM) and threat hunting. Attendees will be provided with access to a preconfigured Elastic stack cluster and extensive sample logs containing malicious events waiting to be discovered on a simulated enterprise network. Attacker artifacts will be mapped to the MITRE ATT&CK Framework and tagged accordingly in the provided logs to help demonstrate the value of log enrichment, showcase both common and novel real-world attacker TTPs, and leverage a methodological approach to adversary and anomaly detection. Emphasis will be placed on live demos and practical training exercises throughout. The training will conclude with a friendly CTF tournament to give attendees the opportunity to collaborate and compete on teams in order to put their learning into practice and win some prizes.\r\n",
      "link": "",
      "includes": "",
      "id": 43113,
      "speakers": [
        43138,
        43140,
        43141
      ],
      "start_date": "2019-10-25T12:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42014,
      "location": 42022,
      "title": "Threat Hunting with the Elastic Stack"
    },
    {
      "end_date": "2019-10-26T01:00+0000",
      "updated_at": "2019-10-21T02:04+0000",
      "description": "Pros vs Joes is a Capture the Flag event where inexperienced users learn from seasoned professionals in a fierce competition of attack and defend. Blue Teams of Joes work with Pro Captains to compete against other defending Teams, protecting horrifically vulnerable networks from assault by a dangerous and relentless Professional Red Team. Later in the day, Blue Teams turn Purple and can go offensive, attacking the other competing teams. After the dust settles at the end of the day, Blue and Red discuss events to help further mentoring and learning of defensive and offensive tradecraft. Come witness the teams do battle after weeks of preparation. Only the strongest will survive, but all will learn and have fun!\r\n\r\nPros V Joes is now backed by CTF Factory, Inc, a charitable, non- profit 501(c)(3) corporation. The company was founded by PvJ Staff and remains deeply intertwined with the group, supporting all of their events. The company’s core mission is continued support of the community from whence it came, while also providing more to help training in venues beyond the BSides community. Please come check us out, and if you like what you see, feel free to give a donation to support our efforts to help folks get their start in our community and industry! We will have some swag available as thanks for donations, but supplies will be limited.\r\n",
      "link": "",
      "includes": "",
      "id": 43114,
      "speakers": [],
      "start_date": "2019-10-25T17:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42014,
      "location": 42019,
      "title": "Pros Vs. Joes CTF"
    },
    {
      "end_date": "2019-10-26T01:00+0000",
      "updated_at": "2019-10-21T02:04+0000",
      "description": "OpenSOC is a DFIR challenge meant to teach practical incident response skills in an environment that very closely resembles a real enterprise network. This virtual environment is a scaled down version of what you would find in an enterprise network, including: workstations, servers, firewalls, email, web browsing, user activity, etc. Simulated users are browsing the Internet, downloading files, watching videos, and accessing LAN resources. This creates a high fidelity training environment for unleashing real-world attacks and testing a responders ability to filter out the noise and find malicious activity on the network.\r\n\r\nThis isn’t just another CTF. We’ve built this platform to train real-world responders to handle real-world situations.\r\n\r\nWhat’s even better? 100% of the security tools demonstrated on OpenSOC are FREE and OPEN SOURCE! These projects include Wazuh + ossec, Kolide + osquery, Suricata, Snort, Moloch, OPNsense, pfSense and Graylog bringing it all together in an awesome way.\r\n\r\nThe Challenge:\r\n\r\n1) Given an initial IOCs (indicator of compromise (or pivot point)), identify attacks that are being carried out against and within the enterprise environment. 2) Trace the attackers throughout the kill chain, submitting key IOCs and observables to the scoreboard as you reveal their tactics. 3) Reverse engineer any artifacts connected to hostile activities. 4) Perform forensics analysis on PCAPs (Packet Captures), memory images, etc. 5) Win awesome prizes, learn new skills, and get experience with some of the best OPEN SOURCE tools for SecOps!",
      "link": "",
      "includes": "",
      "id": 43115,
      "speakers": [],
      "start_date": "2019-10-25T17:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42014,
      "location": 42020,
      "title": "OpenSOC.io Blueteam CTF"
    },
    {
      "end_date": "2019-10-26T22:00+0000",
      "updated_at": "2019-10-21T02:05+0000",
      "description": "Registration Follow the signs to the Registration desk down the escalators (or elevators) to the lower level to get checked in for the event. Please be sure to have your ticket QR code ready for scanning to facilitate the registration process. Please wear your badge at ALL times while at the event. Those that are badge-less will be asked to leave.\r\n\r\nBSidesDC Storefront When it's not registration, the location becomes your Information Kiosk and BSidesDC storefront! Stop by and browse our wide range of fine BSidesDC apparel, including our luxurious, heavy duty hooded sweatshirts, as well as T-shirts from a variety of BSidesDC events (currently the excess of previous years and this year).",
      "link": "",
      "includes": "",
      "id": 43116,
      "speakers": [],
      "start_date": "2019-10-26T12:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42013,
      "location": 42018,
      "title": "Registration / BSidesDC Storefront"
    },
    {
      "end_date": "2019-10-26T21:00+0000",
      "updated_at": "2019-10-21T02:06+0000",
      "description": "The Ethernet kind of networking; no talking to your neighbors required! (But we're all hackers here, so you should at least think about making a friend or two!)\r\n\r\nInfosec professionals unanimously agree that network security is a must to protect organizational assets. That's nice and all, but what about your assets? Many consumer-grade routing appliances provide a limited set of functions to secure the resources behind them, but enterprise-grade networking hardware comes with an enterprise-grade price tag. What's a hacker to do? Enter: the aptly-named \"pro-sumer\"-grade hardware. While there are multiple hardware devices that fit this label, this training course will focus on the Ubiquiti EdgeRouter X; neither of your trainers are paid, sponsored or affiliated with Ubiquiti in any way, we just really like its balance between features and cost.\r\n\r\nIn this course, we'll go over all of the features of the EdgeRouter X and how those features can be used to protect the devices on your home network. Ubiquiti has pretty good documentation, but knowing the \"why\" and \"when\", along with the \"how\", is critical for ANY new hardware or software deployment in order for the end user to take full advantage of the product.\r\n\r\nThe full set of topics we'll cover can be found below:\r\n\r\n1. Connecting to the configuration interface\r\n2. Basic Setup Hygiene\r\n3. Traffic Analysis\r\n4. Routing\r\n5. Firewall\r\n6. NAT\r\n7. Port Forwarding\r\n8. DNS\r\n9. VPN\r\n10. Packet Capture\r\n11. The Configuration Tree\r\n12. Mastering the Balancing Act Between Features & Performance\r\n13. CLI Overview\r\n\r\nWe encourage anyone who's interested to join us, but those who are looking to enhance their home network security posture on a budget without jumping into the world of DD-WRT will find this training particularly useful.",
      "link": "",
      "includes": "",
      "id": 43117,
      "speakers": [
        43161,
        43162
      ],
      "start_date": "2019-10-26T12:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42014,
      "location": 42019,
      "title": "Professional Networking on a Personal Budget"
    },
    {
      "end_date": "2019-10-26T21:00+0000",
      "updated_at": "2019-10-21T02:07+0000",
      "description": "Deep dive malware analysis is primarily a static approach, using limited debugging for targeted purposes. The approach can provide every last detail or be used to quickly identify IOC’s and Yara rules, but the method is often shrouded in mystery. It can take years to develop and most analysts don’t have the time to fumble around trying to build this advanced skill. Save yourself countless hours and guesswork and get an up-close view of the approach. This lab based workshop will guide you through the deep dive process using Ghidra to analyze a malicious RAT from start to finish. You’ll learn how to triage a function, judge what to analyze and what to skip, verify the full C2 network protocol using Python, and much more. See the benefits and learn how you can practice this approach in your own job to dramatically elevate your RE skill level.\r\n\r\nStudent Requirements:\r\n\r\n* Participants need to be proficient in reading and debugging x86 assembly code and have a basic understanding of programming in python for this advanced class\r\n\r\nStudents must bring a 64 bit laptop with:\r\n* VirtualBox or VMWare installed\r\n* 25GB of free disk space to install a provided windows analysis VM\r\n* 6GB of RAM to dedicate to the provided windows VM\r\n* 1 USB slot\r\n* An internet connection to activate the provided windows VM",
      "link": "",
      "includes": "",
      "id": 43118,
      "speakers": [
        43167
      ],
      "start_date": "2019-10-26T12:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42014,
      "location": 42020,
      "title": "A Crash Course In Deep Dive Malware Analysis"
    },
    {
      "end_date": "2019-10-26T16:30+0000",
      "updated_at": "2019-10-21T02:08+0000",
      "description": "During this training session, attendees will get hands-on exposure to crafting and reverse engineering malicious Android applications using free tools. They will also learn how to leverage forensics techniques to gain access to vital information during data collection and analysis.",
      "link": "",
      "includes": "",
      "id": 43119,
      "speakers": [
        43163,
        43164,
        43165,
        43166
      ],
      "start_date": "2019-10-26T12:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42014,
      "location": 42022,
      "title": "FrankenDROID: Building and Dissecting Malicious APKs (session 1)"
    },
    {
      "end_date": "2019-10-26T22:00+0000",
      "updated_at": "2019-10-21T01:36+0000",
      "description": "",
      "link": "",
      "includes": "",
      "id": 43120,
      "speakers": [],
      "start_date": "2019-10-26T13:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42015,
      "location": 42024,
      "title": "RF Hacker's Sanctuary/ Wireless CTF"
    },
    {
      "end_date": "2019-10-26T13:15+0000",
      "updated_at": "2019-10-21T01:36+0000",
      "description": "",
      "link": "",
      "includes": "",
      "id": 43121,
      "speakers": [],
      "start_date": "2019-10-26T13:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42013,
      "location": 42029,
      "title": "Welcome"
    },
    {
      "end_date": "2019-10-26T14:00+0000",
      "updated_at": "2019-10-21T01:37+0000",
      "description": "",
      "link": "",
      "includes": "",
      "id": 43122,
      "speakers": [],
      "start_date": "2019-10-26T13:15+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42013,
      "location": 42029,
      "title": "Keynote"
    },
    {
      "end_date": "2019-10-26T22:00+0000",
      "updated_at": "2019-10-21T01:37+0000",
      "description": "",
      "link": "",
      "includes": "",
      "id": 43123,
      "speakers": [],
      "start_date": "2019-10-26T14:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42015,
      "location": 42023,
      "title": "Lockpick/IOT Village"
    },
    {
      "end_date": "2019-10-26T22:00+0000",
      "updated_at": "2019-10-21T01:38+0000",
      "description": "",
      "link": "",
      "includes": "",
      "id": 43124,
      "speakers": [],
      "start_date": "2019-10-26T14:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42015,
      "location": 42025,
      "title": "CryptKids"
    },
    {
      "end_date": "2019-10-26T14:30+0000",
      "updated_at": "2019-10-21T01:38+0000",
      "description": "",
      "link": "",
      "includes": "",
      "id": 43125,
      "speakers": [],
      "start_date": "2019-10-26T14:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42013,
      "location": 42029,
      "title": "Morning Break"
    },
    {
      "end_date": "2019-10-26T15:20+0000",
      "updated_at": "2019-10-21T02:08+0000",
      "description": "There is a new ecosystem underway that will impact everyone, especially the irritated people in the U.S. who have received more than 48 billion robocalls last year. This new ecosystem will hopefully put an end to these annoying and fraudulent robocalls calls, which the Federal Communications Commission (FCC) estimates will constitute more than half of all phone calls placed in the U.S. this year. The FCC and major telecommunications companies including Comcast, AT&T, and T-Mobile are behind a new, global technology standard called SHAKEN/STIR (Signature-based Handling of Asserted Information using ToKENs and Secure Telephony Identity Revisited) to combat robocalls and caller ID spoofing. This new standard addresses the issue of commercial robocallers who are impersonating other callers and committing fraud via Caller ID.\r\n\r\nPublic key infrastructure (PKI) is the backbone of the SHAKEN/STIR global technology standard. In order to build this new ecosystem to facilitate stronger identities for each and every call generated, an effective PKI ecosystem must be implemented. Strong identities and controls will be needed to ensure call identities are trusted globally. PKI is the technology that will be used to identify and verify each phone call. SHAKEN/STIR will shift the identity details from the call originator to the trusted telephone company routing the call. The industry – technology infrastructure, telecommunications, and government entities – needs to work together on a solution that will reduce fraud and put an end to robocalls. As this technology standard evolves and deployed, it is important to identify the security risks telecommunications companies will face and how enterprises can benefit from this work. Security will be required at every level of SHAKEN/STIR implementation.",
      "link": "",
      "includes": "",
      "id": 43126,
      "speakers": [
        43143
      ],
      "start_date": "2019-10-26T14:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42026,
      "title": "How PKI Can Fix the Robocall Problem"
    },
    {
      "end_date": "2019-10-26T15:20+0000",
      "updated_at": "2019-10-21T01:39+0000",
      "description": "",
      "link": "",
      "includes": "",
      "id": 43127,
      "speakers": [],
      "start_date": "2019-10-26T14:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42013,
      "location": 42027,
      "title": "CryptKids Keynote"
    },
    {
      "end_date": "2019-10-26T15:20+0000",
      "updated_at": "2019-10-21T02:09+0000",
      "description": "There have been many attempts to apply AI methods to software, but reverse engineering remains a highly laborious process. It's 2019 and there's Watson for medicine, but why don't we have JARVIS for code? Manual software reverse engineering remains foundational to both defensive and offensive cyber. We'll dive into the software reverse engineering process and talk about which problems are solved, which problems haven't been tackled yet, and give a roadmap for future AI research towards automated reverse engineering.\r\n",
      "link": "",
      "includes": "",
      "id": 43128,
      "speakers": [
        43142
      ],
      "start_date": "2019-10-26T14:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42028,
      "title": "JARVIS for Code? Meaningful AI Research for Software Reverse Engineering"
    },
    {
      "end_date": "2019-10-26T16:20+0000",
      "updated_at": "2019-10-21T02:09+0000",
      "description": "As a security practitioner, the trend of Agile and DevSecOps is coming. Whether developers or management are pushing for it, you should be prepared. DevSecOps sets security as a metric of success for developers and encourages security to be a consideration continually through a project lifecycle. This is a vast improvement to the usual methods of taking security into consideration only at the end, in the beginning, or avoiding talking to security at all. You should be seizing the opportunity to leverage the popular DevSecOps movement to your advantage. I want to arm you with ideas on education, resources, tools, and practices to do DevSecOps well from a Security department standpoint. At the end of my talk, I want you to be able to increase the security posture of your engineering teams without drastically increasing friction for any of the other teams.",
      "link": "",
      "includes": "",
      "id": 43129,
      "speakers": [
        43144
      ],
      "start_date": "2019-10-26T15:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42026,
      "title": "Are you ready to leverage DevSecOps? Get ready and use it for good."
    },
    {
      "end_date": "2019-10-26T16:20+0000",
      "updated_at": "2019-10-21T02:09+0000",
      "description": "Despite applying more automation than ever before to detection and response operations, organizations continue to be challenged by relatively unsophisticated attacks. Reliable detection requires time-consuming analysis and a level of data aggregation and correlation that is at best an art, and at worst cost-prohibitive. Meanwhile, attackers remain agile and inventive, continually (and rapidly) changing their infrastructure and approach with minimal costs and maximum benefit.\r\n\r\nWhile there are some things computers do far better than humans – rote, repetitive tasks and complex calculations – we will always be masters of analysis given our ability for complex thought, decision-making, and visual learning. With the introduction of security automation and orchestration to the defensive tool set, blue teams can now automate some of their investigative playbooks and save precious cycles. Unfortunately, this capability often drives automation for its own sake and expands already monolithic tool sets, rather than actually empowering our humans. Simply doing analysis faster is only a small part of the solution.\r\n\r\nHow can we reframe this problem to alter the calculus of attack and defense? Automation for the sake of doing so is a common trap that can actually degrade our capabilities and waste defensive cycles. However, automation with the intent of providing context and guided workflow can be a game changer for defenders. With proper planning and an incremental, modular approach to automation in areas such as rapid research, contextualization, and decision support, we can measurably improve our defenses and start leveling the playing field.",
      "link": "",
      "includes": "",
      "id": 43130,
      "speakers": [
        43145,
        43146
      ],
      "start_date": "2019-10-26T15:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42027,
      "title": "Automating Analysis Without Automating the Analyst"
    },
    {
      "end_date": "2019-10-26T16:20+0000",
      "updated_at": "2019-10-21T02:09+0000",
      "description": "You have a strong password and a unique PIN. You're behind seven proxies and your system is locked down tight. Plus you control physical access to your devices, so you can be reasonably certain you're secure. Victims of domestic violence and other vulnerable populations often don't have the luxury of keeping their passwords secret or denying root-level access to their adversary. They're faced with the ultimate insider threat- one that knows everything about them, has complete access to their digital life, and can even dictate their security policy. For them, their proximity to their attacker means that many security solutions are ineffective and, in some cases, even harmful to implement. This talk will explore cases where traditional security measures fail an already-vulnerable population, how we need to rethink our approach to security, and what we can do to help.",
      "link": "",
      "includes": "",
      "id": 43131,
      "speakers": [
        43148
      ],
      "start_date": "2019-10-26T15:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42028,
      "title": "The APT @home - when the attacker knows your mother's maiden name"
    },
    {
      "end_date": "2019-10-26T17:30+0000",
      "updated_at": "2019-10-21T01:42+0000",
      "description": "",
      "link": "",
      "includes": "",
      "id": 43132,
      "speakers": [],
      "start_date": "2019-10-26T16:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42013,
      "location": 42018,
      "title": "Lunch"
    },
    {
      "end_date": "2019-10-26T21:30+0000",
      "updated_at": "2019-10-21T02:11+0000",
      "description": "During this training session, attendees will get hands-on exposure to crafting and reverse engineering malicious Android applications using free tools. They will also learn how to leverage forensics techniques to gain access to vital information during data collection and analysis.",
      "link": "",
      "includes": "",
      "id": 43133,
      "speakers": [
        43163,
        43164,
        43165,
        43166
      ],
      "start_date": "2019-10-26T17:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42014,
      "location": 42022,
      "title": "FrankenDROID: Building and Dissecting Malicious APKs (session 2)"
    },
    {
      "end_date": "2019-10-26T18:20+0000",
      "updated_at": "2019-10-21T02:11+0000",
      "description": "Abstract: This briefing quickly introduces the DoD Cyber Crime Center (DC3) and then gives into a discussion about what cyber threat intel is, the cyber kill chain (using movie gifs) and ends with a brief intro of some APTs. The talk is geared at an introductory level for people who don't specialize or would like to learn more about CTI and APTs.",
      "link": "",
      "includes": "",
      "id": 43134,
      "speakers": [
        43149,
        43150
      ],
      "start_date": "2019-10-26T17:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42026,
      "title": "Cyber Threat Intelligence and APT 101"
    },
    {
      "end_date": "2019-10-26T18:20+0000",
      "updated_at": "2019-10-21T02:12+0000",
      "description": "Current security operations in certain companies involve consumption of a feed of cyber intelligence data - information about current threats that may compromise corporate networks. Due to the large number of possible threats and related information generated each day, analysis time of each entry in the feed - with respect to its severity and impact - can take hours after time of first sighting. Using our Integrated Adaptive Cyber Framework (IACD), we implement flexible automation in the networks of three banks - MasterCard, Huntington, and Regions Financial - to decrease average response time from roughly 6 hours to under 3 minutes.\r\n\r\nWorking in conjunction with the Financial Service Information Sharing and Analysis Center (FS-ISAC) and the banks, we use Security Orchestration, Automation and Response (SOAR) to parse raw threat intelligence into standardized Indicators of Compromise (IoCs), which common security orchestration tools can intake and respond to. As part of our threat intelligence parsing, we utilize external enrichment tools to provide a relevant \"score\" of how severe a particular IoC may be. Providing a central feed of parsed, enriched IoCs allows security orchestration tools to make good, consistent judgements on how best to respond to an incoming threat, taking into account possible impact to the specific network in management. We touch on the importance of automation making non-damaging changes to the configuration of the network (e.g. we should not accidentally block a commonly-used domain).",
      "link": "",
      "includes": "",
      "id": 43135,
      "speakers": [
        43151
      ],
      "start_date": "2019-10-26T17:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42027,
      "title": "Bringing IACD (Integrated Adaptive Cyber Defence) to the Financial Sector"
    },
    {
      "end_date": "2019-10-26T18:20+0000",
      "updated_at": "2019-10-21T02:12+0000",
      "description": "The Malware Behavior Catalog (MBC) is a publicly available framework defining behaviors and code characteristics to support malware analysis-oriented use cases, such as tagging, provenance and similarity analysis, and standardized reporting. As a malware-centric extension of the MITRE ATT&CKTM knowledge base, MBC draws upon ATT&CK’s success by applying its philosophy and methodology to malware. Namely, MBC maintains a malware, code-oriented perspective and focuses on real-world use of behaviors through empirical malware examples (note there is no formal relationship between ATT&CK and MBC). The presentation discusses real-world applications of MBC and will show how behavior indicators identified through static and dynamic analysis can be mapped to MBC, illustrating the depth and precision MBC provides.",
      "link": "",
      "includes": "",
      "id": 43136,
      "speakers": [
        43152,
        43153
      ],
      "start_date": "2019-10-26T17:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42028,
      "title": "Malware Behavior Catalog"
    },
    {
      "end_date": "2019-10-26T19:20+0000",
      "updated_at": "2019-10-21T02:12+0000",
      "description": "By our count, there are 100,000+ security related Twitter accounts, 2000+ blogs, 1000+ conferences/events, 75+ podcasts, and countless other social media sources. The momentary euphoria of catching up on your Twitter feed hardly alleviates the more frequent anxiety of being behind on infosec “news” when work and life get busy. While there are many tools for aggregating and searching social media content, none of them are designed to identify and extract quality data for a particular topic. Our research shows that only 30% of Tweets by infosec-focused accounts are original content and only a fraction of those provide actionable information. Are you new to security and want to know where to find the most original and timely social media posts? Do you want data-driven answers to who the real influencers are in our field? What about those practitioners who are doing great work, but are flying under the radar? In this talk, we will demonstrate tools we have built to address these questions and derive contextually relevant value from more social media sources in less time. We will also be sharing details about soon to be available public access to the tools and plans for ongoing feature additions and refinements. With so many people doing and sharing amazing work, why miss out on content that would be impactful to you, because you weren’t following the right person, had a busy day, or didn’t have the budget or time to go a conference?",
      "link": "",
      "includes": "",
      "id": 43137,
      "speakers": [
        43145,
        43147
      ],
      "start_date": "2019-10-26T18:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42028,
      "title": "Social Media OSINT Without the Indigestion"
    },
    {
      "end_date": "2019-10-26T19:20+0000",
      "updated_at": "2019-10-21T02:12+0000",
      "description": "The Offensive Security Certified Professional (OSCP) is one of the most well-recognized and respected certifications in the security industry. In order to become certified, students must complete Offensive Security’s Penetration Testing with Kali Linux (PwK) course and pass the 24-hour hands-on exam. For people that are interested to learn more about this course and how to prepare for it then this talk is for them. During the talk students will be provided resources and tips to prepare for the course. As for the exam, Offensive Security has launched a proctoring program for the OSCP leaving many questions for students on how to prepare for the exam. Guidance will also be provided on how the proctoring part of the exam works and how people should prepare for it.\r\n\r\nTalk Outline: Introduction: Whoami Agenda: What is the OSCP Course prerequisites Preparing for OSCP Resources to Prepare for OSCP\r\nPWK Course Lab Environment Exam Preparation Proctoring Guidance Tips/Tricks for the Exam References Q/A",
      "link": "",
      "includes": "",
      "id": 43138,
      "speakers": [
        43155
      ],
      "start_date": "2019-10-26T18:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42027,
      "title": "The journey begins: Preparing for Offensive Security Penetration Testing with Kali (PWK) course for the OSCP"
    },
    {
      "end_date": "2019-10-26T19:20+0000",
      "updated_at": "2019-10-21T02:13+0000",
      "description": "Close calls. Emergency situations. Team failures. 0-day response. We encounter these regularly. We prepare. What if the worst case scenario happens, then happens again? What do you call on then? Listen as I describe what skills remained to rebuild my internal working structure when I was wiped to having the abilities of a 6-mo. Courage comes in many forms. Resourcefulness and architecting personal and professional triumphs come from what you have on hand in the moment. Sharing my experience and how I created a binary electrical system using my tongue against my teeth will show: (1) You are more prepared than you imagine, (2) your human team is amazing, (3) your purpose is clearly defined for you every moment, (4) you have resources even when nothing is going your way.",
      "link": "",
      "includes": "",
      "id": 43139,
      "speakers": [
        43154
      ],
      "start_date": "2019-10-26T18:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42026,
      "title": "Courage from a Zero Day Inside"
    },
    {
      "end_date": "2019-10-26T20:20+0000",
      "updated_at": "2019-10-21T02:13+0000",
      "description": "Until now, the techniques used for backdooring and code injection in PE files have been restricted mainly to the following:\r\n\r\n* Finding code-caves, injecting the malicious code in those code-caves, changing the entry-point of the program to point to these code caves.\r\n* Adding a new section to the PE file, adding malicious code to the section, making the section executable.\r\n\r\nThese approaches impose restrictions on the size of code that can be injected and they’re extremely prone to identification by endpoint detection systems. The endpoint detection systems can:\r\n\r\n* verify whether the sizes of various sections mentioned in the section table match with their actual sizes in the PE file.\r\n* check for unusual section names in the PE file to identify sections that have been appended to the end of the PE file.\r\n* check the section table for permissions granted to various sections of the PE file to identify sections other than .text or other standard section that have been granted suspicious permissions.\r\n\r\nThis is where PErfidious comes into play. PErfidious is a Python3 tool that aims to directly take a benign PE executable and malicious shellcode, transform the malicious shellcode and inject the transformed shellcode into various parts of the executable’s .text section, thus completely avoiding the need to look for code-caves or creating additional sections. After injection, PErfidious recalculates the size of the .text section and all the virtual address changes caused by the increase in the size of the .text section and modifies respective fields in the PE header, thus making sure that the PE file doesn’t look injected.",
      "link": "",
      "includes": "",
      "id": 43140,
      "speakers": [
        43156
      ],
      "start_date": "2019-10-26T19:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42026,
      "title": "PErfidious: Make PE backdooring great again!"
    },
    {
      "end_date": "2019-10-26T20:20+0000",
      "updated_at": "2019-10-21T02:14+0000",
      "description": "Are you worried that your home or business router is compromised? Hard to tell if it is without a vendor notification.... This talk explains the problem of implanted routers, and offers a new process and open source software to identify them - totally vendor agnostic.",
      "link": "",
      "includes": "",
      "id": 43141,
      "speakers": [
        43157
      ],
      "start_date": "2019-10-26T19:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42027,
      "title": "Are your Network Devices Good or Evil? Introducing CHOX"
    },
    {
      "end_date": "2019-10-26T23:00+0000",
      "updated_at": "2019-10-21T01:47+0000",
      "description": "",
      "link": "",
      "includes": "",
      "id": 43142,
      "speakers": [],
      "start_date": "2019-10-26T20:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42014,
      "location": 42028,
      "title": "I am the cavalry..."
    },
    {
      "end_date": "2019-10-26T21:30+0000",
      "updated_at": "2019-10-21T02:14+0000",
      "description": "Influence operations, like zombie bites, are a problem that won't go away on their own. This talk will cover several different styles of influence operations including some targeting infosec practitioners, several models for describing influence operations, and cover strategies for countering influence operations.",
      "link": "",
      "includes": "",
      "id": 43143,
      "speakers": [
        43158
      ],
      "start_date": "2019-10-26T20:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42026,
      "title": "28 Seconds Later: The Epidemiologic Triangle and Other Models for Influence Operations"
    },
    {
      "end_date": "2019-10-26T21:30+0000",
      "updated_at": "2019-10-21T02:14+0000",
      "description": "Go has turned out to be an excellent language for all sorts of things, notably writing malware. In this talk we'll look at the more devious side of programming. We'll see how writing malware is a little different than writing normal programs and we'll look into writing code to perform a handful of techniques relevant to sneaking comms out of a network. By the end of the talk, we'll have a fully-working, (nearly) weapons-grade tool which pushes the bounds of what common defenses will detect. All presented source code will be made available. This talk assumes some familiarity with Go, though any programming background is probably sufficient.",
      "link": "",
      "includes": "",
      "id": 43144,
      "speakers": [
        43159,
        43160
      ],
      "start_date": "2019-10-26T20:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42027,
      "title": "Hands-on Writing Malware in Go"
    },
    {
      "end_date": "2019-10-27T20:00+0000",
      "updated_at": "2019-10-21T02:15+0000",
      "description": "Registration Follow the signs to the Registration desk down the escalators (or elevators) to the lower level to get checked in for the event. Please be sure to have your ticket QR code ready for scanning to facilitate the registration process. Please wear your badge at ALL times while at the event. Those that are badge-less will be asked to leave.\r\n\r\nBSidesDC Storefront When it's not registration, the location becomes your Information Kiosk and BSidesDC storefront! Stop by and browse our wide range of fine BSidesDC apparel, including our luxurious, heavy duty hooded sweatshirts, as well as T-shirts from a variety of BSidesDC events (currently the excess of previous years and this year).",
      "link": "",
      "includes": "",
      "id": 43145,
      "speakers": [],
      "start_date": "2019-10-27T12:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42013,
      "location": 42018,
      "title": "Registration / BSidesDC Storefront"
    },
    {
      "end_date": "2019-10-27T20:00+0000",
      "updated_at": "2019-10-21T02:16+0000",
      "description": "The Cloud. From email to storage, to social media and computing; we use it in our everyday lives and it impacts all aspects of technology. What started out as simple online storage has grown and expanded, and cloud computing today forms the basis for performing powerful processing capabilities at a fraction of traditional equipment costs. While there are now many Cloud providers, one question remains: Is the Cloud truly secure? What were to happen if a data breach in the Cloud occurred, and more importantly, what information will the security professional need to know in order to conduct a forensics investigation?\r\n\r\nThe focus of this training will be two-fold; first, to provide a high-level cloud-agnostic overview of Cloud computing, to identify some of its risks, and explore some of the tools and techniques that are used during a cloud-based digital forensics investigation. Second, students will form into teams and battle it out in a CTF-style challenge to test their comprehension of the material and their skill sets by investigating a digital image of a Cloud-based server, searching for \"flags\" to redeem in order to earn points and compete for some sweet prizes from our friends at No Starch Press!",
      "link": "",
      "includes": "",
      "id": 43146,
      "speakers": [
        43169
      ],
      "start_date": "2019-10-27T12:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42014,
      "location": 42019,
      "title": "Cloud Forensics Workshop and CTF Challenge"
    },
    {
      "end_date": "2019-10-27T20:00+0000",
      "updated_at": "2019-10-21T01:50+0000",
      "description": "",
      "link": "",
      "includes": "",
      "id": 43147,
      "speakers": [],
      "start_date": "2019-10-27T13:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42015,
      "location": 42024,
      "title": "RF Hacker's Sanctuary/ Wireless CTF"
    },
    {
      "end_date": "2019-10-27T16:00+0000",
      "updated_at": "2019-10-21T02:17+0000",
      "description": "Our training class will cover what it takes to be a kid in security. This isn't just about computers but about security in general. We will be teaching about logic and how it helps with many decisions in life. We will be talking about Terminal Quest and using that to learn the basics of Linux. We will be talking about how drones and other toys can teach us to code as well. We are going to teach how to ask questions properly to get the answers we are looking for from adults, but at a level that we understand. We will be taking a field trip out into the Vendor Area’s where we will put these new skills into practice. We will learn how to \"hunt\" foxes - wireless foxes that is! This is going to be an interactive morning with us, and we won't be sitting the whole time. You may bring a computer (you will only be using a browser), but it is optional.",
      "link": "",
      "includes": "",
      "id": 43148,
      "speakers": [
        43168,
        43194
      ],
      "start_date": "2019-10-27T13:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42015,
      "location": 42025,
      "title": "How to get started in hacking and coding. (Elementary and Middle school)"
    },
    {
      "end_date": "2019-10-27T13:50+0000",
      "updated_at": "2019-10-21T02:17+0000",
      "description": "Dive into code signing and learn why you want to be attaching signatures to your code and how to quickly and securely incorporate code signing into your CI/CD pipeline.\r\n\r\nYou'll learn\r\n\r\n* How code signing and Authenticode work\r\n* How to get a code signing service setup quickly and securely for your organization that supports any Authenticode-supported file type, Microsoft Store packages (for side-loading), ClickOnce, and NuGet packages.\r\n* How Azure Key Vault can protect your code signing certificates in its Hardware Security Module (HSM)",
      "link": "",
      "includes": "",
      "id": 43149,
      "speakers": [
        43172
      ],
      "start_date": "2019-10-27T13:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42026,
      "title": "Signing your code the easy way"
    },
    {
      "end_date": "2019-10-27T13:50+0000",
      "updated_at": "2019-10-21T02:18+0000",
      "description": "The number one question every single network detection person gets asked: how do you deal with encrypted traffic? Threat actors leverage encryption to obfuscate their activities, sneaking past the border guards in their enchanted cloak, leveraging legitimate certificates or even worse, legitimate services to operate their C2. In 2017, a method for fingerprinting SSL clients and servers was released titled JA3 and JA3s respectively and with their release, network detection engineers rejoiced. JA3/JA3S seeks to profile the client and server software involved in an SSL/TLS session through fingerprinting their “hello” messages and the involved cryptographic exchange. This method is not without its’ nuances and in our experience putting it to the use, the nuances are critical to understand. This talk will give insights into our challenges, failures and successes with JA3 and JA3S while sharing tips for those seeking to begin using it for network detection.Z",
      "link": "",
      "includes": "",
      "id": 43150,
      "speakers": [
        43173,
        43174
      ],
      "start_date": "2019-10-27T13:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42027,
      "title": "Using JA3. Asking for a friend?"
    },
    {
      "end_date": "2019-10-27T14:30+0000",
      "updated_at": "2019-10-21T01:52+0000",
      "description": "",
      "link": "",
      "includes": "",
      "id": 43151,
      "speakers": [],
      "start_date": "2019-10-27T14:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42013,
      "location": 42029,
      "title": "Morning Break"
    },
    {
      "end_date": "2019-10-27T20:00+0000",
      "updated_at": "2019-10-21T01:52+0000",
      "description": "",
      "link": "",
      "includes": "",
      "id": 43152,
      "speakers": [],
      "start_date": "2019-10-27T14:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42015,
      "location": 42023,
      "title": "Lockpick/IOT Village"
    },
    {
      "end_date": "2019-10-27T20:00+0000",
      "updated_at": "2019-10-21T02:18+0000",
      "description": "PowerShell is one of the most versatile languages in use today and is being used beyond system administration. In today's environment, the language is being used for things such as defensive hunting, forensics, attacker reconnaissance, escalation, exfiltration, or lateral movement. This training event will provide hands-on exposure to the aforementioned areas using PowerShell across the filesystem as well as Enterprise services. Walking away, you will be better postured to identify these tactics or use them for specific purposes without adding anything additional to the network. The workshop requires a system with Windows 10 (PowerShell 5). If needed, a 180-day trial Windows 10 virtual machine instance can be downloaded from https://developer.microsoft.com/en-us/windows/downloads/virtual-machines.",
      "link": "",
      "includes": "",
      "id": 43153,
      "speakers": [
        43170
      ],
      "start_date": "2019-10-27T14:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42014,
      "location": 42020,
      "title": "The Evolution of PowerShell: Blue and Red Team Tactics"
    },
    {
      "end_date": "2019-10-27T15:20+0000",
      "updated_at": "2019-10-21T02:19+0000",
      "description": "0-day vulnerability research is a hot topic these days. Adversaries, governments, and researchers all have their secret stash of 0-days. Bug bounty programs have become evermore popular. With a tuned skill set, anyone can get started hunting bugs. Some do it for fun. Others do it for cash. We do it for a living. It’s our passion.\r\n\r\nHow does one pick a target to research? How does one improve the success rate of finding a 0-day? What skills are required? How does one deal with setbacks? We will go over these and several other questions via selected case studies of 0-days we have found in various high profile products. We will discuss ~10 0-days that haven’t been disclosed (at the time of submission) and go over various scenarios showing how and why these were found.\r\n\r\nIn order to be a successful researcher, there is a broad skill set and knowledge base required. Additionally, the mindset of a security researcher is a key driver of success.\r\n\r\nWe outline these points alongside real life scenarios of our 0-day discoveries this year, demonstrating that with the proper methodology, luck, and determination, anyone can achieve similar results and help contribute to making the world more secure.",
      "link": "",
      "includes": "",
      "id": 43154,
      "speakers": [
        43175,
        43176,
        43177
      ],
      "start_date": "2019-10-27T14:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42026,
      "title": "0-day Research Disassembled"
    },
    {
      "end_date": "2019-10-27T15:20+0000",
      "updated_at": "2019-10-21T02:19+0000",
      "description": "Organizations across the globe are looking for ways to use MITRE ATT&CK TM in their environment, but are unsure how or where to start. Our team is constantly receiving requests to teach their analysts how to relate reports to ATT&CK; it's a time-consuming process with a steep learning curve. We get it, reading reports line-by-line to search for adversarial tactics, techniques, and procedures (TTPs) and then verifying if those behaviors align to documented TTPs in ATT&CK is challenging. As ATT&CK team members who do this daily, we thought that there has to be a better way. Using our ATT&CK experience, Python, Natural Language Processing (NLP), and some WebDev, we created the Threat Report ATT&CK Mapping (TRAM) tool to automatically extract TTPs from a prose report.\r\n\r\nSo why should you care? Not only will this tool help the ATT&CK team keep our public repository of Groups and Software updated with the latest cyber trends and attacker methodologies, but it can help your internal organizations too. TRAM can analyze multiple reports, map them to ATT&CK, and provide insight to your overall threat landscape and security posture. This enables defenders to test whether current tools and procedures are effectively defending against their most common threats, while also allowing red teams to develop prioritized adversary emulation plans with these TTPs in mind.\r\n\r\nThis talk will review our methodology, discuss our challenges, and demonstrate how you can use the tool for your own organization. With the open-source release of this tool, anyone can go from an ATT&CK zero to hero in no time!",
      "link": "",
      "includes": "",
      "id": 43155,
      "speakers": [
        43178,
        43179
      ],
      "start_date": "2019-10-27T14:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42027,
      "title": "Keeping CTI on Track: An Easier Way to Map to MITRE ATT&CK"
    },
    {
      "end_date": "2019-10-27T15:20+0000",
      "updated_at": "2019-10-21T02:19+0000",
      "description": "Talented professionals form a fundamental cornerstone of any successful business, but how do we ensure successful retention and recruitment in an industry facing talent shortage? To promote a flowing talent acquisition pipeline, we’ll dive into the top reported methods used by cyber security professionals to search for jobs, their leading motivators, and how to leverage community support to enhance your employer brand. As we assess the ways that candidates approach their job search, you’ll gain valuable insights to help your organization increase brand visibility and lucrative retention and recruitment.",
      "link": "",
      "includes": "",
      "id": 43156,
      "speakers": [
        43180
      ],
      "start_date": "2019-10-27T14:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42028,
      "title": "Overcoming Workforce Retention and Recruitment Challenges in the Cybersecurity Community"
    },
    {
      "end_date": "2019-10-27T16:30+0000",
      "updated_at": "2019-10-21T01:54+0000",
      "description": "",
      "link": "",
      "includes": "",
      "id": 43157,
      "speakers": [],
      "start_date": "2019-10-27T15:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42013,
      "location": 42029,
      "title": "Lunch"
    },
    {
      "end_date": "2019-10-27T17:20+0000",
      "updated_at": "2019-10-21T02:20+0000",
      "description": "This four person panel looks at the various aspects of blue team life and tells true stories of nightmares experienced on the job during their nearly a century of combined experience. After each story, the panel will share the lessons learned during those times and strategies for avoiding these problems in the future. Come laugh at their misfortune and learn from their mistakes.\r\n",
      "link": "",
      "includes": "",
      "id": 43158,
      "speakers": [
        43181,
        43182,
        43183,
        43184
      ],
      "start_date": "2019-10-27T16:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42026,
      "title": "Tales from the Firewall"
    },
    {
      "end_date": "2019-10-27T17:20+0000",
      "updated_at": "2019-10-21T02:20+0000",
      "description": "Bryson has a particularly entertaining style that encourages audience participation, so be prepared to be a part of the presentation! He will teach participants about the IOT threat landscape (what have we seen) and common oversights made in the development, configuration, and deployment of IoT devices. And, while IOT may not be interesting itself as an end target (changing the temperature on a random Nest thermostat isn’t going to get a hacker out of bed), it’s easy to build an automated campaign at scale which can access operational systems and sensitive data, ie - steal interesting things! He will demonstrate this with a walkthrough hack and provide an open-sourced lab that participants can replicate on their own.",
      "link": "",
      "includes": "",
      "id": 43159,
      "speakers": [
        43185
      ],
      "start_date": "2019-10-27T16:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42027,
      "title": "No IOUs with IOT"
    },
    {
      "end_date": "2019-10-27T17:20+0000",
      "updated_at": "2019-10-21T02:20+0000",
      "description": "IoT is an ever-expanding attack surface about which we have many misconceptions and assumptions but for which we have very few policies, regulations or security. These are devices built for one purpose, not meant to be upgraded and rarely if ever patched. As more devices are enabled to connect and communicate online, in the relentless pursuit of innovation, we’ve put the cart before the horse and failed to construct a framework to effectively control and secure the capability created.\r\n\r\nConsider this: over 90% of the data in the world was created over the past two years, and current output is roughly 2.5 quintillion bytes per day. As IoT moves into a range of enterprise environments, driven by consumer demand and BYOD desire, Shadow IT becomes Shadow ET, bringing new challenges and risks that our existing compliance and security don’t address or regulate.\r\n\r\nMisconfiguration usurps any benefits of eroding segregation as online exposure of both sensitive data and critical systems increases. Adversaries at all levels have been watching, waiting and are making their moves because ignorance isn’t an excuse – it’s an invitation to exploitation.",
      "link": "",
      "includes": "",
      "id": 43160,
      "speakers": [
        43186
      ],
      "start_date": "2019-10-27T16:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42028,
      "title": "Mind the Gap - Managing Insecurity in Enterprise IoT"
    },
    {
      "end_date": "2019-10-27T20:00+0000",
      "updated_at": "2019-10-21T02:21+0000",
      "description": "Getting started in hacking seems like a big task; Where to start? What should I start learning? How can I practice? BiaSciLab answers all these questions and gets you started on your hacking career! This three hour, intense, hands on (bring a laptop!) hacking class will get you started with web application hacking. You will learn: Setting up a virtual lab, SQL Injection, Cross Site Scripting and more! These hacking skills can be applied in real life. CTFs? Using just these two attacks is how BiaSciLab got into the top 20 in an adult CTF. Want to jump into the online cyber ranges like HackTheBox? There is an entire section of web applications to hack! Bug Bounty? One of her friends found a XSS bug on a website and got paid! If you are looking to get started in hacking, this is the class to take!\r\n\r\nWhile this class is open to all, parents should ask themselves if their young hacker will understand the content and learn something, or just become bored and distracted. Please use your best judgement so as not to distract the instructor and other students.\r\n\r\nStudents requirements:\r\n* Laptop with at least 4 cores\r\n* 4 GB ram or greater\r\n* Windows, Linux or Mac operating system\r\n* Admin privileges\r\n\r\nTo speed up the class, please install VirtualBox for your operating system. Also download and save Ubuntu 18.04 server to your downloads folder. This will greatly speed up the class. The wifi at the conference will be saturated and very slow!\r\n\r\nhttps://ubuntu.com/download/server\r\nhttps://www.virtualbox.org/",
      "link": "",
      "includes": "",
      "id": 43161,
      "speakers": [
        43171
      ],
      "start_date": "2019-10-27T17:00+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42015,
      "location": 42025,
      "title": "Building a Home Lab and Introduction to Web Application Hacking"
    },
    {
      "end_date": "2019-10-27T18:20+0000",
      "updated_at": "2019-10-21T02:21+0000",
      "description": "The SIEM, everyone has one, but does anyone really know how to get to most from them? There are many SIEMs out there and they can be used for many different purposes but at the core it’s likely the most high maintenance security tool you have in your environment However, .with a little TLC you would be amazed the value you can get as long as long as you know what you are after.\r\n\r\nCome join these speakers as they talk about common use cases, tips, tricks, and ways to get the most out of your SIEM including maintenance and tuning, what you should be ingesting, and common practices to better your visibility and posture.",
      "link": "",
      "includes": "",
      "id": 43162,
      "speakers": [
        43182,
        43187
      ],
      "start_date": "2019-10-27T17:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42026,
      "title": "What did the SIEM See?"
    },
    {
      "end_date": "2019-10-27T18:20+0000",
      "updated_at": "2019-10-21T02:22+0000",
      "description": "Organizations are expanding the use of automation and orchestration in their security operations. An indication of this is the sharp rise in the adoption of Security Orchestration Automation and Response platforms. The security of these platforms is a key concern, and in particular the security of API keys used by both the SOAR platform and Security Operations Center personnel. The exposure of APIs from security tools is crucial to permitting automation and orchestration, however it is also important to secure the usage of these capabilities. This presentation highlights methods for securing API usage and ways to remediate compromised API keys.",
      "link": "",
      "includes": "",
      "id": 43163,
      "speakers": [
        43188
      ],
      "start_date": "2019-10-27T17:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42027,
      "title": "Insights for secure API usage in conjunction with security automation and orchestration"
    },
    {
      "end_date": "2019-10-27T18:20+0000",
      "updated_at": "2019-10-21T02:22+0000",
      "description": "Identity and Access Management (IAM) can be used to design and implement defensive policies and mechanisms to harden the security of the enterprise. As a byproduct, it can also model risk from privileged or sensitive accounts or applications. This talk will describe some of the issues and solutions found during various implementations.",
      "link": "",
      "includes": "",
      "id": 43164,
      "speakers": [
        43189
      ],
      "start_date": "2019-10-27T17:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42028,
      "title": "IAM what IAM and dats what IAM: accounts for everyone! Robots too!"
    },
    {
      "end_date": "2019-10-27T19:20+0000",
      "updated_at": "2019-10-21T02:22+0000",
      "description": "Genealogy is a search through your family history. As you progress through your research you can fall down into rabbit holes and uncover family secrets long since forgotten or hidden. This, amazingly, is not all that different from threat intel research. We will step through the process of finding a Revolutionary War ancestor and compare how it relates to finding an unknown threat actor.",
      "link": "",
      "includes": "",
      "id": 43165,
      "speakers": [
        43190
      ],
      "start_date": "2019-10-27T18:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42026,
      "title": "Looking to the Past to Better Understand Threat Intelligence"
    },
    {
      "end_date": "2019-10-27T19:20+0000",
      "updated_at": "2019-10-21T02:22+0000",
      "description": "When writing malware, oftentimes we need a bit more flexibility (i.e. sneakiness) than the victim's \"normal\" network stack provides us. Enter libpcap. Aside from powering tcpdump, it enables us to send and receive all sorts of strange (and hopefully invisible) network traffic we can use on the offensive side of things.\r\n\r\nIn this talk we'll first take a broad look at what libpcap is and what it can do for us, then we'll explore how to use it to do devious things like circumvent host-based firewalls, grab interesting info off the wire, ask system processes call us back with shells, and keep pesky EDR connections from happening. Source code for all of the techniques discussed in the talk will be made available.",
      "link": "",
      "includes": "",
      "id": 43166,
      "speakers": [
        43159
      ],
      "start_date": "2019-10-27T18:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42027,
      "title": "Offensive PCAP"
    },
    {
      "end_date": "2019-10-27T19:20+0000",
      "updated_at": "2019-10-21T02:22+0000",
      "description": "Every day we give more and more of ourselves to big companies like Google, Facebook, Apple, Amazon, Samsung and many others. Every day more and more IoT devices enter our homes with cameras and microphones. And every day it is made easier for us to spy on one another with under the guise of “parental controls.” Can any of us reclaim our privacy? Yes, but it will not be handed back; it is something that we have to take. Use Tor, Use Signal is no longer enough and by implementing some of these tools and techniques in your daily life; you too can take back your privacy.",
      "link": "",
      "includes": "",
      "id": 43167,
      "speakers": [
        43191
      ],
      "start_date": "2019-10-27T18:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42028,
      "title": "What We Do In The Shadows: \"Going Dark\" With Consumer Electronics"
    },
    {
      "end_date": "2019-10-27T20:20+0000",
      "updated_at": "2019-10-21T02:23+0000",
      "description": "The recent rapid growth of artificial intelligence (AI), and especially machine learning (ML), entices many cybersecurity professionals into believing these popular techniques are a silver bullet solution to our biggest cybersecurity challenges. Unfortunately, many cyber efforts focus more on using data-driven ML without a clear strategy to carefully measure results derived from the models. Furthermore, AI is an area of advanced computer science that requires experienced analysis, careful data preparation, and measured expectations of model performance and risks. However, it is oftentimes used as a synonym for automation.\r\n\r\nDeloitte has performed enterprise-scale cyber analytics at the performance level of 1M events per second / 300B events per month for the last several years. In performing these analyses, Deloitte developed several advanced cyber analytic workflows that utilize ML, contextual enrichment, and data science to support mission-centric cyber hunt operations. Experience has shown analytical workflows are more impactful and relevant when they are defined not by the models used, but by the mission-oriented results they produce.\r\n\r\nIn this talk, we describe a results-driven perspective of AI and ML applicable to real-world challenges in cyber analytics with a particular focus on detection of malicious actors and behaviors as well as advanced network understanding. We will discuss how analytical workflows utilize AI models and other techniques to define normal and anomalous behaviors; manage the base rate fallacy; integrate cyber-domain knowledge into data-driven models to provide context and explainability; and provide advanced decision-support to human cyber operators and threat hunters.\r\n\r\nWe will conclude our talk with stories of where AI has effectively supported cybersecurity analysis, where AI has failed in cybersecurity and analytic applications, and recommendations for moving beyond current data-driven AI models focused on classification and toward results-driven AI approaches which are robust to contextualization, uncertainty, and ambiguity in the cyber security domain.",
      "link": "",
      "includes": "",
      "id": 43168,
      "speakers": [
        43192,
        43193
      ],
      "start_date": "2019-10-27T19:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42026,
      "title": "Make Results, Not Models: Applying AI to Cybersecurity in an Intelligent Way"
    },
    {
      "end_date": "2019-10-27T20:20+0000",
      "updated_at": "2019-10-21T02:23+0000",
      "description": "Applications on macOS use a common and flawed method of loading dynamic libraries (dylib), which leaves them vulnerable to a post-exploitation technique known as dylib hijacking. Dylib hijacking is a technique used to exploit this flawed loading method in order to achieve privilege escalation, persistence, or the ability to run arbitrary code. This talk provides an overview of the attack vector and the process involved in exploiting vulnerable applications. Additionally, the process of automating the exploitation of vulnerable applications will be demonstrated and discussed in depth. The tools developed and used for this demonstration will be made publicly available.",
      "link": "",
      "includes": "",
      "id": 43169,
      "speakers": [
        43177
      ],
      "start_date": "2019-10-27T19:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42027,
      "title": "Automated Dylib Hijacking"
    },
    {
      "end_date": "2019-10-27T20:20+0000",
      "updated_at": "2019-10-21T02:23+0000",
      "description": "Take expert control of your cyber security career and embark on the road to success with methods to evaluate, refine, and improve your job search strategy. Though job search challenges are not unusual, they can be overcome with the right tools. Gain valuable insights into developing the right career search products, understanding the different types of recruiters, and utilizing the right avenues for self-promotion and networking. We’ll leverage the findings from two recent industry surveys, which examine the challenges of job search and the impact of volunteering in your professional community. With these resources in hand, you can maximize your job search efforts, turning them into successes.",
      "link": "",
      "includes": "",
      "id": 43170,
      "speakers": [
        43180
      ],
      "start_date": "2019-10-27T19:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42016,
      "location": 42028,
      "title": "Breaking Through the Boundaries of Cyber Security Job Search Challenges"
    },
    {
      "end_date": "2019-10-27T21:00+0000",
      "updated_at": "2019-10-21T02:00+0000",
      "description": "",
      "link": "",
      "includes": "",
      "id": 43171,
      "speakers": [],
      "start_date": "2019-10-27T20:30+0000",
      "conference": "BSIDESDC2019",
      "event_type": 42013,
      "location": 42029,
      "title": "Closing Ceremonies"
    }
  ]
}