{
  "updated_at": "2019-08-08T20:44+0000",
  "schedule": [
    {
      "id": 41075,
      "title": "Queercon Badge Welcome Reception",
      "description": "Queercon welcomes our sponsors, partners, speakers, crew, and badge pre-order code holders to a welcome reception. Grab your QR code, head over to badge | info | swag to pick up your badge, and join the party in the Queercon mingle room.",
      "updated_at": "2019-08-08T20:26+0000",
      "start_date": "2019-08-08T03:00+0000",
      "link": "",
      "event_type": 40013,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-08T06:59+0000",
      "location": 40109
    },
    {
      "id": 41076,
      "title": "Queercon 16 Opening Ceremony",
      "description": "Welcome to Queercon 16. Whether this is your first year or your tenth, come learn about everything that we have in store for this year, so you don’t miss out on any of the fun.\r\n",
      "updated_at": "2019-08-08T20:27+0000",
      "start_date": "2019-08-08T18:00+0000",
      "link": "",
      "event_type": 40012,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-08T19:00+0000",
      "location": 40111
    },
    {
      "id": 41077,
      "title": "Security and Privacy of Dating Apps",
      "description": "In 2015, research found that Grindr could be used to precisely locate its users. Years later, many dating apps, including Grindr, are still leaking the precise locations of their users, leading to privacy and safety concerns of those users. This talk presents a novel tool that integrates several apps into one mapping interface, to illustrate how dangerous information leakage could be, how previous remediations to this problem fall short, and proposes solutions the industry could adopt.\r\n",
      "updated_at": "2019-08-08T20:27+0000",
      "start_date": "2019-08-08T19:00+0000",
      "link": "",
      "event_type": 40012,
      "includes": "",
      "speakers": [
        41075,
        41076
      ],
      "conference": "QC16",
      "end_date": "2019-08-08T20:00+0000",
      "location": 40111
    },
    {
      "id": 41078,
      "title": "One Year of Effecting Change from the Inside",
      "description": "In today's world of divisiveness, open bigotry, and hate rhetoric, it is easy to stand back and shout at the world that “this is wrong.” I came to the realization that I was the only one listening, and this accomplished nothing. I decided to step out of my comfort zone, and see what I could do to affect real change. When I embarked on my plan to make the changes I wanted to see, I had no idea how emotional the journey would be - or how many people that I worked with would come to mean so much to me personally.\r\n",
      "updated_at": "2019-08-08T20:28+0000",
      "start_date": "2019-08-08T20:00+0000",
      "link": "",
      "event_type": 40012,
      "includes": "",
      "speakers": [
        41074
      ],
      "conference": "QC16",
      "end_date": "2019-08-08T21:00+0000",
      "location": 40111
    },
    {
      "id": 41079,
      "title": "Transgender Meetup",
      "description": "Queercon is a large and diverse community and we embrace you for being you. Join us for the annual transgender meetup. This is a safe and accepting place to socialize and swap stories.\r\n",
      "updated_at": "2019-08-08T20:28+0000",
      "start_date": "2019-08-08T21:00+0000",
      "link": "",
      "event_type": 40013,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-08T22:00+0000",
      "location": 40109
    },
    {
      "id": 41080,
      "title": "How to Fix the Diversity Gap in Cybersecurity",
      "description": "Women make up just 11 percent, and minorities less than 12 percent, of the cybersecurity workforce. Just 4% of hackers are women. Many underrepresented persons are leaving InfoSec after years in the field, and it’s clear we must do more for the future. In this talk, I will discuss our brains and how we label, prejudge, and hear the experiences of underrepresented people. Next, I’ll share some ideas for what can be done to fill the gap, and how we can change the stats together to make a stronger, more inclusive community.\r\n",
      "updated_at": "2019-08-08T20:29+0000",
      "start_date": "2019-08-08T22:00+0000",
      "link": "",
      "event_type": 40012,
      "includes": "",
      "speakers": [
        41073
      ],
      "conference": "QC16",
      "end_date": "2019-08-08T23:00+0000",
      "location": 40111
    },
    {
      "id": 41081,
      "title": "Queercon Mixer",
      "description": "Join us and 300 of your closest friends and strangers for the first Queercon 16 Mixer. Come find old friends, and make some new ones in our mingle space.\r\n\r\nSponsored by: Droplit.io",
      "updated_at": "2019-08-08T20:30+0000",
      "start_date": "2019-08-08T23:00+0000",
      "link": "",
      "event_type": 40013,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-09T01:00+0000",
      "location": 40109
    },
    {
      "id": 41082,
      "title": "Queercon Kickoff Party (18+)",
      "description": "Get ready, get set, GO! Queercon 15’s official kickoff party. Join us for an amazing evening to start the con off right!",
      "updated_at": "2019-08-08T20:30+0000",
      "start_date": "2019-08-09T03:00+0000",
      "link": "",
      "event_type": 40013,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-08T09:00+0000",
      "location": 40109
    },
    {
      "id": 41083,
      "title": "Creating Trans-Inclusive Workspaces: Healthcare & Policies",
      "description": "I'll discuss creating Trans-Inclusive workplaces, including various policies, metrics, and details on common healthcare challenges for Trans employees, and strategies to fix employer health plans to make them Trans-Inclusive.\r\n",
      "updated_at": "2019-08-08T20:31+0000",
      "start_date": "2019-08-09T17:00+0000",
      "link": "",
      "event_type": 40012,
      "includes": "",
      "speakers": [
        41072
      ],
      "conference": "QC16",
      "end_date": "2019-08-09T18:00+0000",
      "location": 40111
    },
    {
      "id": 41084,
      "title": "Selling Businesses as a Transgendered Woman",
      "description": "I will present on my success as a Transgendered CEO, having started and sold two prior companies and built an MSSP that extends from the US to Mexico, and from Germany to the U.K. I will talk about my challenges as a Trans-CEO, and my life as I moved from hacker to CEO to venture capitalist to full-time published author/writer.",
      "updated_at": "2019-08-08T20:31+0000",
      "start_date": "2019-08-09T18:00+0000",
      "link": "",
      "event_type": 40012,
      "includes": "",
      "speakers": [
        41071
      ],
      "conference": "QC16",
      "end_date": "2019-08-09T19:00+0000",
      "location": 40111
    },
    {
      "id": 41085,
      "title": "Queercon 16 Badge Talk",
      "description": "Once again the unicorns and rainbows aligned, and Queercon produced yet another amazing electronic badge. Come meet the outstanding design team that pulled together this year’s badge. Maybe score one for yourself! Also, learn how to secure a Queercon 17 badge for next year.",
      "updated_at": "2019-08-08T20:31+0000",
      "start_date": "2019-08-09T19:00+0000",
      "link": "",
      "event_type": 40012,
      "includes": "",
      "speakers": [
        41077,
        41078,
        41079
      ],
      "conference": "QC16",
      "end_date": "2019-08-09T20:30+0000",
      "location": 40111
    },
    {
      "id": 41086,
      "title": "Changing Pathways: Building More Equitable Societies Through Solidarity and Dialogue",
      "description": "This talk will focus on brief insights framed by my own personal journey into tech via near-deadly encounters as a sex worker, and will highlight the importance of taking charge in building a community within which binary and non-binary trans folk are not only accepted, but held in high regard. This includes taking care of ourselves as trans and gender-fluid individuals, but also in sharing our stories and passions with the greater InfoSec world. I’ll cover approaches to speaking with conference audiences, effective ways of holding fellow community members accountable, along with the necessity for intersectional equality and justice between race, gender, and other identifiers. I will also discuss strategies for introducing trans people to cyber, and how to support them once they’ve arrived. Unity and solidarity should be our collective goal because if we don’t maintain the work done to create a welcoming community within cybersecurity, we may lose what little shelter we have left.\r\n",
      "updated_at": "2019-08-08T20:32+0000",
      "start_date": "2019-08-09T21:00+0000",
      "link": "",
      "event_type": 40012,
      "includes": "",
      "speakers": [
        41070
      ],
      "conference": "QC16",
      "end_date": "2019-08-09T22:00+0000",
      "location": 40111
    },
    {
      "id": 41087,
      "title": "Women of Queercon",
      "description": "Whether trans, lesbian, bi, queer, or ally - all women are important and welcomed at Queercon. Join us for the Women of Queercon meetup.",
      "updated_at": "2019-08-08T20:32+0000",
      "start_date": "2019-08-09T22:00+0000",
      "link": "",
      "event_type": 40013,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-09T23:00+0000",
      "location": 40109
    },
    {
      "id": 41088,
      "title": "Queercon Mixer",
      "description": "Bring your QC 10 - QC 15 badges as your plus-one (or plus-five!)! Friday’s mixer will also be home to our first ever Retro Badge Meetup! Bring all your “old friends” and make some new ones in our mingle space.\r\n\r\nSponsored by: Dropbox",
      "updated_at": "2019-08-08T20:33+0000",
      "start_date": "2019-08-09T23:00+0000",
      "link": "",
      "event_type": 40013,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-10T01:00+0000",
      "location": 40109
    },
    {
      "id": 41089,
      "title": "Queercon Pool Party (21+)",
      "description": "No badge required. Break out your speedo and get your unicorns ready. Come join us for our epic pool party at the Alexis Park. Once again the amazing Queercon DJ’s will be keeping us going as we celebrate in the way that Queercon knows best: a massive pool party. 21+ and ID is required. No outside food, beverages, or medications (or “medications”), usual poolside rules apply. Featuring: Shahbbles, Skittish & Bus, and Bret Law\r\n\r\nSponsored by: Bugcrowd",
      "updated_at": "2019-08-08T20:33+0000",
      "start_date": "2019-08-10T03:00+0000",
      "link": "",
      "event_type": 40013,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-09T09:00+0000",
      "location": 40108
    },
    {
      "id": 41090,
      "title": "DECEPTICONv2: OSINT Adviceto Derail the Haters & Stalkers",
      "description": "When we think of the process for attacking an organization, OSINT is often front and center in our minds. This presentation focuses on applying OSINT to effective penetration testing and social engineering, and reverse engineers the process to determine what steps can be taken to further complicate their efforts. This talk will cover online deception, decoy accounts, canary data, encryption, maintaining one’s social media in a secure manner, and protecting one’s identity as much as possible, to make it harder for attackers to collect accurate OSINT, either by removal or deception.\r\n",
      "updated_at": "2019-08-08T20:44+0000",
      "start_date": "2019-08-09T22:00+0000",
      "link": "",
      "event_type": 40012,
      "includes": "",
      "speakers": [
        41069
      ],
      "conference": "QC16",
      "end_date": "2019-08-09T23:00+0000",
      "location": 40111
    },
    {
      "id": 41091,
      "title": "Mile-wide Gaps in AI Security Engineering: The coming reckoning, and what to do about it",
      "description": "Artificial Intelligence and Machine Learning are just starting to deal with 1990’s-era security issues we consider basic today, and these technologies introduce new pivots to those security threats that can have far greater impact than traditional software vulnerabilities. These threats range from the mundane – bot trolling and poisoning a competitor’s models – to the extreme – hiding terrorist content online and forcing self-driving cars to ignore stop signs. Future success in AI and ML depends on our ability to meet these challenges as an industry. This session will help you understand specific AI/ML security challenges and mitigations, with no expertise required. We’ll begin with a quick introduction to the key concepts of Artificial Intelligence, then using real-life examples and demos explain these new security risks and the next steps required to defend against them. In closing we will discuss how Microsoft is leveraging its experience with Tay, Zo, and the Security Development Lifecycle to address these issues through new engineering investments, security guidance/automation, and customer engagement.\r\n",
      "updated_at": "2019-08-08T20:34+0000",
      "start_date": "2019-08-10T20:00+0000",
      "link": "",
      "event_type": 40012,
      "includes": "",
      "speakers": [
        41068
      ],
      "conference": "QC16",
      "end_date": "2019-08-10T21:00+0000",
      "location": 40111
    },
    {
      "id": 41092,
      "title": "Bears of Queercon Meetup",
      "description": "They’re furry, they’re friendly, and they give the best hugs! Come hang out with the bear crew within Queercon. Don’t worry, these bears aren’t dangerous and won’t bite - without permission first.",
      "updated_at": "2019-08-08T20:35+0000",
      "start_date": "2019-08-10T21:00+0000",
      "link": "",
      "event_type": 40013,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-10T22:00+0000",
      "location": 40109
    },
    {
      "id": 41093,
      "title": "Queercon Locals Meetup",
      "description": "Ever since Queercon launched our QC Locals groups in 2017, our Locals have been meeting-up all around the country. Have you attended a local meetup, yet? Come meet up with all of the other QC Local groups. Looking to start a QC Local chapter in your area? Come get all the info on how to grow Queercon into your area.",
      "updated_at": "2019-08-08T20:35+0000",
      "start_date": "2019-08-10T22:00+0000",
      "link": "",
      "event_type": 40013,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-10T23:00+0000",
      "location": 40109
    },
    {
      "id": 41094,
      "title": "Queercon Mixer",
      "description": "Swing over to the mingle space for the afternoon Queercon Mixer. Catch up with friends, grab a drink from the bar and meet new people. Also, a great chance to find a date for the Rainbow Disco!\r\n\r\nSponsored by: Dropbox",
      "updated_at": "2019-08-08T20:36+0000",
      "start_date": "2019-08-10T23:00+0000",
      "link": "",
      "event_type": 40013,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-11T01:00+0000",
      "location": 40109
    },
    {
      "id": 41095,
      "title": "Queercon Rainbow Disco (18+)",
      "description": "Get your groove on as Queercon transforms the mingle space into a huge dance party that goes all night long.",
      "updated_at": "2019-08-08T20:36+0000",
      "start_date": "2019-08-11T03:00+0000",
      "link": "",
      "event_type": 40013,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-10T09:00+0000",
      "location": 40109
    },
    {
      "id": 41096,
      "title": "Queercon Karaoke (18+)",
      "description": "Want to take a break from the Rainbow Disco? Feel like stretching those vocal cords? Stop into the Pegasus Showroom, just off the Alexis Park lobby for a little Queer-e-oke!",
      "updated_at": "2019-08-08T20:36+0000",
      "start_date": "2019-08-11T03:00+0000",
      "link": "",
      "event_type": 40013,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-10T09:00+0000",
      "location": 40110
    },
    {
      "id": 41097,
      "title": "Queercon Mimosa Bar",
      "description": "It may be the final day, but the fun is not over just yet. Wake up and nurse yourself back to life with a mimosa!",
      "updated_at": "2019-08-08T20:37+0000",
      "start_date": "2019-08-11T17:00+0000",
      "link": "",
      "event_type": 40013,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-11T19:00+0000",
      "location": 40107
    },
    {
      "id": 41098,
      "title": "Queercon 17 Booking",
      "description": "Did you have a great time? Planning on coming back for the 17th Queercon? We have a lot of great things planned, so why not pre-book your room with Queercon for next year? Lock in discounted prices with a $100 deposit.",
      "updated_at": "2019-08-08T20:37+0000",
      "start_date": "2019-08-11T18:00+0000",
      "link": "",
      "event_type": 40012,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-11T20:00+0000",
      "location": 40106
    },
    {
      "id": 41099,
      "title": "Getting Involved with Queercon",
      "description": "Do you want to get more involved with Queercon? Have skills that could help us grow? Come by and learn how to get involved after Vegas ends.",
      "updated_at": "2019-08-08T20:37+0000",
      "start_date": "2019-08-11T19:00+0000",
      "link": "",
      "event_type": 40012,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-11T20:00+0000",
      "location": 40111
    },
    {
      "id": 41100,
      "title": "Queercon 16 Closing Ceremony",
      "description": "That’s a wrap! As we close out Queercon 16, join us before the farewell mixer to find out all of the behind the scenes details that made Queercon so great this year, and find out what we have planned for Queercon 17.",
      "updated_at": "2019-08-08T20:38+0000",
      "start_date": "2019-08-11T20:00+0000",
      "link": "",
      "event_type": 40012,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-11T21:00+0000",
      "location": 40111
    },
    {
      "id": 41102,
      "title": "Queercon Mixer",
      "description": "Join us one last time in our more intimate chill space for the final Queercon Mixer of the year (a little earlier than usual). Catch up with all your new friends and be sure to connect on social media before the end of the con.",
      "updated_at": "2019-08-08T20:39+0000",
      "start_date": "2019-08-11T21:00+0000",
      "link": "",
      "event_type": 40013,
      "includes": "",
      "speakers": [],
      "conference": "QC16",
      "end_date": "2019-08-11T23:00+0000",
      "location": 40107
    }
  ]
}