{
  "speakers": [
    {
      "link": "",
      "id": 41068,
      "title": "",
      "name": "Raul Rojas",
      "twitter": "",
      "description": "",
      "conference": "QC16",
      "updated_at": "2019-08-08T20:22+0000"
    },
    {
      "link": "",
      "id": 41069,
      "title": "",
      "name": "Joe Gray",
      "twitter": "",
      "description": "Joined the U.S. Navy directly out of High School and served for 7 years as a Submarine Navigation Electronics Technician. Joe is the inaugural winner of the DerbyCon Social Engineering Capture the Flag (SECTF) and was awarded a DerbyCon Black Badge. Joe has contributed material for the likes of AlienVault, ITSP Magazine, CSO Online, and Dark Reading. Joe is a regular contributor for Forbes and is an IBM Recognized Speaker/Presenter.",
      "conference": "QC16",
      "updated_at": "2019-08-08T20:41+0000"
    },
    {
      "link": "",
      "id": 41070,
      "title": "",
      "name": "Maxine Filcher",
      "twitter": "",
      "description": "Is a US Army Veteran, who currently attends the University of Washington – Tacoma as a senior while pursuing a degree in I.T. Information Assurance and Cybersecurity. She works in Avanade’s SOC as a Security Analyst in Seattle. She has also served as a teaching assistant for the UWT CPES program, which builds and delivers cybersecurity focused curricula for K-12 students, where she focused on wireless security and RF concepts. Maxine was selected for the SANS Women’s Immersion Academy 2018 Cohort and, at the time of this writing, currently holds the GSEC and GCIH GIAC certifications.",
      "conference": "QC16",
      "updated_at": "2019-08-08T20:40+0000"
    },
    {
      "link": "",
      "id": 41071,
      "title": "",
      "name": "Alissa Knight",
      "twitter": "",
      "description": "Is a recovering hacker of 20 years, specializing in penetration testing of connected cars. She has started and sold two prior companies as a successful serial entrepreneur, is a published author, venture capitalist, and is now a full-time industry analyst and writer. Alissa has spoken at over 2 dozen security conferences across the US, Europe, Asia, and the Middle East on hacking connected cars.",
      "conference": "QC16",
      "updated_at": "2019-08-08T20:41+0000"
    },
    {
      "link": "",
      "id": 41072,
      "title": "",
      "name": "Marie Fromm",
      "twitter": "",
      "description": "Is currently the Chair of Medtronic’s LGBT Employee Resource Group Steering Committee where she has focused on LGBTQ equity in policies and benefits since 2010. She served as co-chair & organizer of the last Minnesota Transgender Health Conference which brought together 300 Trans people, Allies and Healthcare providers for two days of sessions focused on Trans health. Marie is a #RealLiveTransAdult, and has been out as #Trans and the #Bi for more than a decade.",
      "conference": "QC16",
      "updated_at": "2019-08-08T20:41+0000"
    },
    {
      "link": "",
      "id": 41073,
      "title": "",
      "name": "Chloé Messdaghi",
      "twitter": "@ChloeMessdaghi",
      "description": "Is a Security Researcher Advocate @Bugcrowd, board member for 4 nonprofits, one of the Women in Security (WoSEC) founders & heads the SF Chapter, founder of WomenHackerz online community, mentors women to enter InfoSec and remain, aspeaker on diversity and inclusion, bug bounty, and safe harbor in InfoSec, a supporter of Disclose.io, and Drop Labels founder.",
      "conference": "QC16",
      "updated_at": "2019-08-08T20:43+0000"
    },
    {
      "link": "",
      "id": 41074,
      "title": "",
      "name": "Miki Demeter",
      "twitter": "",
      "description": "Is a writer and Public Speaker for technical subjects as well as Diversity & Inclusion and other social subjects. Her passion lies with advocating for underrepresented communities in Tech. Her career has encompassed everything from firmware to application space. Miki also has many outside interests including volunteering as a TrevorChat Crisis Counselor, Women Who Code PDX Evangelist, Women of Security PDX founder, Portland Women in Tech, and the Diana Initiative to help drive diversity and true inclusion while advocating for women in the STEM fields.",
      "conference": "QC16",
      "updated_at": "2019-08-08T20:40+0000"
    },
    {
      "link": "",
      "id": 41075,
      "title": "",
      "name": "Alex Lomas",
      "twitter": "",
      "description": "Worked for internet service providers and public-sector sector security blue teams before joining Pen Test Partners (PTP) in 2017. His background in designing and implementing secure networks and applications for hostile environments allows him to understand and communicate the inherent trade-offs between security and usability. At PTP, Alex has undertaken penetration testing of systems as diverse as banking and critical national infrastructure and bringing his skills as a qualified pilot and aeronautical engineer to the testing of the aviation sector.",
      "conference": "QC16",
      "updated_at": "2019-08-08T20:41+0000"
    },
    {
      "link": "",
      "id": 41076,
      "title": "",
      "name": "Alan Monie",
      "twitter": "",
      "description": "",
      "conference": "QC16",
      "updated_at": "2019-08-08T20:23+0000"
    },
    {
      "link": "https://blinkylights.ninja",
      "id": 41077,
      "title": "",
      "name": "Evan Mackay",
      "twitter": "@AkioOhtori",
      "description": "Co-founded the Queercon Badge team in 2012. He serves as the hardware and electrical design lead, creating schematics, PCB layout, and support boards. He is known in the badge community for careful and unconventional PCB traces. In the real world, he works as an electrical engineer for an oil field equipment company, specializing in controls and PCB design.",
      "conference": "QC16",
      "updated_at": "2019-08-08T20:42+0000"
    },
    {
      "link": "",
      "id": 41078,
      "title": "",
      "name": "George Louthan (@duplico)",
      "twitter": "",
      "description": "Has worked on Queercon’s electronic badge team since its inception, as the lead coder and supply chain person. Among indie badge makers, he’s especially known for a love of Texas Instruments parts. He's also hosting this year's Queercon karaoke party.",
      "conference": "QC16",
      "updated_at": "2019-08-08T20:42+0000"
    },
    {
      "link": "",
      "id": 41079,
      "title": "",
      "name": "Subterfuge",
      "twitter": "@sidechannel_org",
      "description": "Enjoys learning the finer details of classic cryptology, and as of late has become a bit of an oenophile. He also occasionally makes noise on drums, as part of a small band of fellow tech folk, that makes no headlines, but enjoys playing various B-rated venues in Seattle.",
      "conference": "QC16",
      "updated_at": "2019-08-08T20:43+0000"
    }
  ],
  "updated_at": "2019-08-08T20:43+0000"
}