{
  "speakers": [
    {
      "name": "Eva Galperin",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T15:58+0000",
      "twitter": "",
      "title": "",
      "id": 44100,
      "description": "Eva Galperin is EFF’s Director of Cybersecurity. Prior to 2007, when she came to work for EFF, Eva worked in security and IT in Silicon Valley and earned degrees in Political Science and International Relations from SFSU. Her work is primarily focused on providing privacy and security for vulnerable populations around the world. To that end, she has applied the combination of her political science and technical background to everything from organizing EFF’s Tor Relay Challenge, to writing privacy and security training materials (including Surveillance Self Defense and the Digital First Aid Kit), and publishing research on malware in Syria, Vietnam, Kazakhstan. When she is not collecting new and exotic malware, she practices aerial circus arts and learning new languages.",
      "link": ""
    },
    {
      "name": "Amber Case",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T15:59+0000",
      "twitter": "@caseorganic",
      "title": "",
      "id": 44101,
      "description": "Amber Case studies the interaction between humans and computers and how our relationship with information is changing the way cultures think, act, and understand their worlds.\r\n\r\nA TED speaker and author, Case enjoys meeting and interacting with interesting audiences all over the world. Her speeches range from the future of technology and humanity to telecom, location-based applications and anthropology. Case is currently a fellow at Harvard University’s Berkman Klein Center for Internet and Society and a visiting researcher at the MIT Center for Civic Media. She is the author of Calm Technology, Design for the Next Generation of Devices. and, she’s been featured among Fast Company’s Most Influential Women in Technology.\r\n\r\nCase lives in Somerville, Massachusetts and Portland, Oregon. She was previously the co-founder and former CEO of Geoloqi, a location-based software company acquired by Esri in 2012. You can follow her on Twitter @caseorganic and learn more at caseorganic.com.",
      "link": "https://caseorganic.com"
    },
    {
      "name": "Jarrod Overson",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T15:59+0000",
      "twitter": "",
      "title": "",
      "id": 44102,
      "description": "Jarrod is a Director of Engineering at Shape Security where he led the development of Shape’s Enterprise Defense. Jarrod is a frequent speaker on modern web threats and cybercrime and has been quoted by Forbes, the Wall Street Journal, CNET among others. He’s the co-author of O’Reilly’s Developing Web Components, creator of Plato, a static analysis tool for web applications, and frequently writes and records topics about reverse engineering and automation.",
      "link": ""
    },
    {
      "name": "Allison Marie Naaktgeboren",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T15:59+0000",
      "twitter": "",
      "title": "",
      "id": 44103,
      "description": "Allison: Allison Marie Naaktgeboren is a Senior Software Engineer, currently working on defending the web at Signal Sciences. She holds a Bachelor’s Degree in Computer Science from Carnegie Mellon University. She has written and regretted code at Mozilla, Amazon, Cisco, FactSet Research Systems, as well as the Biorobotics Laboratory of Carnegie Mellon’s Robotics Institute. She is a hobbyist security researcher. Allison leads classes on computer science, captains a local CTF team, and mentors disadvantaged high school students in robotics, software, and hardware hacking in the Portland area.",
      "link": ""
    },
    {
      "name": "MrDe4d",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:00+0000",
      "twitter": "",
      "title": "",
      "id": 44104,
      "description": "MrDe4d is the lead data recovery engineer and founder of Revenant Data Recovery. She is a hobbyist embedded systems security researcher currently focused on storage devices and data exfiltration. Most of her research is dedicated to the noble cause of breaking proprietary hardware. In early 2019 she began forming the idea for an open source data recovery suite and now dedicates just as much time to building as she does breaking. She has presented at HushCon, DEF CON, and Teardown as well as at hackerspaces around the USA. MrDe4d is passionate about learning, freedom of information, promoting self-advocacy and hacking the planet!",
      "link": ""
    },
    {
      "name": "Brian Myers",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:00+0000",
      "twitter": "@brimy",
      "title": "",
      "id": 44105,
      "description": "Brian Myers, @brimy, (PhD, CISSP) has been working in security for five years and in software development long enough for his resume to include Borland and Netscape. He’s written books and articles on Windows programming. In his current job as Director of Information Security at WebMD Health Services Brian guides multiple teams building a SaaS web application housing HIPAA-regulated data. He also serves on the CS/IS Industry Advisory Board at Western Oregon University.",
      "link": ""
    },
    {
      "name": "Ben Sadeghipour",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:00+0000",
      "twitter": "",
      "title": "",
      "id": 44106,
      "description": "Ben is the Head of Hacker Operations at HackerOne by day, and a hacker by night. He has helped identify and exploit over 600 security vulnerabilities across 100s of web and mobile applications for companies such as Yahoo, Airbnb, Snapchat, The US Department of Defense, Yelp, and more. He also invested time in the security community, by creating a community of 200+ active hackers who share ideas and their experiences. He has also held free workshops and trainings to teach others about security and web application hacking.",
      "link": ""
    },
    {
      "name": "Malcolm Heath",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:00+0000",
      "twitter": "",
      "title": "Senior Threat Research Evangelist with F5 Networks",
      "id": 44107,
      "description": "Malcolm is a Senior Threat Research Evangelist with F5 Networks.",
      "link": ""
    },
    {
      "name": "Franklin Harding",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:01+0000",
      "twitter": "",
      "title": "",
      "id": 44108,
      "description": "Software Engineer with a passion for building maintainable, performant, and secure web services with Go. Also hacking. See https://harding.coffee/",
      "link": "https://harding.coffee/"
    },
    {
      "name": "Morgan Miller",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:01+0000",
      "twitter": "",
      "title": "",
      "id": 44109,
      "description": "While studying cryptography in graduate school, I was amazed how most difficult most security tools were to use. Noticing the frequency of user-introduced security flaws, I became convinced that usability was the only way to advance cryptographic tools. I have been a practicing UX architect since 2011. I have had the joy of working with many smart people to help build systems that meet business goals (security, profit, etc) and support user needs.",
      "link": ""
    },
    {
      "name": "Nancy Eckert",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:01+0000",
      "twitter": "",
      "title": "",
      "id": 44110,
      "description": "Nancy Eckert, a hacker hailing from Seattle, Washington, has been playing games on the Internet since the early ’90s era of text-based MUDs. Now a champion strategist and community organizer in the world of competitive augmented reality gaming, Nancy leads hundreds of players in capture-the-flag style events across the world.\r\n\r\nShe picks locks and builds neural networks in her spare time.",
      "link": ""
    },
    {
      "name": "Dave Greer",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:01+0000",
      "twitter": "",
      "title": "",
      "id": 44111,
      "description": "Dave Greer is a security researcher for Blackberry Cylance after having a bit of a mis-spent youth writing questionable-but-fun things. He has a practical background building security tools and an interest in laughing at security vendors while they try to keep up with the endless torrent of human vulnerabilities.",
      "link": ""
    },
    {
      "name": "Alex Ivkin",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:02+0000",
      "twitter": "@alexivkinx",
      "title": "",
      "id": 44112,
      "description": "Alex Ivkin (@alexivkinx) is a director of solutions at Eclypsium, a Portland security company. Alex specializes in security solution architecture, advisory and implementation of firmware and application security, container orchestration and IAM. Alex presented at numerous security industry conferences, co-authored the ISACA CSX Professional certification and spent a lot of time climbing mountains.",
      "link": ""
    },
    {
      "name": "Olivia Stella",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:02+0000",
      "twitter": "",
      "title": "",
      "id": 44113,
      "description": "Olivia Stella is a senior security analyst for American Airlines. In her current role, she focuses on aviation security and vulnerability management including pen testing and coordinated disclosure. She has over ten years of experience in software development and information security. Previously, she worked at an in-flight entertainment company in product security supporting incident response, risk & compliance, and as the bug bounty lead. She holds a bachelor’s degree in computer science, masters in software engineering, CISSP & CISM. When she’s not wearing her security hat, she loves to curl and is an avid toastmaster. (That’s right, ice curling.)",
      "link": ""
    },
    {
      "name": "Aaron Parecki",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:02+0000",
      "twitter": "",
      "title": "Senior Security Architect at Okta",
      "id": 44114,
      "description": "Aaron Parecki is a Senior Security Architect at Okta, an editor of several specifications at IETF and W3C, and maintains oauth.net. Aaron has spoken at conferences around the world about OAuth, data ownership, and quantified self, and his work has been featured in Wired, Fast Company and more.",
      "link": ""
    },
    {
      "name": "John Andersen",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:03+0000",
      "twitter": "",
      "title": "",
      "id": 44115,
      "description": "Security research, embedded systems, machine learning, and data flow programming are his current interests. He’s on the Open Source Security team at Intel. He’s from Portland, went to PSU for computer engineering with a focus on embedded systems and did his honors college thesis on machine learning. He’s been working at Intel as an intern then an employee for the past 5 years.",
      "link": ""
    },
    {
      "name": "Randy Waterhouse",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:03+0000",
      "twitter": "",
      "title": "",
      "id": 44116,
      "description": "Randy_Waterhouse spends his days helping people understand the importance of Intelligence as a guiding principle for building out effective security processes and leveraging technologies responsibly to build their cyber defense centers and security operations practices. His alter ego, at one time developed a number of intelligence products and helped vendors bring these to market. These products have included threat and vulnerability management tools, IOC prediction algorithms, intelligence subscriptions, and strategic intelligence consulting. Randy_Waterhouse also appears at Defcon fairly regularly as a Goon, and every once in a while he can be found out in the desert on his Harley with a flamethrower, sometimes with just a flamethrower. He and his co-author’s book “Ransomware: Defending Against Digital Extortion” has been used by many IT professional to aid in their programmatic response to the rise Ransomware.",
      "link": ""
    },
    {
      "name": "Marcus Richerson",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:03+0000",
      "twitter": "",
      "title": "",
      "id": 44117,
      "description": "Marcus has been working in information security over 13 years. He actively host and participates in capture the flag hacking competitions and enjoys reverse engineering, exploit development, lock picking, SCADA security, digital forensics, embedded device hacking, web hacking and mobile application hacking.",
      "link": ""
    },
    {
      "name": "Tobin Shields",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:03+0000",
      "twitter": "",
      "title": "",
      "id": 44118,
      "description": "Tobin Shields is a full-time instructor at Mt. Hood Community College. There, he primarily teaches topics in IT and InfoSec as apart of their intensive, two-year CTE program. Tobin has two masters degrees, one in Education and the other in Cybersecurity and Information Assurance. He also holds his Security+, CEH, CHFI, and RHCSA certifications. Tobin has been working as an educator for the past five years, and has a passion for teaching STEM topics",
      "link": ""
    },
    {
      "name": "Robert Moore",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:04+0000",
      "twitter": "",
      "title": "",
      "id": 44119,
      "description": "Robert is a Senior Security Consultant for NCC Group originally out of Milton Keynes (UK), and now based out of Seattle (US). Having a previous academic background in intelligence-based national security, he has pursued foreign language, lived, and studied abroad in multiple countries before moving into the technical side of security.\r\n\r\nHis focus delves heavily into all aspects of Red Team/Full Spectrum Attack Simulation (FSAS), with a particular knack for physical and network security. As part of these engagements, he has taken part in security assessments for multiple Fortune 500 companies by simulating attacks in the guise of a real-world adversary and demonstrating how simple gaps in physical security can lead to full-scale company compromise.",
      "link": ""
    },
    {
      "name": "Matt Wood",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:04+0000",
      "twitter": "",
      "title": "",
      "id": 44120,
      "description": "Matt is a Principal Engineer in Intel’s System Software Products (SSP) division, focusing on open source security. Part of his day to day job involves helping project teams understand how to implement and use cryptography properly.",
      "link": ""
    },
    {
      "name": "Dean Pierce",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:04+0000",
      "twitter": "",
      "title": "",
      "id": 44121,
      "description": "Security researcher from Portland Oregon. Locally affiliated with PDX2600, RainSec, Sophsec, CtrlH, PDX Bitcoin, BSidesPDX. Hacks stuff @ ConsenSys Diligence",
      "link": ""
    },
    {
      "name": "Eric Goldstrom",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:04+0000",
      "twitter": "",
      "title": "Security Incident Response Manager at Cambia Health Solutions",
      "id": 44122,
      "description": "Eric Goldstrom is the Security Incident Response Manager at Cambia Health Solutions in Portland. In his role, he built a new program called Interactive Threat Defense which will be the subject of the presentation. Prior to the private sector, Eric worked in the DoD conducting both Computer Network Exploitation (CNE) and Computer Network Defense (CND) operations. He has a MS in Cyber Security and his certifications include CISSP, OSCP, and SANS certifications.",
      "link": ""
    },
    {
      "name": "Greg Stromire",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:05+0000",
      "twitter": "",
      "title": "",
      "id": 44123,
      "description": "Greg Stromire is an application security engineer for Gemini where he works to shift security as far left as possible. When he’s not developing features to enhance the security of Gemini’s main products, he’s performing security assessments, building developer tools, and creating secure coding curriculum.",
      "link": ""
    },
    {
      "name": "Brian Delgado",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:05+0000",
      "twitter": "",
      "title": "Security Researcher in Intel’s Platform Armoring and Resiliency team",
      "id": 44124,
      "description": "Brian Delgado is a Security Researcher in Intel’s Platform Armoring and Resiliency team (PAR) where he is currently focused on applying fuzzing on UEFI code to identify code security issues. He has worked extensively in firmware security including Intel’s SMI Transfer Monitor (STM) feature to help protect a hypervisor against malicious BIOS code. Brian is also a Ph.D. student at Portland State University where his research with the EPA-RIMM research group focuses on SMM-based continuous monitoring for rootkit detection. In his free time, Brian enjoys learning about photography.",
      "link": ""
    },
    {
      "name": "Tejaswini Vibhute",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:05+0000",
      "twitter": "",
      "title": "Security Researcher in Intel’s PAR team",
      "id": 44125,
      "description": "Tejaswini Vibhute is a Security Researcher in Intel’s PAR team. She develops security tools for automated firmware validation leveraging fuzzing and virtualization. She has worked extensively with System Management Mode (SMM) security at Intel. Prior to joining Intel she was a member of the EPA-RIMM research group at Portland State University, where she completed a masters thesis on utilizing Intel’s STM to enable firmware-assisted rootkit detection. As part of this work she published the first publicly available Xen patches to launch Intel’s STM. In her free time, she can be found taking care of her furry friends or traveling around the country.",
      "link": ""
    },
    {
      "name": "Kevin Froman",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:05+0000",
      "twitter": "",
      "title": "",
      "id": 44126,
      "description": "Kevin is a computer science college student with an interest in security and ethical technology. He has experience with web development and security, with a fondness for cryptography and decentralization.",
      "link": ""
    },
    {
      "name": "Wendy Knox Everette",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:06+0000",
      "twitter": "@wendyck",
      "title": "",
      "id": 44127,
      "description": "Wendy (@wendyck) is a software developer who burned out and went to law school, where she completed a concentration in National Security Law and interned with the FTC, FCC, and some other three letter agencies (no, not the fun ones). After law school she completed a fellowship in privacy and information security law at ZwillGen. She currently lives in Seattle, where she is a Senior Security Advisor at Leviathan Security Group.",
      "link": ""
    },
    {
      "name": "Krisztian Gado",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:06+0000",
      "twitter": "",
      "title": "",
      "id": 44128,
      "description": "Researcher at Lewis and Clark College",
      "link": ""
    },
    {
      "name": "Aaron Wangugi",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:06+0000",
      "twitter": "",
      "title": "Security Engineer at Snap",
      "id": 44129,
      "description": "Aaron is an Security Engineer at Snap. At Snap he builds tools to help to help developers write more secure code and conducts security reviews. When he is not working he is hacking around on random things or drawing.",
      "link": ""
    },
    {
      "name": "Veronica Hotton",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:07+0000",
      "twitter": "",
      "title": "",
      "id": 44130,
      "description": "Veronica Hotton (PhD, Curriculum Theory and Implementation, Philosophy of Education, Simon Fraser University, Canada) is an Instructor in the University Studies program at Portland State University teaching interdisciplinary general education courses. Veronica is a co-director of CyberPDX, a summer camp for broadening participation in cybersecurity. More information at https://veronicahotton.com/",
      "link": "https://veronicahotton.com"
    },
    {
      "name": "Ellie Harmon",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:07+0000",
      "twitter": "",
      "title": "",
      "id": 44131,
      "description": "Ellie Harmon (PhD, Information and Computer Science, University of California, Irvine) is a Senior Instructor in the Department of Computer Science at Portland State University teaching courses in introductory computer science, human-computer interaction, and computing & society. Ellie also teaches in the University Studies program. Ellie is a co-director of CyberPDX, a summer camp for broadening participation in cybersecurity. More information at https://web.cecs.pdx.edu/~harmon8",
      "link": "https://web.cecs.pdx.edu/~harmon8"
    },
    {
      "name": "Alexei Kojenov",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:07+0000",
      "twitter": "",
      "title": "",
      "id": 44132,
      "description": "Alexei began his career as a software developer. A decade later, he realized that breaking code was way more fun than writing code, and decided to switch direction. He is now a full-time application security professional, with several years of assisting various development teams in delivering secure code, as well as security consulting. He currently works as a senior product security engineer for Salesforce, and occasionally speaks at local security events and global conferences.",
      "link": ""
    },
    {
      "name": "Will Peteroy",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:07+0000",
      "twitter": "",
      "title": "",
      "id": 44133,
      "description": "William Peteroy is the Chef Technology Officer for Security at Gigamon where he leads security strategy and innovation efforts. William is also the founder and CEO of ICEBRG (acquired by Gigamon in 2018) and has previously held a number of business and technology leadership positions at Microsoft and in the US Department of Defense.",
      "link": ""
    },
    {
      "name": "Alex Sirr",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:07+0000",
      "twitter": "",
      "title": "",
      "id": 44135,
      "description": "",
      "link": ""
    },
    {
      "name": "Jared Folkins",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:08+0000",
      "twitter": "",
      "title": "",
      "id": 44136,
      "description": "After surviving the dot-com crash of the late 90s, Jared Folkins has gone on to have a long career in systems and programming. In 2013 he turned a hobby into a career and has never looked back. Known for having technical chops and a high emotional IQ, he enjoys working with those who prioritize goals and people first while placing egos last. He currently Red Teams for ThreatHound.com, Blue Teams for Bend La Pine Schools, and breaks down software while building up people at OpsecEdu.com. If you want his help or you just need a new InfoSec friend contact him at https://www.JaredFolkins.com.",
      "link": "https://www.JaredFolkins.com"
    },
    {
      "name": "David Quisenberry",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:46+0000",
      "twitter": "@quizsec",
      "title": "",
      "id": 44137,
      "description": "David Quisenberry (@quizsec) is a backend developer and security champion with Daylight Studio, a local Portland boutique web agency. He serves on the Portland OWASP board and does what he can to up the involvement of established and emerging software developers in security conversations.",
      "link": ""
    },
    {
      "name": "Aaron Esau",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:47+0000",
      "twitter": "@arinerron",
      "title": "",
      "id": 44138,
      "description": "Aaron Esau (@arinerron) is a 17 year old security researcher, CTF player, bug hunter, intern at Summit Security Group, a software developer, and a full-time high school student. Although most of his experience relating to security is with web and binary exploitation, he is interested in many aspects of security and privacy.",
      "link": ""
    },
    {
      "name": "Aaron Jobé",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:47+0000",
      "twitter": "@dirtyc0wsay",
      "title": "",
      "id": 44139,
      "description": "Aaron Jobé (@dirtyc0wsay) is a high school senior. His interest in computers led him to binary exploitation. He participates in CTFs and various other security challenges to further expand his skills. After high school, Aaron plans to pursue a career in cyber security.”",
      "link": ""
    },
    {
      "name": "Amiran Alavidze",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:48+0000",
      "twitter": "",
      "title": "",
      "id": 44140,
      "description": "Amiran has been in information security for over 15 years with roles ranging from system engineering and security operations to governance, risk and compliance. Amiran is advocating practical and business-focused approach to security. Security is not just a job, it’s a passion.",
      "link": ""
    },
    {
      "name": "Mark Baenziger",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:49+0000",
      "twitter": "",
      "title": "",
      "id": 44141,
      "description": "Mark Baenziger is a former pentester, security architect/engineer, and incident responder who currently leads a security team at a multinational corporation. Highlights of his career include doing a year-long pentest on a large aircraft and leading the tactics division at US Cyber Command.",
      "link": ""
    },
    {
      "name": "Travis Smith",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:50+0000",
      "twitter": "",
      "title": "Principal Security Researcher at Tripwire",
      "id": 44142,
      "description": "Travis Smith is a Principal Security researcher with Tripwire, focused on creating defensive solutions for enterprise businesses. His focus is on digital forensics and incident response, and has been heavily involved with the MITRE ATT&CK framework over the past few years. Travis’ research in the past has been presented at Black Hat, RSA, ATT&CKcon, SecTor, and various other conferences all over the world.",
      "link": ""
    },
    {
      "name": "Ken Westin",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:51+0000",
      "twitter": "",
      "title": "Director of Security Solutions at Elastic",
      "id": 44143,
      "description": "Ken Westin is Director of Security Solutions at Elastic, helping organizations aggregate, analyze and operationalize disparate security data sources to identify and mitigate threats in various forms. In his past he has helped solve crimes with data, tracking stolen devices, breaking up organized crime groups, recovered stolen vehicles, even solved a violent carjacking, leading to the prosecution of dozens of criminals. He has presented at DEF CON, Black Hat, RSA, multiple BSides and security conferences around the world.",
      "link": ""
    },
    {
      "name": "Joshua Pereyda",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:52+0000",
      "twitter": "",
      "title": "",
      "id": 44144,
      "description": "Joshua is a software engineer specializing in information and network security. He has worked in the critical infrastructure and cloud computing industries with employers heavily invested in software and hardware security. Among his passions are hacking, teaching kids to program, attending orchestral concerts with his wife, and figuring out how he can get paid to do it all… legally.\r\n\r\nJoshua is the maintainer of the boofuzz network protocol fuzzing framework.",
      "link": ""
    },
    {
      "name": "Brent Holtsclaw",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:53+0000",
      "twitter": "",
      "title": "",
      "id": 44145,
      "description": "Brent Holtsclaw is a Security Researcher at Intel. Brent has performed security analysis for a wide variety of targets from embedded systems to enterprise networks, developing repeatable methods for improving assurance. Brent a contributor and one of the maintainers of the CHIPSEC open source project.",
      "link": ""
    },
    {
      "name": "Nick Armour",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:53+0000",
      "twitter": "",
      "title": "",
      "id": 44146,
      "description": "Nick Armour is a Security Researcher at Intel. Nick is a recent college graduate from Sonoma State University.",
      "link": ""
    },
    {
      "name": "Stephano Cetola",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:53+0000",
      "twitter": "",
      "title": "",
      "id": 44147,
      "description": "Stephano Cetola is an Open Source Program Manager at Intel contributing to TianoCore and CHIPSEC. His main focus is on community engagement and improving the developer experience. In his free time he enjoys exploring the thermal tolerances of various electronic circuits.",
      "link": ""
    },
    {
      "name": "Erik Bjorge",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:54+0000",
      "twitter": "",
      "title": "",
      "id": 44148,
      "description": "Erik Bjorge is a Firmware Engineer working at Intel Corporation since 2000. As part of his time at Intel he has had the opportunity to work on a number of firmware code bases including legacy BIOS, coreboot and UEFI. Erik is also a contributor to the CHIPSEC open source project",
      "link": ""
    },
    {
      "name": "Kate Temkin",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:54+0000",
      "twitter": "",
      "title": "",
      "id": 44149,
      "description": "Kate Temkin leads the software development team at Great Scott Gadgets. Kate is a seasoned USB researcher, and maintains a variety of open-source hardware and software tools, including FaceDancer and GreatFET, and has discovered a number of well-known USB vulnerabilities– including CVE-2018-6242, which famously allowed full exploitation of the Nintendo Switch. When not researching hardware security herself, her passions include making hardware and reverse engineering more accessible to everyone who wants to learn.",
      "link": ""
    },
    {
      "name": "Mikaela Szekely",
      "conference": "BSIDESPDX2019",
      "updated_at": "2019-10-22T16:54+0000",
      "twitter": "",
      "title": "",
      "id": 44150,
      "description": "Mikaela Szekely is an open-source software and hardware enthusiast with a long-standing interest in USB, embedded systems, and the (ab)use of arbitrary code execution vulnerabilities on video game consoles. At the confluence of these interests, she maintains “fusée-launcher”, an open-source USB exploit tool and firmware loader for the Nintendo Switch. When not maintaining her own tools, Mikaela does some code at Great Scott Gadgets, makes truly terrible puns, and hones her computer science skills in scenic Colorado.",
      "link": ""
    }
  ],
  "updated_at": "2019-10-22T16:54+0000"
}