{
  "updated_at": "2019-05-09T17:36+0000",
  "schedule": [
    {
      "id": 30538,
      "start_date": "2019-05-31T22:30+0000",
      "updated_at": "2019-05-08T14:13+0000",
      "location": 30511,
      "speakers": [
        30539
      ],
      "description": "When I first became interested in Security, I was daunted by the questions, “where do I start?” and “what do I need to learn?”. This talk will be the quintessential guide for people that are just getting started in the security field, and for professionals seeking to improve. I will talk about different career paths for those looking to jump in for the first time but aren’t sure where to start, discuss the resources available for training, and give an overview of the tools that can help launch a career in security, or polish existing skills. A website will also be available to pick up any hitchhikers trying to navigate through the (security) galaxy.",
      "event_type": 30513,
      "end_date": "2019-05-31T23:00+0000",
      "title": "Fn00bs Guide to the (security) Galaxy",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30540,
      "start_date": "2019-05-31T23:00+0000",
      "updated_at": "2019-05-08T14:18+0000",
      "location": 30511,
      "speakers": [
        30540
      ],
      "description": "You wanna Bluesnarf? Little bit of Bluejacking? Sniff some packets? Me too! Join me, a Bluetooth n00b, as I begin my journey. I will share my realizations, failures, moments of nerd rage, and what's this? Is that a bit of success? My goal is to share my experience as I learned about Bluetooth vulnerabilities and how to use both hardware and software tools to exploit them. I will be going over things that I assumed were true/false about Bluetooth \"hacking\" and providing the real answers that I found along the way (almost myth buster \"ish)). Beginners will benefit from this because I started this journey as a beginner so all of the doubts, curiosity and frustrations are bundled into a neat little package that I hope will help others have an easier go at it. Anyone beyond beginner will benefit from this because I want to engage others in the Q&A session, including but not limited too suggestions on how I could have done things differently, tool recommendations and future project suggestions. Regardless of skill level I plan for this to be very informative and entertaining for everyone.",
      "event_type": 30513,
      "end_date": "2019-06-01T00:00+0000",
      "title": "Fantastic Bluesnarfs and Where to Find Them! Teams",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30541,
      "start_date": "2019-06-01T00:00+0000",
      "updated_at": "2019-05-08T14:19+0000",
      "location": 30511,
      "speakers": [
        30541,
        30542
      ],
      "description": "Streaking: is an art form? is it an uncontrollable urge? Is it defiant? Is it perverse? Healthy? Naughty? More importantly, how do streakers get into some of the world’s most secure sporting events? The powerhouse duo of Gina Yacone & Bace16 plan on taking you through the history of streaking – the good, the bad, the ugly, and the funny! Through storytelling and humor, they will draw parallels between the streaking assaults made at famous sporting events to the assaults and breaches attempted on the networks and physical security controls of companies.",
      "event_type": 30513,
      "end_date": "2019-06-01T01:00+0000",
      "title": "The Art of Streaking: A Cyber Story",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30542,
      "start_date": "2019-06-01T01:00+0000",
      "updated_at": "2019-05-08T14:20+0000",
      "location": 30511,
      "speakers": [
        30543
      ],
      "description": "Office documents have been an attack vector for a long time, but unfortunately they are still a requirement for most businesses. During this talk, we're going to look at some practical ways to hide data, demonstrate data hiding in Word and Excel documents that could be used for payload smuggling or even data exfiltration. We'll look at how to generate malicious documents, tricks for making them harder to analyze, and how to customize them so that they will be less likely to be detected. We'll also look at some of the ways to detect these techniques, and talk about other areas that might be fun to explore in the future.",
      "event_type": 30513,
      "end_date": "2019-06-01T02:00+0000",
      "title": "Practical Payload Hiding in Office Docs",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30543,
      "start_date": "2019-06-01T02:00+0000",
      "updated_at": "2019-05-08T14:20+0000",
      "location": 30511,
      "speakers": [
        30544,
        30545
      ],
      "description": "Blue-screens inbound. In this one we'll hold your hand as we walk through the process of attacking drivers in Windows kernel-land. This talk is meant to be an entry-level introduction to Windows driver fuzzing. No prior experience is required, but a knowledge of reverse-engineering, Windows internals, or the fuzzing process will be helpful. Attendees will walk away with basic knowledge and a step-by-step process of how to setup, fuzz, and triage crashes caused by drivers behaving badly.",
      "event_type": 30513,
      "end_date": "2019-06-01T02:30+0000",
      "title": "Windows Kernel Fuzzing for Mere Mortals",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30544,
      "start_date": "2019-06-01T14:00+0000",
      "updated_at": "2019-05-08T14:23+0000",
      "location": 30511,
      "speakers": [
        30546
      ],
      "description": "As network defenders, we face evolving threats every day, and are required to truly understand our computer networks; to gain perspective around normal (and abnormal) behavior, and the scope of an event. To help us better understand and protect our systems, we can use completely free and open source tools, augmenting a platform like Security Onion, to assist us in threat hunting, responding to alerts, tracking events, automating analysis of files extracted from network data streams, and even performing remote host-based forensics. This talk delves into tools that are freely available, and how they can be integrated to empower even the smallest of information security departments to effectively monitor, track, and investigate events to help lower risk and increase security posture within their organizations. Audience members should walk away from the talk with a better understanding of the open source tools at their disposal, and how they can begin to immediately realize the benefits of said tool usage within their environments.",
      "event_type": 30513,
      "end_date": "2019-06-01T15:00+0000",
      "title": "Augmenting the Onion: Facilitating Enhanced Detection and Response with Open Source Tools",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30545,
      "start_date": "2019-06-01T15:00+0000",
      "updated_at": "2019-05-08T14:23+0000",
      "location": 30511,
      "speakers": [
        30547
      ],
      "description": "Industrial Control Systems (ICS) is the infrastructure in facilities that provide us with power, treat our drinking water and manage our city & town traffic system(s). Due to the need for a 100% uptime of these critical infrastructures, monitoring of data in the ICS network has to be constant. IT OT convergence covers the ways we can integrate Information Technology and Operations Technology in order to meet the demands of modern-day standards of system, network and security monitoring & diagnostics to cloud systems. At the moment, the way that communications are being remote off network traffic is being handled is through a process referred to as “air gapping” in which the Supervisory Control And Data Acquisition network (SCADA for short) on its own segmented network allows access to the internet for small periods of time. And these communications, updates etc, happen in an asynchronous manner. For true IT OT convergence to happen, the air-gap needs to be bridged, and the way that data comes in and out of the SCADA network needs to be very protected and handled in a scrutinous manner in all perimeter layers. However, what is happening right now is that these networks and devices are being exposed and placed RIGHT onto the open internet, where anyone can observe and sometimes interact with these systems and devices that constitute these systems. This presentation will cover ways that these systems are compromised, and some ways to “Take home” to secure the air-gap between IT and OT.",
      "event_type": 30513,
      "end_date": "2019-06-01T16:00+0000",
      "title": "Gotta Keep Em Separated! Wait, but do we though? Well maybe not so much.",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30546,
      "start_date": "2019-06-01T16:00+0000",
      "updated_at": "2019-05-08T14:24+0000",
      "location": 30511,
      "speakers": [
        30548
      ],
      "description": "Penetration testers and red teamers often need to bypass endpoint and network protections such as anti-virus and IPS to further access into a client’s network and better emulate the behavior of malicious actors. For this purpose, attackers use a number of methods to bypass antivirus solutions and avoid detection, including obfuscating payloads. This talk will discuss a novel technique of hiding payloads inside of neural networks. An open source proof-of-concept encoder and loader called “ENNEoS” (Evolutionary Neural Network Encoder of Shenanigans) will be demonstrated. The encoder uses genetic algorithms to evolve complex neural networks that output the payload shellcode on demand. A high level overview of the technique will be covered, with a more detailed explanation given to how to use the technique.",
      "event_type": 30513,
      "end_date": "2019-06-01T17:00+0000",
      "title": "ENNEoS (Evolutionary Neural Network Encoder of Shenanigans) ",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30547,
      "start_date": "2019-06-01T18:00+0000",
      "updated_at": "2019-05-08T14:27+0000",
      "location": 30511,
      "speakers": [
        30549
      ],
      "description": "“You should be looking at Indicators of Compromise!” exclaims your CISO, regulator, vendor, and mom. No problem, right? You have the most expensive security intelligence vendor and all you have to do is correlate in your expensive SIEM! Well, if you have tried this, then you are laughing with me. Come hear my exploration into implementing IOCs at a major US insurance company and a major US bank. I’ll address the differences in Indicators of Compromise vs Indicators of Attack. I will show you how not to use the MITRE ATT&CK framework, plus some tips on how to use it well. My goal is to save you from falling into the same pitfalls when dealing with Indicators of Crap.",
      "event_type": 30513,
      "end_date": "2019-06-01T19:00+0000",
      "title": "IOC's: Indicators of Crap",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30548,
      "start_date": "2019-06-01T19:00+0000",
      "updated_at": "2019-05-08T14:28+0000",
      "location": 30511,
      "speakers": [
        30550
      ],
      "description": "If you’ve taken training about malware analysis, you’ve likely learned how to deal with suspect .exe files, macro-enabled word documents, or obfuscated scripts—all intended for a Windows victim. But what about malicious files targeting a Linux environment? This talk will walk through the basics of what Linux malware looks like and how to analyze it. We’ll walk through setting up an appropriate lab environment for testing, porting best-practices from Windows analysis into a Linux environment, and finally how to use radare2 to both debug and statically analyze a suspicious file.",
      "event_type": 30513,
      "end_date": "2019-06-01T20:00+0000",
      "title": "Investigate-alackin’ Linux Malware",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30549,
      "start_date": "2019-06-01T20:00+0000",
      "updated_at": "2019-05-08T14:28+0000",
      "location": 30511,
      "speakers": [
        30551
      ],
      "description": "A piece of software that implements a Satoshi-like blockchain client is a rather complicated one: it ingests and processes unauthenticated content, performs cryptographic validations and keeps large amounts of data both in memory and on disk. In general, a question relevant both for blockchain developers and security researchers is: what is a set of \"baseline\" bugs that apply in that context. Of interest are bugs inherent to the blockchain; general appsec bugs such as memory corruption are less interesting, as they do not really pertain to the nature of blockchain systems. In this talk we'll briefly look at a possible list of such baseline bug classes and focus on application security level DoS vectors. This includes issues related to serialization/deserialization, orphan transaction handling, quadratic complexity processing on user supplied input, memory stores of unlimited size, etc. The goal of this talk is to equip the audience with the means to search for relevant application-level DoS bugs in popular coins themselves.",
      "event_type": 30513,
      "end_date": "2019-06-01T21:00+0000",
      "title": "Depressing the Crypto Economy with DoS Bugs",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30550,
      "start_date": "2019-06-01T21:00+0000",
      "updated_at": "2019-05-08T14:29+0000",
      "location": 30511,
      "speakers": [
        30552
      ],
      "description": "One of the key assumptions in programming is that computers execute code that performs the function intended by the programmer. However, as programs become more complex, so do their inputs - giving rise to situations where specially-crafted data can trigger unexpected computations in targets ranging from executables to OS elements to embedded hardware. These \"weird machines\" give rise to exploits in targets ranging from ELF metadata to X86 page handling to embedded font handlers We'll discuss how weird machines are born, take a tour of Sergey Bratus' weird machine zoo, and talk about some of the frameworks and tools being developed to counter the rise of the weird machines.",
      "event_type": 30513,
      "end_date": "2019-06-01T22:00+0000",
      "title": "Rise of the Weird Machines",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30551,
      "start_date": "2019-06-01T23:30+0000",
      "updated_at": "2019-05-08T14:30+0000",
      "location": 30511,
      "speakers": [
        30553
      ],
      "description": "A popular nodejs package changed ownership in late 2018 and found itself as the delivery mechanism for malicious code in a dependency manufactured specifically to inject a payload in a mobile application. How did an attacker go from an npm package to a mobile application? How was this exploit found? What purpose did each of the three payloads have? This is just one example of an elaborately simple attack that can take over a developer environment and inject itself into production applications. In this session we will dive into the three payloads of the attack, how they worked, how they were obfuscated, and what their goal ultimately was. There's no reason to assume this is an isolated event and understanding how this occurred and what it did is an important part of staying secure going forward.",
      "event_type": 30513,
      "end_date": "2019-06-02T00:00+0000",
      "title": "Analysis of an exploited npm package ",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30552,
      "start_date": "2019-06-02T00:00+0000",
      "updated_at": "2019-05-08T14:30+0000",
      "location": 30511,
      "speakers": [
        30554
      ],
      "description": "During this presentation I will be discussing and demoing various methods to gain root console access to embedded devices via UART. As part of this presentation I will detail methods around analyzing the circuits boards using logic analyzer to help identify UART pinouts. The discussions and demos will also including covering attack methods for gain access to UBOOT console, and further attacks via boot arguments, environment variables changes, and passwords alterations, which can lead to root level access.",
      "event_type": 30513,
      "end_date": "2019-06-02T01:00+0000",
      "title": "Uboot to Root",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30553,
      "start_date": "2019-06-02T01:00+0000",
      "updated_at": "2019-05-08T14:31+0000",
      "location": 30511,
      "speakers": [
        30555
      ],
      "description": "You've seen lockpickers open doors by manipulating pins. Such a tactic relies on ownership of pick tools and the knowledge of how to use them. You may have witnessed hackers demonstrate the art of impressioning. Such a technique requires a working blank key that can be hand-filed into the correct shape in order to facilitate entry. But have you ever seen a key fabricated before your eyes from nothing at all? With a raw ingot of metal ore, heat from a flame, and some subversive skill it's possible to re-create almost any key -- no matter how obscure -- via molding and casting. That is what this presentation will entail: keys will be created using raw metal and fire. But not in a forge or foundry... this is a tactic that can be employed in the field by covert entry types who want a way to gain repeated access without having to carry around key blanks and specific tools specialized for every brand of lock. When you're casting a key from nothing, virtually any kind of mechanical lock becomes a valid target.",
      "event_type": 30513,
      "end_date": "2019-06-02T02:00+0000",
      "title": "Forged in Fire - Casting Copied Keys in the Field",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30554,
      "start_date": "2019-06-02T14:00+0000",
      "updated_at": "2019-05-08T14:32+0000",
      "location": 30511,
      "speakers": [
        30556
      ],
      "description": "Like three busy roads coming together, the intersection of business, law, and information security is complex and can have conflicting signs posted, making it difficult for the drivers of Information Security to know which direction to turn. This high-level presentation reviews the domestic and foreign legal “roads” controlling the vehicles of the InfoSec professional, the practical issues that result from those roads, as well as the ethical implications of controlling the traffic on the private corporate streets and the Information Superhighway.",
      "event_type": 30513,
      "end_date": "2019-06-02T15:00+0000",
      "title": "When Can I Go? Can I Even Turn Here? Interpreting the Legal Signs Posted at the Three-Way Intersection of Business, Law, and Information Security.",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30555,
      "start_date": "2019-06-02T15:00+0000",
      "updated_at": "2019-05-08T14:33+0000",
      "location": 30511,
      "speakers": [
        30557
      ],
      "description": "The Kingdom in the West has borne forth a new dragon - its mantle: to vanquish vulnerabilities and immolate CTF binaries. Ghidra is poised to change the game of disassembler thrones, offering an open-source, extendable, and completely free software reverse engineering framework. What does Ghidra bring to the table and how does it compare to the tools you've been using? We'll cover all of that and more in this review of the fire-breathing-and-no-longer-mythical beast.",
      "event_type": 30513,
      "end_date": "2019-06-02T16:00+0000",
      "title": "Enter the Dragon (and Other Draconic Clichés)",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30556,
      "start_date": "2019-06-02T16:00+0000",
      "updated_at": "2019-05-08T14:33+0000",
      "location": 30511,
      "speakers": [
        30558
      ],
      "description": "Contrary to popular belief, the IBM mainframe is alive and well. Also known as the IBM Z family, it is *not* a legacy system; it's still actively maintained and updated, it's still the workhorse of industries from finance to airlines, and it still makes IBM billions of dollars every year. Unfortunately, a combination of proprietary software, high entry costs, and a less-than-cuddly user community has been effective at scaring away new mainframers for decades. It's also been effective at scaring CIOs and CISOs from ever letting infosec staff anywhere near them. This talk will break down mainframes and how they work in terms that a Windows or Linux power user can understand, show you some of the attacks they can be vulnerable to, and hopefully inspire you to go back to your organizations and clients and start testing mainframes!",
      "event_type": 30513,
      "end_date": "2019-06-02T17:00+0000",
      "title": "A Gentle Introduction to Hacking Mainframes",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30557,
      "start_date": "2019-06-02T18:00+0000",
      "updated_at": "2019-05-08T14:34+0000",
      "location": 30511,
      "speakers": [
        30559
      ],
      "description": "The most widely used network-based data exfiltration techniques typically rely on the higher layers of the OSI model in IPv4 networks. The risk with using these higher protocol layers is that IDS/IPS signatures and SIEM rules can be written to spot protocol anomalies and thwart exfiltration. Enter IPv6. Designed to address the growing number of network-connected devices, IPv6 expands the IP space from 32 bits to 128 bits. Now, with more addresses than stars in the universe (~1x10e24), providers are issuing trillions of routable addresses to their customers. By utilizing the unused space that will inevitably exist in most IPv6 networks, paired with the expanded protocol header fields, low data rate exfiltration becomes possible using only Layer 3 protocol headers with the added bonus of a low risk of detection.",
      "event_type": 30513,
      "end_date": "2019-06-02T19:00+0000",
      "title": "Header Steganography: Abusing the IPv6 Header and Prefix-Delegation for Data Exfiltration ",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30558,
      "start_date": "2019-06-02T19:00+0000",
      "updated_at": "2019-05-08T14:34+0000",
      "location": 30511,
      "speakers": [
        30560
      ],
      "description": "In 1905 Harry Houdini wrote his first book entitled “The Right Way to Do Wrong” wherein he divulged the lockpicking and other trade secrets of criminals. People make assumptions about how schemes work and believe them to be complicated, yet in many cases the insider knows how simple they are. Most people assume that besides tailgating and social engineering, real break-ins (or physical security testing) are all about picking locks. However, the secret is that on physical pentests it’s typically unnecessary to do that! Some physical controls have known bypasses, and some building contractors (or even locksmiths) don't implement things correctly. Just like Houdini, I’ll be divulging the simple tricks of the trade employed by both criminals and professional physical pentesters to bypass physical controls without using lockpicks. You may be shocked and amazed by what you see, and once you leave you'll be an insider too - seeing insecurity everywhere!",
      "event_type": 30513,
      "end_date": "2019-06-02T20:00+0000",
      "title": "The Right Way To Do Wrong: Physical security secrets of criminals and professionals alike",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30559,
      "start_date": "2019-06-02T20:00+0000",
      "updated_at": "2019-05-08T14:35+0000",
      "location": 30511,
      "speakers": [
        30561
      ],
      "description": "During Red Team engagements it is important to be able to quickly deploy resources (c2 infrastructure, payloads, phishing pretexts, etc) that are independent of each other in order to reduce the chances of getting detected simply by the attribution of related infrastructure. This typically also requires the procurement of established (categorized) domains which can be difficult to obtain. On the other side of the fence, an Incident Response Team’s activity can be fingerprinted by attackers due to the observable patterns and reuse of scripted analysis tools. This talk will demonstrate how addition of serverless cloud computing can solve the aforementioned problems, and add an immediate benefit to an Infosec Practitioners toolkit (both Red and Blue). Detailed examples will be provided (including source code) showing how serverless functions can be used to perform tasks like using nmap to scan a target, exploiting a SQLi vulnerability with sqlmap, automating malware analysis, and much more - all while avoiding the need to reuse (and maintain) long term infrastructure.",
      "event_type": 30513,
      "end_date": "2019-06-02T21:00+0000",
      "title": "Making Alexa Do Your Dirty Work - Improving Your Toolkit with Serverless Computing ",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30565,
      "start_date": "2019-06-02T13:50+0000",
      "updated_at": "2019-05-08T14:43+0000",
      "location": 30511,
      "speakers": [],
      "description": "Opening Remarks",
      "event_type": 30513,
      "end_date": "2019-06-02T14:00+0000",
      "title": "Opening Remarks",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30566,
      "start_date": "2019-06-01T13:50+0000",
      "updated_at": "2019-05-08T14:43+0000",
      "location": 30511,
      "speakers": [],
      "description": "Opening Remarks",
      "event_type": 30513,
      "end_date": "2019-06-01T14:00+0000",
      "title": "Opening Remarks",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30567,
      "start_date": "2019-05-31T22:15+0000",
      "updated_at": "2019-05-08T14:44+0000",
      "location": 30511,
      "speakers": [],
      "description": "Opening Remarks",
      "event_type": 30513,
      "end_date": "2019-05-31T22:30+0000",
      "title": "Opening Remarks",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30568,
      "start_date": "2019-05-31T21:00+0000",
      "updated_at": "2019-05-08T14:59+0000",
      "location": 30515,
      "speakers": [],
      "description": "Registration Opens",
      "event_type": 30513,
      "end_date": "2019-06-01T02:00+0000",
      "title": "Registration Opens",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30569,
      "start_date": "2019-06-01T13:00+0000",
      "updated_at": "2019-05-08T14:59+0000",
      "location": 30515,
      "speakers": [],
      "description": "Registration Re-Opens",
      "event_type": 30513,
      "end_date": "2019-06-02T02:00+0000",
      "title": "Registration Re-Opens",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30570,
      "start_date": "2019-06-02T13:00+0000",
      "updated_at": "2019-05-08T14:59+0000",
      "location": 30515,
      "speakers": [],
      "description": "Registration Re-Opens",
      "event_type": 30513,
      "end_date": "2019-06-02T21:00+0000",
      "title": "Registration Re-Opens",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30571,
      "start_date": "2019-06-02T21:00+0000",
      "updated_at": "2019-05-08T14:55+0000",
      "location": 30511,
      "speakers": [],
      "description": "Closing Remarks and Awards",
      "event_type": 30513,
      "end_date": "2019-06-02T22:00+0000",
      "title": "Closing Remarks and Awards",
      "link": "https://cackalackycon.org/schedule.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30573,
      "start_date": "2019-06-01T02:30+0000",
      "updated_at": "2019-05-08T15:01+0000",
      "location": 30512,
      "speakers": [],
      "description": "Party",
      "event_type": 30511,
      "end_date": "2019-06-01T06:00+0000",
      "title": "Friday Night Party",
      "link": "",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30574,
      "start_date": "2019-06-02T02:00+0000",
      "updated_at": "2019-05-08T15:02+0000",
      "location": 30512,
      "speakers": [],
      "description": "Party",
      "event_type": 30511,
      "end_date": "2019-06-02T06:00+0000",
      "title": "Saturday Night Party",
      "link": "",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30575,
      "start_date": "2019-06-01T14:00+0000",
      "updated_at": "2019-05-09T17:20+0000",
      "location": 30512,
      "speakers": [],
      "description": "Oak City Locksport will be running a Lockpick Village at CackalackyCon! Come join us for picking, contests, etc. on Saturday and Sunday June 1st and 2nd. ",
      "event_type": 30512,
      "end_date": "2019-06-01T22:00+0000",
      "title": "Lockpick Village ",
      "link": "https://cackalackycon.org/events.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30576,
      "start_date": "2019-06-02T14:00+0000",
      "updated_at": "2019-05-09T17:21+0000",
      "location": 30512,
      "speakers": [],
      "description": "Oak City Locksport will be running a Lockpick Village at CackalackyCon! Come join us for picking, contests, etc. on Saturday and Sunday June 1st and 2nd. ",
      "event_type": 30512,
      "end_date": "2019-06-02T18:00+0000",
      "title": "Lockpick Village ",
      "link": "https://cackalackycon.org/events.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30577,
      "start_date": "2019-05-31T22:30+0000",
      "updated_at": "2019-05-09T17:22+0000",
      "location": 30513,
      "speakers": [],
      "description": "EverSec CTF is a Capture The Flag competition about the fictitious company Eversec who gets hacked and needs some friendly hacker help. Hosted by the EverSec crew, this CTF has been run at multiple cons over the years, including CarolinaCon, BSides RDU, BSides Asheville, BSides Charleston, and now CackalackyCon! \r\nThe Eversec CTF was founded in 2016 by @gabemarshall after being inspired by competing in the DerbyCon CTF. The CTF is now developed by the following individuals:@gabemarshall @deyavito @austinrobertson @stevemyrick @SandroBruscino @claytondorsey @khpuddin @luxcupitor @doylersec @RecViking @ch1kpee ",
      "event_type": 30514,
      "end_date": "2019-06-01T02:30+0000",
      "title": "Capture the Flag ",
      "link": "https://twitter.com/eversecctf",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30578,
      "start_date": "2019-06-01T14:00+0000",
      "updated_at": "2019-05-09T17:22+0000",
      "location": 30513,
      "speakers": [],
      "description": "EverSec CTF is a Capture The Flag competition about the fictitious company Eversec who gets hacked and needs some friendly hacker help. Hosted by the EverSec crew, this CTF has been run at multiple cons over the years, including CarolinaCon, BSides RDU, BSides Asheville, BSides Charleston, and now CackalackyCon! \r\nThe Eversec CTF was founded in 2016 by @gabemarshall after being inspired by competing in the DerbyCon CTF. The CTF is now developed by the following individuals:@gabemarshall @deyavito @austinrobertson @stevemyrick @SandroBruscino @claytondorsey @khpuddin @luxcupitor @doylersec @RecViking @ch1kpee ",
      "event_type": 30514,
      "end_date": "2019-06-02T02:00+0000",
      "title": "Capture the Flag ",
      "link": "https://twitter.com/eversecctf",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30579,
      "start_date": "2019-06-02T14:00+0000",
      "updated_at": "2019-05-09T17:23+0000",
      "location": 30513,
      "speakers": [],
      "description": "EverSec CTF is a Capture The Flag competition about the fictitious company Eversec who gets hacked and needs some friendly hacker help. Hosted by the EverSec crew, this CTF has been run at multiple cons over the years, including CarolinaCon, BSides RDU, BSides Asheville, BSides Charleston, and now CackalackyCon! \r\nThe Eversec CTF was founded in 2016 by @gabemarshall after being inspired by competing in the DerbyCon CTF. The CTF is now developed by the following individuals:@gabemarshall @deyavito @austinrobertson @stevemyrick @SandroBruscino @claytondorsey @khpuddin @luxcupitor @doylersec @RecViking @ch1kpee ",
      "event_type": 30514,
      "end_date": "2019-06-02T19:00+0000",
      "title": "Capture the Flag ",
      "link": "https://twitter.com/eversecctf",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30580,
      "start_date": "2019-05-31T23:00+0000",
      "updated_at": "2019-05-09T17:30+0000",
      "location": 30514,
      "speakers": [],
      "description": "By @cryptoreo",
      "event_type": 30512,
      "end_date": "2019-06-01T01:00+0000",
      "title": "Crypto Circle Twerk",
      "link": "https://cackalackycon.org/events.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30581,
      "start_date": "2019-06-01T23:00+0000",
      "updated_at": "2019-05-09T17:31+0000",
      "location": 30514,
      "speakers": [],
      "description": "By @cryptoreo",
      "event_type": 30512,
      "end_date": "2019-06-02T01:00+0000",
      "title": "Crypto Circle Twerk",
      "link": "https://cackalackycon.org/events.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30582,
      "start_date": "2019-06-01T14:00+0000",
      "updated_at": "2019-05-09T17:33+0000",
      "location": 30514,
      "speakers": [],
      "description": "GreenHat Solutions (GHS) (https://greenhatsolutions.com/) presents a 802.11 (WiFi) Capture The Flag event. \r\n\r\nUnlike many CTF’s, the Shoothouse provides an opportunity to conduct wireless penetration testing against various targets. While capturing the keys to access the wireless network will award points, the challenge doesn’t end there. Competitors will have the option to find additional flags; these flags will either require accessing the router user interface, the client devices, or the traffic between clients.Contestants will have the chance to train on or hone their skills with a vast arsenal of tools, and techniques to include: \r\n\r\nHashcat, JtR, Crunch, Cewl, most tools in the aircrack suite, hydra, medusa, mdk-3, pyrit, coWPAtty, nmap, wireshark, macchanger, Metasploit, ettercap ",
      "event_type": 30514,
      "end_date": "2019-06-01T22:00+0000",
      "title": "Shoothouse for Wireless",
      "link": "https://cackalackycon.org/events.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    },
    {
      "id": 30583,
      "start_date": "2019-06-02T14:00+0000",
      "updated_at": "2019-05-09T17:36+0000",
      "location": 30514,
      "speakers": [],
      "description": "Presented by @foospidy \r\n\r\nHoneypots can be implemented to discover new threat information or detect intruders on a network. However, while there are numerous free honeypots available, many of them can be complicated to deploy or require additional engineering around them to consume log data. Are you curious to learn more about honeypots? Are you interested in deploying your own honeypots on the Internet? HoneyDB is comprised of a honeypot agent and data collection backend, which makes getting started with honeypots simple. In the HoneyDB honeypot workshop, you will learn about honeypots, configure and deploy a honeydb-agent, and use HoneyDB tools to query honeypot data. This workshop is for beginner levels and up. ",
      "event_type": 30510,
      "end_date": "2019-06-02T19:00+0000",
      "title": "HoneyDB Workshop",
      "link": "https://cackalackycon.org/events.html",
      "conference": "CACKALACKY2019",
      "includes": ""
    }
  ]
}