{
  "speakers": [
    {
      "id": 30562,
      "description": "Christina is a Social Engineering expert and ethical human hacker. With a background in Psychology, she learned the mechanisms of behavior, motivation, decision making, as well as manipulation and deceit. She became particularly interested in human dynamics and passionate about social engineering. Her writings on social engineering strategies earned her a distinction during her master studies. Christina has participated among other things, in forensic investigations within companies, and in needs and vulnerabilities assessments. She is currently working with Cyber Risk GmbH, a provider of cyber security training programs, as a social engineering expert and trainer.\r\n\r\n",
      "link": "",
      "updated_at": "2019-05-21T13:15+0000",
      "title": "",
      "name": "Christina Lekati",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30563,
      "description": "Tigran (th3CyF0x) is presently an Incident Handler. He has been fascinated with languages, cultures, social psychology, military tactics and history since childhood. Despite a degree in international relations, he stumbled across Cyber Security and decided to pull the trigger and tumble down the security rabbit hole. Along the way, he was beset by the beasts of Compliance (FedRAMP) but found his banner under Red Teaming. Tigran enjoys applying red teaming concepts to conduct threat hunting and is passionate about emulating an adversary. He also loves playing tennis and is an avid practitioner of Krav Maga.\r\n",
      "link": "",
      "updated_at": "2019-05-21T13:15+0000",
      "title": "",
      "name": "Tigran Terpandjian",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30564,
      "description": "Fotis (@ithilgore) Chantzis is a principal information security engineer at Mayo Clinic, where he manages and conducts technical vulnerability assessments on medical devices and clinical support systems as well as penetretation tests and red team engagements on the network. Fotis has over 10 years of experience in the information security industry, which includes time spent researching network protocol vulnerabilities and developing security tools. He has been a contributor to the Nmap project since 2009, when he wrote the Ncrack network authentication cracking tool, which he still maintains, and has published a video course on “Mastering Nmap”. His research on network security includes exploiting the TCP Persist Timer (published on Phrack #66) and inventing a new stealthy port scanning technique by abusing the popular XMPP. His most recent research focus has been on medical device & IoT security.",
      "link": "",
      "updated_at": "2019-05-21T13:16+0000",
      "title": "",
      "name": "Fotios “Fotis” Chantzis",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30565,
      "description": "Funsized is an EE by day, and… still an EE at night. He enjoys building robots and cooking. Sometimes these hobbies are combined in terryfing and delicious ways.",
      "link": "",
      "updated_at": "2019-05-21T13:16+0000",
      "title": "",
      "name": "Funsized",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30566,
      "description": "IrishMASMS (@IrishMASMS) is an old school hacker, fighting the good fight in Computer Network Defense (CND)/blue team efforts for over 19 years. Been lurking about since DEFCON 10, DJing the B&W ball at DEFCON 18 (with quite a few AP pool shindigs and private parties along the way). Panel member at HOPE 5, presenter at a couple of Notacon’s, LayerOne, Toorcon, Bsides, and some other conferences that are hard to remember or may lean on the more professional side. Having progressed through the ranks to hiring manager and director level, he has experienced the pain from both sides of the hiring process and desires to improve the situation for the InfoSec community. Is this where we mention cyberderp?",
      "link": "",
      "updated_at": "2019-05-21T13:16+0000",
      "title": "",
      "name": "IrishMASMS",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30567,
      "description": "Jason spent nearly 15 years as an intelligence officer: designed, executing, and managing offensive cyber and technical operations all over the world. He left the government in 2017 and is working to deprogram as quickly as possible, and is helped in this endeavor by coffee and red wine. He is currently the Vice President for Advanced Security Concepts at eSentire.",
      "link": "",
      "updated_at": "2019-05-21T13:17+0000",
      "title": "",
      "name": "Jason Kichen",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30568,
      "description": "machinist is the Dr. Dolittle of robots.\r\n\r\n",
      "link": "",
      "updated_at": "2019-05-21T13:17+0000",
      "title": "",
      "name": "Machinist",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30569,
      "description": "Ravin is an engineer and data expert. He’s deployed machine learning models in production and writes production-grade software.\r\n",
      "link": "",
      "updated_at": "2019-05-21T13:17+0000",
      "title": "",
      "name": "Ravin Kumar",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30570,
      "description": "Marcus has been working in information security over 12 years and currently hacks at Somerset Recon. He actively host and participates in capture the flag hacking competitions and enjoys reverse engineering, exploit development, lock picking, SCADA security, embedded device hacking, web hacking and mobile application hacking.",
      "link": "",
      "updated_at": "2019-05-21T13:17+0000",
      "title": "",
      "name": "Marcus Richerson",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30571,
      "description": "Brett is a Breaker of Web Applications, Leader of a DefCon Group, Maker of Tasty Food, and Owner of a Majestic Beard. He has over 17 years of experience in IT and Security, specializing in Web Application Pentesting, PCI practices, vulnerability scanning, and management.",
      "link": "",
      "updated_at": "2019-05-21T13:17+0000",
      "title": "",
      "name": "Security Panda",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30572,
      "description": "wasabi: Perpetual researcher, tinkerer of electronics, builder of competitions, and experimenter of IoT.\r\n\r\n",
      "link": "",
      "updated_at": "2019-05-21T13:18+0000",
      "title": "",
      "name": "Wasabi",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30573,
      "description": "bluescreenofwin: Senior windows system administrator, maker of beer, and enthusiast Windows hacker. Beer, binary, Battlestar Galactica.",
      "link": "",
      "updated_at": "2019-05-21T13:18+0000",
      "title": "",
      "name": "bluescreenofwin",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30574,
      "description": "Chris Schafer started in infosec 7 years ago playing CCDC. Since then, he’s worked extensively with logging, SIEMs, automation, and malware. His greatest professional goal is automating himself out of a job.\r\n",
      "link": "",
      "updated_at": "2019-05-21T13:18+0000",
      "title": "",
      "name": "Chris Schafer",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30575,
      "description": "Chloe Messdaghi is a Security Researcher Advocate/PMM @Bugcrowd. Since entering cybersecurity space, she sees security as a humanitarian issue. Data breaches don’t just impact companies, but governments, environments, and people. This can adversely affect lives of the most vulnerable persons as well. Hence, her previous and current humanitarian passion has led her to become passionate about cybersecurity. Humanitarian work includes advising as a UN Volunteer, serving as a board member for several humanitarian organizations. Chloe is also the head of WIST organization, mentor and advocate for inclusion in tech, and founded a nonprofit called Drop Labels.",
      "link": "",
      "updated_at": "2019-05-21T13:19+0000",
      "title": "",
      "name": "Chloe Messdaghi",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30576,
      "description": "Until she’s accepted for a Mars mission, Amber’s goal is to advance data protection and personal information privacy as a Privacy Technical Lead for Schellman & Company. Amber been assessing corporate privacy compliance programs for the past year and prior to that, managed security and privacy governance for a suite of SaaS products. She has previously worked in companies creating ERP, CRM, event planning, and biologics manufacturing software.",
      "link": "",
      "updated_at": "2019-05-21T13:19+0000",
      "title": "",
      "name": "Amber Welch",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30577,
      "description": "Geoffrey Janjua is the founder of Exumbra Operations Group is a former US DoD civilian with 12+ years of operational field experience conducting offensive computer operations. Specializing in computer exploitation, technical operations, and covert-entry. He is currently conducting full-scope penetration testing, vulnerability research and exploit development of high-value products for a Fortune 500 company, has identified multiple zero-days, and holds many security related industry certifications to include OSCP, GPEN, CEPT, CPT, ECSA, CEH, and CRT..",
      "link": "",
      "updated_at": "2019-05-21T14:03+0000",
      "title": "",
      "name": "Geoffrey Janjua",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30578,
      "description": "Justin Bui (@slyd0g) is an Operator at SpecterOps and has experience performing penetration tests, red team engagements and web application assessments. He is passionate about all things security and helping organizations improve their security posture. Justin enjoys writing code, developing offensive tools and blogging security stuff at https://medium.com/@slyd0g",
      "link": "",
      "updated_at": "2019-05-21T14:04+0000",
      "title": "",
      "name": "Justin Bui",
      "conference": "LAYERONE2019",
      "twitter": ""
    },
    {
      "id": 30579,
      "description": "Vyrus (@vyrus001) has been associated with a variety of subjectively nefarious entities and or projects that include but are not limited to, OCTF, Thotcon, BsidesLV, HOPE, BlackHat, BalcCon, LayerOne, ShmooCon, Ceaser’s Challange, You Shot The Sharif, BerlinSides, Bsides Knoxville, and ToorCamp. While almost the entirety of his skillet is still hidden from public disclosure, he has been implicated, though never charged, in over a dozen other confidence schemes and frauds.",
      "link": "",
      "updated_at": "2019-05-21T14:04+0000",
      "title": "",
      "name": "Vyrus",
      "conference": "LAYERONE2019",
      "twitter": ""
    }
  ],
  "updated_at": "2019-05-21T14:04+0000"
}