{
  "updated_at": "2019-07-27T17:33+0000",
  "schedule": [
    {
      "description": "Women & nonbinary people come to meet, get to know each other & do fun girl/hacking/geeky stuff together! RSVP (not required) https://www.meetup.com/HackerFoodies/events/262691815/\n\nPS: We have a discord for the Women attending DEF CON or HackerSummerCamp in general. If you want an invite send a DM to @sylv3on_  @nemessisc or @CircuitSwan",
      "id": 40001,
      "event_type": 40004,
      "title": "DEF CON Ladies Meetup",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [],
      "location": 40022,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T02:00+0000",
      "start_date": "2019-08-09T00:00+0000"
    },
    {
      "description": "Back again! VETCON is a Party thrown by Veterans for everyone! Come join in as veterans from all branches come together to celebrate and take on challenges that you only hear about in movies. Space force recruiting? Airmen in a chair race? Military drill displays? All this and more. It's time to raise hell the way our people in uniform are famous for.",
      "id": 40002,
      "event_type": 40004,
      "title": "VETCON II",
      "includes": "",
      "link": "Twitter: @VetConActual",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [],
      "location": 40023,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T09:00+0000",
      "start_date": "2019-08-10T02:30+0000"
    },
    {
      "description": "SecKC is back. But this time, they're shooting for the stars! Roll up on your favorite thoroughbred and make sure to bring your intergalactic western gear. Outlaws and sheriffs alike are welcome!\n\nThis party is happening in a beautiful old cabaret club that will be getting the SecKC mojo treatment ;) And music will be provided by none other than Keith Myers, Archwisp, and Professor S! Come join us for dancing, games, and other various shenanigans. The party starts at 10:00 and goes until the last hacker leaves!",
      "id": 40003,
      "event_type": 40004,
      "title": "SecKC The World Again",
      "includes": "",
      "link": "https://seckc.org/",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [],
      "location": 40024,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T09:00+0000",
      "start_date": "2019-08-10T04:00+0000"
    },
    {
      "description": "Friday night will be a place for con-goers to meet and greet the speakers from Skytalks.  We'll also have DJs and potentially have live music too.",
      "id": 40004,
      "event_type": 40004,
      "title": "Skytalks",
      "includes": "",
      "link": "https://skytalks.info",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [],
      "location": 40025,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T09:00+0000",
      "start_date": "2019-08-10T02:30+0000"
    },
    {
      "description": "Check your ego at the door, grab some building materials and join in the celebration of the creativity and originality that is the blanket fort. A host of DJs will be spinning from a pirate ship as you share and create your own unique environment. All aboard!",
      "id": 40005,
      "event_type": 40004,
      "title": "Blanketfort Con",
      "includes": "",
      "link": "https://twitter.com/blanketfortcon?lang=en",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [],
      "location": 40026,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T09:00+0000",
      "start_date": "2019-08-10T02:30+0000"
    },
    {
      "description": "hacker outreach\" event\n\nFollow T:@DefConOwasp for updates\nAugust 9th @8PM\nConcorde B in Paris\n\nSwing by between 8-10PM+ on the 9th of August to connect with others.\nCome and meet cool groups and crews,\nwe encourage you to come and take a\nspace at the event : )\n\nCome hang and meet others,\nmake new friends,\nsee what others are working on : )\n\nLearn about & meet organizations that are working to bring empowerment and inclusion to the hacker community.\n\nWe are next to Blanket Fort Con: )",
      "id": 40006,
      "event_type": 40004,
      "title": "Diversity Party",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [],
      "location": 40026,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T09:00+0000",
      "start_date": "2019-08-10T02:30+0000"
    },
    {
      "description": "Two great things that go great together! Join the fun as your fellow hackers make their way through songs from every era and style. Everyone has a voice and this is your opportunity to show it off! Quickly becoming a DEF CON tradition and a favorite of people from all skill levels.",
      "id": 40007,
      "event_type": 40004,
      "title": "Hacker Karaoke",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [],
      "location": 40027,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T09:00+0000",
      "start_date": "2019-08-10T02:30+0000"
    },
    {
      "description": "Two great things that go great together! Join the fun as your fellow hackers make their way through songs from every era and style. Everyone has a voice and this is your opportunity to show it off! Quickly becoming a DEF CON tradition and a favorite of people from all skill levels.",
      "id": 40008,
      "event_type": 40004,
      "title": "Hacker Karaoke",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [],
      "location": 40027,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T09:00+0000",
      "start_date": "2019-08-11T02:30+0000"
    },
    {
      "description": "An open discussion on agency, sexuality, and harassment/abuse in tech. What can we do, as a community, to make spaces safer for everyone? How can we encourage more sex positive discussions? Let’s talk about it.",
      "id": 40009,
      "event_type": 40004,
      "title": "BADASS/Cyber SeXurity",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [],
      "location": 40022,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T01:00+0000",
      "start_date": "2019-08-09T22:00+0000"
    },
    {
      "description": "A repeat favorite of DEF CON attendees, with DJ's from across the community as well as creative works and technical expertise. What can we say, it's 303!",
      "id": 40010,
      "event_type": 40004,
      "title": "303",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [],
      "location": 40028,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T09:00+0000",
      "start_date": "2019-08-11T02:30+0000"
    },
    {
      "description": "Relive once again the experience of the arcade at DEF CON. From classics to a custom built 16 player foosball table! Jam out to special guest DJ's while taking another swipe at that high score on your favorite classic video games. No quarters required!",
      "id": 40011,
      "event_type": 40004,
      "title": "Arcade party",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [],
      "location": 40023,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T09:00+0000",
      "start_date": "2019-08-11T02:30+0000"
    },
    {
      "description": "Back for our second year, in the gorgeous Front room of the Gallery Bar in Planet Hollywood on Saturday August 10th. GOTHCON (or #dcgothcon) is a collection of goths, goth-adjacent, friends of goths, and others who just wanted to hang out in their favorite outfits and listen to some goth-of-center music. It's a fun space for *everyone* to make friends and have fun during DEF CON. We encourage people to dress up however they want, to come with open minds, and to not be a jerk. Everyone is welcome!",
      "id": 40012,
      "event_type": 40004,
      "title": "GothCON",
      "includes": "",
      "link": "https://www.gofundme.com/f/gothcon-defcon-party Twitter: @dcgothcon",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [],
      "location": 40029,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T09:00+0000",
      "start_date": "2019-08-11T02:30+0000"
    },
    {
      "description": "Flaming badge builder or just badge curious Hacker Flairgrounds is the ultimate gathering of hackers and blinking LEDs in Vegas.\"\nThis is the Meetup destination for badge collectors, designers, and prototypers that you have been waiting for! A social environment to show off you custom badges, discuss projects to make you own badges and to talk to collectors who cherish your work. Flashing LEDs, crafting time, trading, and the celebration of badge craft all in one.",
      "id": 40013,
      "event_type": 40004,
      "title": "Hacker Flairgrounds",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [],
      "location": 40030,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T09:00+0000",
      "start_date": "2019-08-11T02:30+0000"
    },
    {
      "description": "If you're a lawyer (recently unfrozen or otherwise), a judge or a law student please make a note to join Jeff McNamara at 18:00 on Friday, August 9th, for a friendly get-together, drinks, and conversation. Location: Inside the Napoleons Bar just outside of the Paris Speaking Tracks.",
      "id": 40014,
      "event_type": 40004,
      "title": "Lawyers Meet",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [],
      "location": 40031,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T03:00+0000",
      "start_date": "2019-08-10T01:00+0000"
    },
    {
      "description": "The antenna is one of the most important pieces of a good receiver.  Yet it seems technical specifications are made up by the Marketing Departments, not by the Engineers.  Wild claims about gain and misleading data seem to be the norm.  In this Demonstration you will be able to see and hear the effects of gain and have a better understanding of beamwidths and patterns.  Over a dozen different antennas will be available for demonstration, and our miniature antenna range can do some quick tests on your antenna.",
      "id": 40015,
      "event_type": 40006,
      "title": "Antennas for Surveillance applications",
      "includes": "",
      "link": "http://WWW.WA5VJB.COM",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40050,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T18:50+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "bedr is a Linux syscall monitor that uses Berkeley Packet Filters that hook via kernel tracepoints. It collects the holy trinity of EDR data - proc events, filemods, and netconns - and ships them off to somewhere else for off-machine detection and response. Basically, it’s half of what you need to make an EDR!",
      "id": 40016,
      "event_type": 40006,
      "title": "bedr",
      "includes": "",
      "link": "https://github.com/mark-ignacio/bedr",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40051,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T20:50+0000",
      "start_date": "2019-08-10T19:00+0000"
    },
    {
      "description": "BEEMKA is a tool that allows Red-Teamers to establish persistence on a compromised host, or even egress data from the it. In addition, it allows them to execute code from within the context of the compromised application (Slack, Skype, WhatsApp, Bitwarden, VS Code) allowing them to access otherwise inaccessible data. Come find out how you can extract all passwords from Bitwarden, or how to egress all the source code files from VS Code!",
      "id": 40017,
      "event_type": 40006,
      "title": "BEEMKA - Electron Post-Exploitation Framework",
      "includes": "",
      "link": "https://github.com/ctxis/beemka/",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40052,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T18:50+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "During large scale engagements against multiple applications teams often split the workload across many testers. Currently, sharing Burpsuite states requires exporting large files that are point in time requiring multiple exports and shares if new developments in engagement occur which restricts the ability for teams to collaborate on an application. With my new Bursuite plugin, coupled with a lightweight server, multiple testers can share traffic in real time across multiple applications allowing for quick collaboration! Have a repeater payload your team needs to see? Simply right click the request and select share to populate their repeater tabs! Need help with a intruder payload? Have another tester create it and send it to you! Come listen and see how this plugin can help your teams hack collaboratively!",
      "id": 40018,
      "event_type": 40006,
      "title": "Burpsuite Team Server for Collaborative Web App Testing",
      "includes": "",
      "link": "https://github.com/Static-Flow/BurpSuite-Team-Extension",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40050,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T22:50+0000",
      "start_date": "2019-08-10T21:00+0000"
    },
    {
      "description": "If you’ve never thought USB devices could become even less trustworthy, then this is the talk for you.  We already know USB devices might try to automatically run code when connected, or act like a hyperactive keyboard and mouse, or attempt to physically destroy the host, or masquerade as an innocent charging/data cable.  But it can, actually, get worse.  Say hello to the Chaos Drive, a USB drive with just a little too much chaotic energy.  I’ll demonstrate how a Linux-based USB mass storage device can be set up to change the storage it presents to the host based on a set of user-defined conditions.  On the offensive side this can be used to circumvent USB scanning procedures and on the defensive side this can be used to store private files that will be undetectable without time-consuming analysis.  Attendees will learn the steps I took to build the POC and see what it can do.  For best results bring a USB OTG-capable device such as a Pi Zero or Pocketbeagle, an OTG cable, and some spare microSD cards to flash.",
      "id": 40019,
      "event_type": 40006,
      "title": "Chaos Drive, because USB is still too trustworthy",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40053,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T22:50+0000",
      "start_date": "2019-08-09T21:00+0000"
    },
    {
      "description": "Designed under Raspberry Pi and aimed for Red Team Ops, we take advantage of “Sec/Net/Dev/Ops” enterprise tools to capture network credentials in a stealth mode. Using a low-profile hardware & electronics camouflaged as simple network outlet box to be sitting under/over a desk.  CIRCO include different techniques for network data exfiltration to avoid detection from IDS/IPS or monitoring systems.  This tool gathers information and use a combination of honeypots to trick Automation Systems to give us their network credentials!  We will build a physical network & infrastructure lab to show how CIRCO works (live demo)  Major features for release v1.5 (Aug): - Allow existing IP-Phone to co-exist with CIRCO - Eliminate template files (craft all packets) - Support NTP exfiltration - Software encrypted via Bluetooth (prevent forensic) - Self destroy and alarm switch - Bypass active & passive fingerprinting (NAC) - Credentials integration into Faraday",
      "id": 40020,
      "event_type": 40006,
      "title": "CIRCO: Cisco Implant Raspberry Controlled Operations",
      "includes": "",
      "link": "https://github.com/ekiojp/circo",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40054,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T18:50+0000",
      "start_date": "2019-08-10T17:00+0000"
    },
    {
      "description": "Combo Password is a PoC for using (as the name suggests) key combinations in passwords. There is one nice implication that might justify the increased complexity and other possible gripes:  Compared to a normal password, a combo password of the same length has far more possible combinations. This effect is increasing with password length and the number of usable keys. With three available keys and a length of two there are 9 combinations for normal passwords and 15 for combo passwords. Increasing the length to three we get 27 vs 69 combinations.  This could lead to less strict password requirements while increasing the security.  The goal of this project is to develop a free standard, a browser plugin for using combo passwords in regular login forms and implementations for popular languages, frameworks and PAM.  Visit Demo Labs and try to break a real hackers password, there will be a small reward for the fastest brute force tool!",
      "id": 40021,
      "event_type": 40006,
      "title": "Combo Password",
      "includes": "",
      "link": "http://uploadfilter.rocks/combo-password (n-key rollover advised) https://gitlab.com/FalkF/combopassword",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40055,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T22:50+0000",
      "start_date": "2019-08-09T21:00+0000"
    },
    {
      "description": "Cotopaxi is a set of tools for security testing of Internet of Things devices using specific network IoT/IIoT/M2M protocols (e.g. CoAP, MQTT, DTLS, mDNS, HTCPCP). These tools will be used by penetration testers or security researchers to identify IoT services and verify security vulnerabilities or misconfigurations. Currently available tools used for security testing, like nmap or OpenVAS, do not support all new IoT protocols.  So possibilities to test IoT products and discover such devices in tested networks are limited.  We are working to fill this gap with Cotopaxi toolkit. Main features of our toolkit are: - Checking availability of network services for supported IoT protocols at given IPs and port ranges (\"service ping\"), - Recognizing the software used by remote network server (\"IoT software fingerprinting\") based on responses for given messages using machine learning classifier, - Discovering resources identified by given URLs (\"dirbusting\"), - Performing black-box fuzzing of IoT protocols based on corpus of packets prepared using coverage-based fuzzer,  - Identifying known vulnerabilities in IoT servers, - Detecting network traffic amplification. New features in release for Defcon27 are: - client-side versions of protocol fuzzer and vulnerability tester, - support for new protocols: SSDP and HTCPCP.",
      "id": 40022,
      "event_type": 40006,
      "title": "Cotopaxi: IoT Protocols Security Testing Toolkit",
      "includes": "",
      "link": "https://github.com/Samsung/cotopaxi",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40052,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T18:50+0000",
      "start_date": "2019-08-10T17:00+0000"
    },
    {
      "description": "CSTC is a Burp Suite extension for various input transformations. It implements a generic solution that can replace numerous specialized extensions.  The CSTC solves the problem of having too specific burp plugins by being a more generic problem solving tool. It contains a wide range of very simple operations that can be chained into complex transformations. This allows a penetration tester to create the exact transformation they need to test a specific product without having to write any code. As we all know, writing code and setting everything up is time consuming.  You can configure complex input transformations for both requests and responses simply by using drag and drop. You can calculate HMACs for parts of the request, refresh timestamps, update sequence numbers or encrypt parts of the request. You can chain together different operations to create more complex transformations. You could extract parts of the request, decompress them, insert your payload using the repeater or utilizing the scanner and put it back in and compress it again before sending it. Since there are already many basic operations implemented, you can easily focus on testing the application instead of searching for extensions performing such transformations.",
      "id": 40023,
      "event_type": 40006,
      "title": "Burp Plugin: Cyber Security Transformation Chef (CSTC)",
      "includes": "",
      "link": "https://github.com/usdag/cstc",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40050,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T20:50+0000",
      "start_date": "2019-08-10T19:00+0000"
    },
    {
      "description": "Companies are large, and the number of subdomains they expose is even larger. There are a number of tools to uncover subdomains an organization is exposing, but individually they do not give you the complete picture. In the event that you use multiple tools, you are given an overwhelming amount of data to piece together into an aggregate view. In this talk we introduce Dr.ROBOT, a domain reconnaissance tool that was developed to run a large variety of subdomain enumeration tools. It was designed to trivially incorporate new tools as they are released by leveraging Docker and Ansible. Dr.ROBOT has three stages: gathering, inspection, and publishing. In the gathering stage, it gathers as much information as it can and aggregates the results. In the inspection phase, it captures screenshots and other information regarding the target. Finally, in the publishing phase it sends the data gathered during the previous two phases to an endpoint for manual review. Dr.ROBOT was created to serve as a comprehensive source on subdomain exposure by gathering information from as many resources as possible. It is a versatile utility for bug bounty hunters, blue teams, red teams, and many others.",
      "id": 40024,
      "event_type": 40006,
      "title": "Dr.ROBOT: Organized Chaos and the Shotgun Approach",
      "includes": "",
      "link": "https://github.com/sandialabs/dr_robot",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40055,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T20:50+0000",
      "start_date": "2019-08-10T19:00+0000"
    },
    {
      "description": "EAPHammer is a toolkit for performing targeted rogue access point attacks against enterprise wireless infrastructure. It is designed to be used in full scope wireless assessments and red team engagements. As such, focus has been placed on providing an easy-to-use interface that can be leveraged to execute powerful wireless attacks with minimal manual configuration.     This summer will mark the third anniversary of EAPHammer since it was released at DEF CON Demo Labs and BlackHat Arsenal in 2017. It's also the most exciting and complete version of the tool yet, with the addition of a number of features that were requested directly by users at Demo Labs in 2018.     EAPHammer now supports most of the bleeding edge attacks that have been discovered by the wireless community over the past few years, including:       - WPA3 Transition Mode and Security Group Downgrade Attacks    - Reflection and Invalid Curve attacks against EAP-pwd    - GTC-Downgrade, Fixed Challenge, and EAP Relay attacks against WPA/2-EAP    - PMKID attacks against WPA/2-PSK networks    - Known Beacons Attack and Legacy SSL Support    - External Certificate Handling and Import     Perhaps most excitingly, we've also included some never-before-seen attacks against Opportunistic Wireless Encryption (OWE), which is better known as \"Enhanced Open\".",
      "id": 40025,
      "event_type": 40006,
      "title": "EAPHammer",
      "includes": "",
      "link": "https://github.com/s0lst1ce/eaphammer",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40050,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T20:50+0000",
      "start_date": "2019-08-09T19:00+0000"
    },
    {
      "description": "EXPLIoT is a framework for security testing and exploiting IoT products and IoT infrastructure. Source code and documentation - https://gitlab.com/expliot_framework/expliot It provides a set of plugins (test cases) which are used to perform the assessment and can be extended easily with new ones. The name EXPLIoT (pronounced expl-aa-yo-tee) is a pun on the word exploit and explains the purpose of the framework i.e. IoT exploitation.  It can be used as a standalone tool for IoT security testing and more interestingly, it provides building blocks for writing new plugins/exploits and other IoT security assessment test cases with ease. EXPLIoT supports most IoT communication protocols, hardware interfacing functionality and test cases that can be used from within the framework to quickly map and exploit an IoT product or IoT Infrastructure. It will help the security community in writing quick IoT test cases and exploits.   Currently, the framework has support for analyzing and exploiting various IoT, radio and hardware protocols including BLE, CAN, DICOM, MQTT, Modbus, I2C, SPI, UART We have released a comprehensive documentation including User and Developer guide to help the security community kick start quickly and easily with the framework.",
      "id": 40026,
      "event_type": 40006,
      "title": "EXPLIoT - IoT Security Testing and Exploitation Framework",
      "includes": "",
      "link": "https://gitlab.com/expliot_framework/expliot",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40052,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T22:50+0000",
      "start_date": "2019-08-09T21:00+0000"
    },
    {
      "description": "Flatline is a deterministic hardware credential manager. It can generate passwords, burner accounts, shortlinks, and BIP39 seeds. Based on a single mnemonic seed, with Flatline it is possible to store millions of dollars in cryptocurrency, and shortlinks that map to sensitive or stolen data. Store a criminal empire in your head, maintain a map of leaked documents that are hosted on the internet while storing nothing on your local disk, or maintain access to your assets when your house burns down and you have to flee to eastern Europe.",
      "id": 40027,
      "event_type": 40006,
      "title": "Flatline",
      "includes": "",
      "link": "https://gitlab.com/e4st/flatline",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40053,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T20:50+0000",
      "start_date": "2019-08-09T19:00+0000"
    },
    {
      "description": "The Go Reverse Engineering Tool Kit (go-re.tk) is a new open-source toolset for analyzing Go binaries. The tool is designed to extract as much metadata as possible from stripped binaries to assist in both reverse engineering and malware analysis. For example, GoRE can detect the compiler version used, extract type information, and recover function information, including source code line numbers for functions and source tree structure.  The core library is written in Go, but the tool kit includes C-bindings and a library implementation in Python. When using the C-bindings or the Python library, it is possible to write plugins for other analysis tools such as IDA Pro and Ghidra. The toolset also includes “redress”, which is a command line tool to “dress” stripped Go binaries. It can both be used standalone to print out extracted information from the binary or as a radare2 plugin to reconstruct stripped symbols and type information.  The tool kit consists of: * Core library written in Go * C-bindings * Python library using the C-bindings * A command line tool for easy analysis",
      "id": 40028,
      "event_type": 40006,
      "title": "Go Reverse Engineering Tool Kit",
      "includes": "",
      "link": "https://github.com/goretk",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40055,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T18:50+0000",
      "start_date": "2019-08-10T17:00+0000"
    },
    {
      "description": "ATT&CK framework has become a benchmark in the security domain. ATT&CK provides data about each technique used across different attack stages. Hachi was created to contribute to the ATT&CK community. Hachi is based on the radare2 framework and uses data provided by ATT&CK to map the symptoms of malware on ATT&CK matrix.   Following modules of Hachi make this tool a great addition to an analyst’s or company’s armaments: • Threat Intel: Hachi provides threat intelligence data like a possible parent campaign or author of a malware file. • Malware behavior: It uncovers core malware behaviors using automated static analysis coupled with symbolic execution to explore multiple execution paths and maps it on ATT&CK matrix. • RESTful API: Hachi provides RESTful API which enables this tool to seamlessly integration with malware processing frameworks. • Visualization: It allows for the creation of detailed visual reports. • Integration with Threat Intel feeds: It can be integrated with different threat intelligence feeds for enhanced security or expanded insights.   The primary aim of this tool is to act as a force multiplier for the InfoSec community and aid the analysis of malware.",
      "id": 40029,
      "event_type": 40006,
      "title": "Hachi: An Intelligent threat mapper",
      "includes": "",
      "link": "https://github.com/Kart1keya/Hachi",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40055,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T18:50+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "Automated scanners won’t yield you bugs these days. They take tens of hours to get completed and with too with a high false rate. You need a minimal smart scanner with easy installation, easy configuration, and relatively high accuracy while hunting for bugs. This talk is focused on creating such a browser extension to yield better results in less time. The browser extension requires less manual effort and produces more accurate results in just a few seconds.",
      "id": 40030,
      "event_type": 40006,
      "title": "Browser extension to hunt low hanging fruits (Hacking by just browsing)",
      "includes": "",
      "link": "https://github.com/rewanth1997/vuln-headers-extension",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40050,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T22:50+0000",
      "start_date": "2019-08-09T21:00+0000"
    },
    {
      "description": "DNS is the control plane of the Internet with unprecedented detailed views on applications, devices and even transferred data going in and out of a network. 80% of malware uses DNS to communicate with Command & Control for DNS data exfiltration/infiltration and phishing attacks using lookalike domains. Response Policy Zones or DNS Firewall is a feature which allows us to apply security policies on DNS. Commercial DNS Firewall feeds providers usually do not allow user to generate their own feeds. Cloud only DNS service provides do not provide feeds for on-prem DNS. ioc2rpz is a DNS server which automatically creates, maintains and distributes DNS Firewall feeds from various local (files, DB) and remote (http, ftp, rpz) sources. This enables easy integrations with Threat Intel providers and Threat Intelligence Platforms. The feeds can be distributed to any open source and commercial DNS servers which support RPZ, e.g. ISC BIND, PowerDNS, Infoblox, BlueCat, Efficient IP etc. With ioc2rpz you can create your own feeds, actions and prevent undesired communications before they happen.",
      "id": 40031,
      "event_type": 40006,
      "title": "ioc2rpz",
      "includes": "",
      "link": "http://ioc2rpz.com",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40054,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T20:50+0000",
      "start_date": "2019-08-10T19:00+0000"
    },
    {
      "description": "Let’s Map Your Network (LMYN) aims to provide an easy to use interface to security engineer and network administrator to have their network in graphical form with zero manual error.  It is utmost important for any security engineer to understand their network first before securing it. In a mid to large level organisation’s network having a network architecture diagram doesn’t provide the complete understanding and manual verification is a nightmare. Hence in order to secure entire network it is important to have a complete picture of all the systems which are connected to your network, irrespective of their type, function, technology etc.  BOTTOM LINE - YOU CAN'T SECURE WHAT YOU ARE NOT AWARE OF.  LMYN does it in two phases: 1. Learning: In this phase LMYN 'learns' the network by performing the network commands and querying the APIs and then builds graph database leveraging the responses. User can perform any of the learning activities at any point of time and LMYN will incorporate the results in existing database. 2. Monitoring: This is a continuous process, where LMYN monitors the 'in-scope' network for any changes, compare it with existing information and update the graph database accordingly.",
      "id": 40032,
      "event_type": 40006,
      "title": "Let's Map Your Network",
      "includes": "",
      "link": "https://github.com/varchashva/LetsMapYourNetwork",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40054,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T22:50+0000",
      "start_date": "2019-08-09T21:00+0000"
    },
    {
      "description": "URL is the most commonly tracked piece of information, the innocent choice to structure a URL based on page content can make it easier to learn a users’ browsing history, address, health information or more sensitive details.  While you as a user normally browse the internet Local Sheriff works in the background and helps you identify what sensitive information(PII—Name, Date Of Birth, Email, Passwords, Passport number, Auth tokens.) is being shared/leaked to which all third-parties and by which all websites.  The issues that Local Sheriff helps identify: -       What sensitive information is being shared with whom? -       Which companies are own these third parties? -       What can they doing with this information? EG: de-anonymize users on the internet, create shadow profiles. -       Data points that can be used for tracking  a user across the web. -       Insights into which companies know what about you on the internet.  Local Sheriff can also be used by organizations to audit: -       Which all the third-parties that are being used on their websites. -       The third-parties on the websites are implemented in a way that respect user’s privacy and sensitive data is not being leaked to them.  Local Sheriff is a browser extension that can used with Chrome, Opera, Firefox, Brave, Cliqz.",
      "id": 40033,
      "event_type": 40006,
      "title": "Local Sheriff",
      "includes": "",
      "link": "https://github.com/cliqz-oss/local-sheriff/tree/master/scripts",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40052,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T20:50+0000",
      "start_date": "2019-08-10T19:00+0000"
    },
    {
      "description": "Memhunter is an endpoint sensor tool specialized in detecting memory-resident malware. The detection process is performed through a combination of endpoint data collection and memory inspection scanners. The tool is a standalone binary that, upon execution, deploys itself as a windows service. Once running as a service, memhunter starts the collection of ETW events that might indicate code injection attacks. The live stream of collected data events is feed into memory inspection scanners that use detection heuristics to down select the potential attacks. The entire detection process does not require human intervention, neither memory dumps, and it can be performed by the tool itself, at scale, improving the threat hunting analysis process and remediation times. The tool was designed as a replacement of memory forensic mechanisms such as volatility malfind and hollowfind plugins, which requires human analysis and memory dumps to find suspicious artifacts on memory. Besides the data collection and hunting heuristics, the project has also led to the creation of a companion tool called minjector that contains +20 code injection techniques. The minjector tool can be used to exercise memhunter detections, and as a one-stop learning solution on well-known code injection techniques out there.",
      "id": 40034,
      "event_type": 40006,
      "title": "Memhunter - Automated hunting of memory resident malware at scale",
      "includes": "",
      "link": "https://github.com/marcosd4h/memhunter",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40051,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T18:50+0000",
      "start_date": "2019-08-10T17:00+0000"
    },
    {
      "description": "An outsider has the capability to discover general information, such as which operating system a host is running, by searching for default stack parameters, ambiguities in IETF RFCs or non-compliant TCP/IP implementations in responses to malformed requests. By pinpointing the exact OS of a host, an attacker can launch an educated and precise attack against a target machine.  There are lot of reasons to hide your OS to the entire world:  Revealing your OS makes things easier to find and successfully run an exploit against any of your devices. Having and unpatched or antique OS version is not very convenient for your company prestige. Imagine that your company is a bank and some users notice that you are running an unpatched box. They won't trust you any longer! In addition, these kind of 'bad' news are always sent to the public opinion. Knowing your OS can also become more dangerous, because people can guess which applications are you running in that OS (data inference). For example if your system is a MS Windows, and you are running a database, it's highly likely that you are running MS-SQL. It could be convenient for other software companies, to offer you a new OS environment (because they know which you are running). And finally, privacy; nobody needs to know the systems you've got running. OSfooler was presented at Blackhat Arsenal 2013. It was built on NFQUEUE, an iptables/ip6tables target which delegate the decision on packets to a userspace. It transparently intercepted all traffic that your box was sending in order to camouflage and modify in real time the flags in TCP/IP packets that discover your system.  OSfooler-NG has been complete rewriten from the ground up, being highly portable, more efficient and combining all known techniques to detect and defeat at the same time:  Active remote OS fingerprinting: like Nmap Passive remote OS fingeprinting: like p0f v2 Commercial engines like Sourcefire’s FireSiGHT OS fingerprinting Some additional features are:  No need for kernel modification or patches Simple user interface and several logging features Transparent for users, internal process and services Detecting and defeating mode: active, passive & combined Will emulate any OS Capable of handling updated nmap and p0f v2 fingerprint database Undetectable for the attacker",
      "id": 40035,
      "event_type": 40006,
      "title": "OSfooler-NG: Next Generation of OS fingerprinting fooler",
      "includes": "",
      "link": "https://github.com/segofensiva/OSfooler-ng",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40051,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T22:50+0000",
      "start_date": "2019-08-09T21:00+0000"
    },
    {
      "description": "Today, organizations deal with the challenge of running their infrastructure across many networks and namespaces due to the use of cloud and hosting services, legacy environments and acquisitions. This can make it difficult for an organization to maintain visibility of its Internet-facing assets and an ability to track down systems that pose a risk to its security posture. The OWASP Amass Project has developed a tool to help information security professionals perform network mapping of attack surfaces and perform external asset discovery. During this talk, contributors to the project will discuss how OWASP Amass uses OSINT, network reconnaissance, graph databases and information sharing to provide both attackers and defenders better visibility of target organizations. Presenters will be providing an in-depth tour of all OWASP Amass features with tips and tricks shown along the way.",
      "id": 40036,
      "event_type": 40006,
      "title": "OWASP Amass",
      "includes": "",
      "link": "https://github.com/OWASP/Amass",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40054,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T22:50+0000",
      "start_date": "2019-08-10T21:00+0000"
    },
    {
      "description": "PcapXray is a Network Forensics tool that performs pcap visualization to help/speed up traffic investigation offline. [ in n00b terms, Draws a Network Map and Highlights what needs to be looked for in a packet capture. ] * Creates visual drawing (map) of a pcap file and highlights/extracts details for faster/robust traffic forensics/analysis * Reverse Engineer a Pcap [Packet Capture] File ( Wireshark always is the best goto ), PcapXray plays as a sidecar to speed things up with the investigation ( where/what to look at/for? ) * Promote navigation of a packet capture * Accomplish Simple goal In the best way ( I could not easily find an offline tool to draw/map/highlight a pcap file ) --> [ Just for Security Fun! ]  Capabilities include, * Converting a packet capture into a diagram/graph/visual representation * Segregating and filtering with respect to traffic type, the current list includes HTTP, HTTPS, Tor, Possible Malicious, ICMP, DNS * Extracting payload and present traffic on a session/flow basis * Enriching the traffic data with host scans to generate Reports * Identifying covert communication and possibility to extract files included in the traffic",
      "id": 40037,
      "event_type": 40006,
      "title": "PcapXray",
      "includes": "",
      "link": "https://github.com/Srinivas11789/PcapXray",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40054,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T20:50+0000",
      "start_date": "2019-08-09T19:00+0000"
    },
    {
      "description": "PCILeech and MemProcFS: The PCILeech direct memory access attack toolkit was presented at DEF CON 24 and quickly became popular amongst red teamers, governments and game cheaters alike. We will demonstrate how to take total control of still vulnerable systems with PCIe DMA code injection using affordable FPGA hardware and the open source PCILeech direct memory access attack toolkit.  MemProcFS - The Memory Process File System is memory forensics and analysis made super easy! Analyze memory by clicking on files in a virtual file system or by using the C and Python API. A wide range of memory acquisition methods are supported. Analyze memory dump files by point and click, analyze live memory acquired using PCILeech PCIe FPGA hardware devices or even live memory acquired in real time from remote hosts over the network. Zero-cost open source memory forensics and incident response?",
      "id": 40038,
      "event_type": 40006,
      "title": "PCILeech and MemProcFS",
      "includes": "",
      "link": "https://github.com/ufrisk/pcileech https://github.com/ufrisk/MemProcFS",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40053,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T20:50+0000",
      "start_date": "2019-08-10T19:00+0000"
    },
    {
      "description": "PhanTap (phantom tap) is an ‘invisible’ network tap aimed at red teams. With limited physical access to a target building, this tap can be installed inline between a network device and the corporate network. PhanTap is silent in the network and does not affect the victim’s traffic, even in networks having NAC (Network Access Control 802.1X - 2004). PhanTap will analyze traffic on the network and mask its traffic as the victim device.  It will mount a tunnel back to a remote server, giving the attacker a foothold in the  network for further exploitation and pivoting. The physical device for PhanTap is  currently a small, inexpensive and disposable router running OpenWrt, we've been testing  the GL.iNet GL-AR150. Moreover, PhanTap is fully based on Linux packages and can be ported  to any Linux distribution.",
      "id": 40039,
      "event_type": 40006,
      "title": "PhanTap (Phantom Tap)",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40054,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T18:50+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "Phishing Simulation tool mainly aims to increase phishing awareness & understanding by providing an intuitive tutorial and customized assessment to assess people's action on any given situation without performing actual phishing activity; and further gives analysis of what is the current awareness posture of targeted users. - The tool has below modules: - Tutorial -> To increase the awareness by providing an interactive and intuitive tutorial - Assessment -> To evaluate the current understanding and actions of user on any given situation - Setup Test -> This module let's any user to create the customized campaign and target multiple users at same time - Analysis -> Graphical representation to understand the current awareness posture",
      "id": 40040,
      "event_type": 40006,
      "title": "Phishing Simulation",
      "includes": "",
      "link": "https://github.com/jenyraval/Phishing-Simulation",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40055,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T20:50+0000",
      "start_date": "2019-08-09T19:00+0000"
    },
    {
      "description": "PivotSuite is a portable, platform independent and powerful network pivoting toolkit, Which helps Red Teamers / Penetration Testers to use a compromised system to move around inside a network. It is a Standalone Utility, Which can use as a Server or as a Client.   PivotSuite as a Server : If the compromised host is directly accessible (Forward Connection) from Our pentest machine, Then we can run pivotsuite as a server on compromised machine and access the different subnet hosts from our pentest machine, Which was only accessible from compromised machine.   PivotSuite as a Client : If the compromised host is behind a Firewall / NAT and isn't directly accessible from our pentest machine, Then we can run pivotsuite as a server on pentest machine and pivotsuite as a client on compromised machine for creating a reverse tunnel (Reverse Connection). Using this we can reach different subnet hosts from our pentest machine, which was only accessible from compromised machine.",
      "id": 40041,
      "event_type": 40006,
      "title": "PivotSuite: Hack The Hidden Network - A Network Pivoting Toolkit",
      "includes": "",
      "link": "https://github.com/RedTeamOperations/PivotSuite",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40052,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T22:50+0000",
      "start_date": "2019-08-10T21:00+0000"
    },
    {
      "description": "QiLing, a cross platform and multi architecture binary emulator, it will also able to do the follwings :     To execute binary applications for (Windows, Mac, Linux, Android, iOS, etc) and CPU architectures (Intel, Arm, AArch64 and Mips). To be executed multiple platforms: Windows, MacOS, Linux, BSD. Sandbox analysis, so potential malicious activities are under control. Provide Python instrumentation framework, so users can build add-on plugins to customize runtime analysis. Analyze & report the code execution in friendly and fully customizable high-level format. Besides working as an independent tool, QiLing also provides plugins for disassemblers such as Ghidra & IDA Pro.    QiLing designed to be lightweight and pluginable emulator. To handle real binaries reasonably, it should be fast, and offer instrumentation capability for users to build customized analysis.     - Able to handle hardware emulation  - Dynamically patch binary during execution in order to redirecting execution flow to bypass non critical check.  - Handle full binary emulation, not just raw code without context. To achieve this, emulate some parts of OS (such as syscalls , system libraries and part of kernel).  - Enable user-customized analysis via a Python framework.     QiLing is a opensource project.",
      "id": 40042,
      "event_type": 40006,
      "title": "QiLing",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40051,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T18:50+0000",
      "start_date": "2019-08-11T17:00+0000"
    },
    {
      "description": "The ARM processor is the most prevalent processor in the world. ARM devices encompass mobile phones, network devices and appliances, and devices comprising what is now called the Internet of Things.  Before April 2019, the only professional tool available for Reverse Engineering ARM processors was IDA Pro. With the release of Ghidra by the National Security Agency (NSA) to the Open Source Community this April, a professional grade Reverse Engineering tool is now available for ARM.  This Demo Lab setup will include a Linux Host Laptop running Ubuntu Linux. The target system is an embedded Raspberry Pi ARM v8a running Ubuntu Linux Core.  This demonstration will consist of static Reverse Engineering a demonstration Banking Application daemon using Ghidra. Static analysis of the fictitious application with this tool should reveal areas prone to PLT/GOT infection. This analysis will focus on shared libraries prone to infection.  Next, an Injection / Hook program will perform Linux PTRACE Injection / Function Hooking on the Banking Application. The function hooking is based upon the results from the Ghidra analysis performed earlier. The hook function will send the user data back to our host using a method unknown to the developer of the Banking Application.",
      "id": 40043,
      "event_type": 40006,
      "title": "Reverse Engineering Embedded ARM with Ghidra",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40053,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T18:50+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "Adversaries need to have a wordlist or combination-generation tool while conducting password guessing attacks. To narrow the combination pool, researchers developed a method named ”mask attack” where the attacker needs to assume a password’s structure. Even if it narrows the combination pool significantly, it’s still too large to use for online attacks or offline attacks with low hardware resources.  In the real world, a password’s structure is an unknown value, just like the password itself. Even if we specify a password structure with masks, we are still brute forcing characters in the mask. When we analyzed Ashley Madison and Myspace wordlists, we saw that they are mostly consists of sequential alpha characters. Which means that there is a high probability that they are meaningful words. Our research shows that 30% of the Ashley Madison wordlist and 36% of Myspace wordlist contains meaningful English words.  Rhodiola tool is developed to narrow the combination pool by creating a personalized wordlist for target people. It finds interest areas of a given user by analyzing his/her tweets, and builds a personalized wordlist. Wordlist consists of most used nouns&proper nouns, paired nouns&proper nouns, cities and years related to detected proper nouns.",
      "id": 40044,
      "event_type": 40006,
      "title": "Rhodiola",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40055,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T18:50+0000",
      "start_date": "2019-08-11T17:00+0000"
    },
    {
      "description": "This presentation is focused around Shadow Workers, a tool that came out of our research on service workers. Service Workers are a new addition to modern browser and often used to extend offline capabilities to a website.  With this tool, we weaponized service workers to include the ability to implant a pseudo backdoor in the browser and ghost through a victim's browser session to sniff, manipulate, and even proxy data silently.   We'll demo the various persistence mechanisms our tool provides to keep service workers alive and demo how MITM can be done at the browser layer.",
      "id": 40045,
      "event_type": 40006,
      "title": "Shadow Workers: Backdooring with Service Workers",
      "includes": "",
      "link": "https://github.com/shadow-workers/shadow-workers",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40051,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T22:50+0000",
      "start_date": "2019-08-10T21:00+0000"
    },
    {
      "description": "Shellcode Compiler is a program that compiles C/C++ style code into a small, position-independent and NULL-free shellcode for Windows and Linux. It is possible to call any Windows API function or Linux syscall in a user-friendly way. The tool allows users to write custom shellcodes by providing an easy way to call functions or system calls. It does not have all the capabilities of a compiler, but it simplifies a lot the shellcode development process. There is no need to write assembler, it is only required to declare and call functions or system calls.  Under the hood there is, of course, a custom compiler which compiles C/C++ style code into ASM which is later assembled using Keystone framework. Before the tool presentation, we will go into a deep dive on the shellcode development process for both Windows and Linux (32 bits only to keep it short and simple).",
      "id": 40046,
      "event_type": 40006,
      "title": "Shellcode Compiler",
      "includes": "",
      "link": "https://github.com/NytroRST/ShellcodeCompiler",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40055,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T22:50+0000",
      "start_date": "2019-08-10T21:00+0000"
    },
    {
      "description": "SILENTTRINITY is an asynchronous post-exploitation agent powered by Python, IronPython, C# and .NET's DLR (Dynamic Language Runtime), it attempts to weaponize and demonstrate the flexibility that BYOI (Bring Your Own Interpreter) payloads have over traditional C# implants. What are BYOI payloads? Turns out by harnessing the sheer craziness of the .NET framework, you can embed entire interpreters inside of .NET languages allowing you to natively execute scripts written in third-party languages (like Python) on windows! Not only does this allow you to dynamically access all of the .NET API from a scripting language of your choosing, but it also allows you to still remain completely in memory and has a number of advantages over traditional C# payloads! Essentially, BYOI payloads allow you to have all the \"power\" of PowerShell, without going through PowerShell in anyway! Additionally, you can nest multiple interpreters within each other to perform what I've coined \"engine inception\"! If you're interested in bleeding-edge and out of the ordinary C#/.NET offensive trade-craft, this is the demo for you!",
      "id": 40047,
      "event_type": 40006,
      "title": "SILENTTRINITY",
      "includes": "",
      "link": "https://github.com/byt3bl33d3r/SILENTTRINITY",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40053,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T22:50+0000",
      "start_date": "2019-08-10T21:00+0000"
    },
    {
      "description": "Mobile app developers are increasingly using cloud services to implement features such as storage, push notifications, and user data analysis. Popular cloud service including AWS provides SDK and credential keys that allow mobile apps to authenticate and authorize cloud resources so that developers can implement features by calling APIs. However, we identify a vulnerability that those credential keys can be obtained by attackers.   Within this demo, we will present how to steal cloud credential keys with soFrida: a dynamic analysis tool, powered by Frida. With soFrida, security researchers or engineers can quickly collect Android APKs and analyze cloud vulnerabilities in Android apps, helping to prevent serious security incidents such as data leaks. We have discovered 2,700 potentially vulnerable mobile apps by using soFrida and currently collaborate with the cloud service provider to eliminate security vulnerabilities. Detailed statistics can be found on our website:https://sofrida.github.io",
      "id": 40048,
      "event_type": 40006,
      "title": "soFrida -  Dynamic Analysis Tool for Mobile Apps with Cloud Backend",
      "includes": "",
      "link": "https://sofrida.github.io",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40051,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T18:50+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "The Third Servile War was over. The slave army has been defeated, and the survivors are offered a pardon by their Roman captors. The only requirement was that they identify Spartacus, their leader (Kirk Douglas). Rather than give away his identity, however, they all begin to yell out \"I'm Spartacus!\"—thus preserving his anonymity by overwhelming the Romans with possibilities. (Spoiler alert: they all die as a result.)  \"Spartacus as a Service (SaaS)\" is an open-source proof-of-concept is introduced that facilitates these obfuscation techniques. This will allow for automatic obfuscation of a chosen identity on a small scale, and lessons learned from its usage will be discussed.  Current version at: https://github.com/derrumbe/Spartacus-as-a-Service Open-source tool written largely in Node.js under an MIT license OAuth is used for authentication and authorization Content is generated via a Markov chain using sources such as Jane Austen, political platforms, and Aaron Franklin’s book on BBQ Amazon Mechanical Turk may be used to circumvent captchas Note that this is not a tool that *prevents* targeted advertising — instead it seeks to dilute the value of information that companies know about a user. It obfuscates the real content so that outsiders cannot tell what the real content (or in some cases, who the person) actually is.",
      "id": 40049,
      "event_type": 40006,
      "title": "Spartacus as a Service (SaaS)",
      "includes": "",
      "link": "https://github.com/derrumbe/Spartacus-as-a-Service",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40052,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T20:50+0000",
      "start_date": "2019-08-09T19:00+0000"
    },
    {
      "description": "Srujan is a new type of network segregation system, based on Raspberry Pi, that can be easily deployed on home networks. It allows home users to segregate the devices connecting to their home networks based on the threat profile. User can keep their smart home devices separate from their computers and mobile devices to mitigate risk of cross infection from low-trust devices like smart cameras, speakers and thermostats.  Srujan was created to address the challenges around the plethora of IOT devices being deployed in smart homes that are vulnerable and do not receive patches. Srujan can intelligently segregate the home network into different zones based on the device type. It automatically identifies and alerts users when the IOT devices attempt to contact any IP or domain which has been blacklisted by Google Safe Browsing.   Srujan provides the following features: -- Intelligent segregation of devices based on their type -- Ability to create network usage stats for each device -- Ability to quarantine untrusted devices -- Easy to integrate with SIEM -- Ability to lookup IP/Domain against Google Safe Browsing. -- Integration with ANWI (All New Wireless IDS) -- Prevent call-home pings to manufacturer for enhanced privacy.",
      "id": 40050,
      "event_type": 40006,
      "title": "Srujan: Safer Networks for Smart Homes",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40053,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T18:50+0000",
      "start_date": "2019-08-10T17:00+0000"
    },
    {
      "description": "TaintedLove is a dynamic security analysis tool for Ruby. It leverages Ruby's object tainting and monkey patching features to identify potentially vulnerable code paths at runtime. TaintedLove is library agnostic and provides a simple framework to extend the detection of unsafe method usage and user input tracking.",
      "id": 40051,
      "event_type": 40006,
      "title": "TaintedLove",
      "includes": "",
      "link": "https://github.com/shopify/tainted_love",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40051,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T20:50+0000",
      "start_date": "2019-08-09T19:00+0000"
    },
    {
      "description": "USB-Bootkit, a new type of Bootkit via the USB interface, contains malicious code inside the USB device that gets executed every time the system boots up. The malicious device, located either on the motherboard or inside external HID devices such as the keyboard, is invisible to ordinary users and capable to re-infect the system after the OS getting reinstalled, the hard drive being formatted or even replaced.     In order to make it looks innocuous, we implanted the USB-Bootkit inside a keyboard without changing the outward appearance. Supply chain attacks could be leveraged to replace the device and modify boot sequences accordingly. Once it is used by the target, we are able to carry out attacks persistently. Legacy and UEFI mode are covered in one USB to adapt the target system automatically. In the demonstration, the attack originates from the malicious keyboard and is able to compromise the full patched Windows 10 x64 operating system since power-on. The USB-Bootkit will get disconnected automatically afterwards to avoid being discovered when the victim logs into the operating system.",
      "id": 40052,
      "event_type": 40006,
      "title": "USB-Bootkit - New Bookit via USB Interface in Supply Chain Attacks",
      "includes": "",
      "link": "https://github.com/RedDrip7/USB-Bootkit",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40053,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T18:50+0000",
      "start_date": "2019-08-11T17:00+0000"
    },
    {
      "description": "Vulmap is an open source online local vulnerability scanner project. It consists of online local vulnerability scanning scripts for Windows and Linux. These scripts can be used for defensive and offensive purposes. It is possible to conduct vulnerability assessments by using these scripts. Also they can be used for privilege escalation by pentesters/red teamers.  Vulmap scans vulnerabilities on localhost, shows related exploits and downloads them. It basically, scan localhost to gather installed software information and ask Vulmon API if there are any vulnerabilities and exploits related with installed software. If any vulnerability exists, Vulmap shows CVE ID, risk score, vulnerability's detail link, exploit ids and exploit titles. Exploits can be downloaded with Vulmap also.  Main idea of Vulmap is getting real-time vulnerability data from Vulmon instead of relying of a local vulnerability database. Even the most recent vulnerabilities can be detected with this approach. Also its exploit download feature helps privilege escalation process.  Since most Linux installations have Python, Vulmap Linux is developed with Python while Vulmap Windows is developed with PowerShell to make it easy to run it on most Windows versions without any installation.",
      "id": 40053,
      "event_type": 40006,
      "title": "Vulmap: Online Local Vulnerability Scanners Project",
      "includes": "",
      "link": "https://github.com/vulmon/Vulmap",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40052,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T18:50+0000",
      "start_date": "2019-08-11T17:00+0000"
    },
    {
      "description": "This tool is the culmination of lessoned learned during the last 3 years of wireless monitoring at DEF CON using tools like the #WiFiCactus. This demo will show you the software and hardware needed to build a robust wireless monitoring sensor network that is capable of capturing everything up to 802.11ac including Bluetooth. This demo will include a distributed capture network that will take captured data from multiple nodes and send it back to a single capture server. This project will show you how to use advanced features of Kismet Wireless to increase the amount of data you capture. Wireless threats and attacker tactics will be discussed and identified as they happen in the environment. Data analytic techniques will be demonstrated and discussed using tools like Wireshark, NetworkMiner and PCAPinator.",
      "id": 40054,
      "event_type": 40006,
      "title": "WiFi Kraken - Scalable Wireless Monitoring",
      "includes": "",
      "link": "http://palshack.org/def-con-27-demolab/",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40050,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T18:50+0000",
      "start_date": "2019-08-10T17:00+0000"
    },
    {
      "description": "Do you feel safe in your home with the security system armed? You may reconsider after watching a demo of our new hacking toolkit, ZigDiggity, where we target door & window sensors using an \"ACK Attack\". ZigDiggity will emerge as the weapon of choice for testing Zigbee-enabled systems, replacing all previous efforts.  Zigbee continues to grow in popularity as a method for providing simple wireless communication between devices (i.e. low power/traffic, short distance), & can be found in a variety of consumer products that range from smart home automation to healthcare.   Unfortunately, existing Zigbee hacking solutions have fallen into disrepair, having barely been maintained, let alone improved upon. Left without a practical way to evaluate the security of Zigbee networks, we've created ZigDiggity, a new open-source pentest arsenal from Bishop Fox.  Updates include migration to better hardware for testing (e.g. SDRs), and a slew of newly implemented Zigbee attacks types.  Our DEMO-rich presentation showcases ZigDiggity's attack capabilities by pitting it against common Internet of Things (IoT) products that use Zigbee. Come experience the future of Zigbee hacking, in a talk that the New York Times will be hailing as \"a veritable triumph of the human spirit.\" ... ya know, probably",
      "id": 40055,
      "event_type": 40006,
      "title": "Zigbee Hacking:  Smarter Home Invasion with ZigDiggity",
      "includes": "",
      "link": "https://github.com/BishopFox/zigdiggity",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40054,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T18:50+0000",
      "start_date": "2019-08-11T17:00+0000"
    },
    {
      "description": "An organization using micro services or any other distributed architecture rely heavily on containers and orchestration engines like Kubernetes and as such its infrastructure security is paramount to its business operations. This workshop will focus on how attackers can break into docker container and Kubernetes clusters to gain access, escalate privileges to infrastructure by using misconfigurations and application security vulnerabilities. Trainer will share examples of real world security issues found in penetration testing engagements to showcase mapping of the attack usually happens in the real world.\n\nBy the end of the workshop participants will able to identify and exploit vulnerabilities in applications running on containers inside Kubernetes clusters. The key take away for audience will be learning from these scenarios how they can assess their environments and fix them before attackers gain control over their infrastructure.\n\nBy the end of workshop participants will be able to:\nUnderstand Docker and Kubernetes security architecture\nAttack & Audit containerised infrastructure for security vulnerabilities and misconfigurations\nLearning from these scenarios how they can assess their environments and fix them before attackers gain control over their modern infrastructure\nLearn commonly used tools, techniques and procedures (TTPs) for cloud native infrastructure\nThe participants will get the following:\nEbooks of the training covering all hands-on in a step by step guide (HTML, PDF, EPub, Mobi)\nVirtual machines to learn & practice scenarios covered in the workshop\nOther references to learn more about topics covered in the workshop",
      "id": 40056,
      "event_type": 40001,
      "title": "Breaking and Pwning Docker Containers and Kubernetes Clusters",
      "includes": "",
      "link": "https://www.eventbrite.com/e/rapid-iot-hacking-101-valley-of-fire-ii-tickets-63998539354",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": null,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T01:30+0000",
      "start_date": "2019-08-09T21:30+0000"
    },
    {
      "description": "It's 2019 and yet too many Windows developers and hackers alike rely on (useful but rather) old school tools for debugging Windows binaries (OllyDbg, Immunity Debugger). What they don't realize is that they are missing out on invaluable tools and functionalities that come with Microsoft newest WinDbg Preview edition. This hands-on workshop will attempt to level the field, by practically showing how WinDbg has changed to a point where it should be the first tool to be installed on any Windows (10) for binary analysis machine: after a brief intro to the most basic (legacy) commands, this workshop will focus around debugging modern software (vulnerability exploitation, malware reversing, DKOM-based rootkit, JS engine) using modern techniques provided by WinDbg Preview (spoiler alert to name a few, JavaScript, LINQ, TTD). By the end of this workshop, trainees will have their WinDbg-fu skilled up.",
      "id": 40057,
      "event_type": 40001,
      "title": "Modern Debugging^HWarfare with WinDbg Preview",
      "includes": "",
      "link": "https://www.eventbrite.com/e/modern-debugginghwarfare-with-windbg-preview-lake-mead-ii-tickets-63998510267",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40010,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T01:30+0000",
      "start_date": "2019-08-10T21:30+0000"
    },
    {
      "description": "In this workshop, participants will be informed about attacks and defense of the wireless networks. Attendees will learn how to attack and gain access to WPA2-PSK and WPA2-Enterprise wifi networks, bypass network access controls, and gain administrative control over an Active Directory environment.\n\nIn addition, Attendees will learn to fight against WiFi Pineapple, KARMA attack and fake access point opening techniques and will develop tools with Scapy. At the end of all this will be an award-winning CTF :)\n\nAreas of focus include:\nBasically communication for wifi networks\nUnderstanding how monitor mode works\nCollect WiFi data\nGain access to WPA2-PSK and WPA2-Enterprise networks\nHow can we fight against wifi hackers?\nHow can I improve the WiFi hacking tool?\nCTF",
      "id": 40058,
      "event_type": 40001,
      "title": "Advanced Wireless Exploitation for Red Team and Blue Team",
      "includes": "",
      "link": "https://www.eventbrite.com/e/advanced-wireless-exploitation-for-red-team-and-blue-team-red-rock-ii-tickets-63606797644",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40011,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T01:30+0000",
      "start_date": "2019-08-08T21:30+0000"
    },
    {
      "description": "Serverless Technology (Functions as a Service) is fast becoming the next \"big thing\" in the world of distributed applications. Especially with widespread support from cloud vendors, this technology is going to only become more influential. However, like everything else, Serverless apps are subject to a a wide variety of attack possibilities, ranging from attacks against access control tech like Function Event Injection, JWTs, to NoSQL Injection, to exploits against the apps themselves (deserialization, etc) escalating privileges to other cloud components.\n\nThis workshop is replete with hands-on labs and presents a red-team perspective of the various ways in which testers can discover and exploit serverless applications to compromise sensitive information, and gain a deeper foothold into cloud database services, IAM services and other other cloud components. The workshop also features real-world serverless implementations, specifically to highlight the lack of frameworks, tooling and security mechanisms that makes life much harder for developers to implement, therefore, easier for attackers to compromise",
      "id": 40059,
      "event_type": 40001,
      "title": "Pwning Serverless Applications",
      "includes": "",
      "link": "https://www.eventbrite.com/e/pwning-serverless-applications-red-rock-v-tickets-63606059436",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40012,
      "conference": "DEFCON27",
      "end_date": "2019-08-08T21:00+0000",
      "start_date": "2019-08-08T17:00+0000"
    },
    {
      "description": "Practice finding flaws in real Android apps in this fun, CTF-style hands-on workshop, and you will be ready to avoid making security errors in your own apps.\n\nAndroid apps are very easy to unpack, analyze, modify, and repack; partly because of the open nature of the system, and partly because most companies neglect basic security measures. In this workshop, participants will hack apps from Wells Fargo, Microsoft, Lyft, WhatsApp, Whole Foods, IBM, Harvard, Progressive, the Indian government, and other large organizations. We will find insecure network transmissions, broken cryptography, improper logging, and pervasive lack of binary protections. We will also analyze the way iOS apps use network transmissions, and observe serious vulnerabilities in iOS apps from major companies.\n\nWe will analyze Android internals in details, using the Drozer attack framework to inspect and manipulate intents to exploit insecure activities and content providers. We will perform a protection level downgrade attack on an Android 4.3 device, removing security protections from the Twitter app.\n\nAll class materials are freely available on the Web, and will remain available after the workshop. All vulnerabilities were reported to the affected companies long ago, where appropriate.\n\nEquipment: participants must bring a laptop that can run VirtualBox machines. The host system can use Mac OS (best), Linux (OK) or Windows (usable but limited). We will use free Android emulators and a Kali virtual machine. They will be available as free downloads, and also\nlocally on USB sticks.",
      "id": 40060,
      "event_type": 40001,
      "title": "Reverse Engineering Android Apps",
      "includes": "",
      "link": "https://www.eventbrite.com/e/reverse-engineering-android-apps-red-rock-iii-tickets-63609248976",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40013,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T01:30+0000",
      "start_date": "2019-08-09T21:30+0000"
    },
    {
      "description": "Practice red and blue team skills in this fun, CTF-style workshop. Attendees will configure free Linux servers in the Google cloud to detect intrusions using Suricata, log files, and Splunk, and attack them with a Linux cloud server using Metasploit, Ruby, and Python scripts. They will also use Splunk to analyze ransomware and brute-force attacks and perform attribution, using archived event data from a realistic multi-server Windows corporate domain.\n\nAll workshop materials are freely available on the Web, and will remain available after the workshop. All required software and cloud resources are free to use.",
      "id": 40061,
      "event_type": 40001,
      "title": "Purple Team CTF",
      "includes": "",
      "link": "https://www.eventbrite.com/e/purple-team-ctf-red-rock-iii-tickets-63606850803",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40014,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T01:30+0000",
      "start_date": "2019-08-08T21:30+0000"
    },
    {
      "description": "Learn how to take control of Windows and Linux servers running vulnerable software, in a hands-on CTF-style workshop. We begin with easy command injections and SQL injections, and proceed through binary exploits incuding buffer overflows on the stack and the heap, format string vulnerabilities, and race conditions.\n\nAfter this workshop, you will understand how memory is used by software, and why computers are so easily tricked into executing bytes as code that entered the system as data.\n\nWe will exploit 32-bit and 64-bit Intel systems, and also ARM-based systems. We will examine modern Windows defenses in detail and learn how to defeat them, including ASLR, DEP, stack cookies, and SEHOP.\n\nPrevious experience with C and assembly language is helpful but not required. Participants will need a laptop that can run VMware or VirtualBox virtual machines.\n\nAll materials and challenges are freely available at samsclass.info, and will remain available after the workshop ends.",
      "id": 40062,
      "event_type": 40001,
      "title": "Exploit Development for Beginners",
      "includes": "",
      "link": "https://www.eventbrite.com/e/exploit-development-for-beginners-red-rock-vii-tickets-63608704347",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40015,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T21:00+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "Weaponized carrier files, such as PDF and Office docs, are used in various attack campaigns in order to compromise victims. In this workshop, we'll cover the file formats, associated weaponization methods, and analysis techniques of the attack code used with these types of files. We'll pull apart PDF object streams, deobfuscate JavaScript code, and analyze PDf-based attacks. For Office docs, we'll review the OLE file format; take a gander at VBA-based macros; extract, deobufscate, and debug the VBA code; and identify indicators of compromise. We'll be using a Windows-based malware VM along with tools such as oledump, PDFStreamDumper, the MS VBA Editor, and more!",
      "id": 40063,
      "event_type": 40001,
      "title": "Understanding and Analyzing Weaponized Carrier Files",
      "includes": "",
      "link": "https://www.eventbrite.com/e/understanding-and-analyzing-weaponized-carrier-files-red-rock-iii-tickets-63608133640",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40014,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T21:00+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "Using cryptography is often a subtle practice and mistakes can result in significant vulnerabilities. This workshop will cover many of these vulnerabilities which have shown up in the real world. This will be a hands-on workshop where you will implement the attacks after each one is explained. I will provide a VM with Python dependencies and skeleton code included so you can focus on implementing the attack. A good way to determine if this workshop is for you is to look at the challenges at cryptopals.com and see if those look interesting, but you could use in person help understanding the attacks. While not a strict subset of those challenges, there is significant overlap.",
      "id": 40064,
      "event_type": 40001,
      "title": "Introduction to Cryptographic Attacks",
      "includes": "",
      "link": "https://www.eventbrite.com/e/introduction-to-cryptographic-attacks-red-rock-viii-tickets-63607132646",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40016,
      "conference": "DEFCON27",
      "end_date": "2019-08-08T21:00+0000",
      "start_date": "2019-08-08T17:00+0000"
    },
    {
      "description": "Want to learn about exploit development but feeling overwhelmed at all the latest technologies and buzzwords?\n\nHack to basics is a course which will provide you with foundational level exploit development skills with real world exploitation techniques. This will range from \"Vanilla\" EIP overwrites through to Structured Exception Handler(SEH) exploitation and how egg hunters work with practical examples.\n\nBy the end of the course, Students can expect to know the basics of x86 assembly, including some real world examples of exploiting vanilla EIP overwrites, SEH exploitation and using egg hunters. This will provide an entry to the world of exploit development and a strong foundation to work off in order to make it easier to transition to the newer, more advanced technologies which are in place today.\n\nTo get the most out of this training, the following should be studied beforehand:\n\nFuzzySecurity:\n\nhttp://www.fuzzysecurity.com/tutorials/expDev/1.html\nhttp://www.fuzzysecurity.com/tutorials/expDev/2.html\nhttp://www.fuzzysecurity.com/tutorials/expDev/3.html\nhttp://www.fuzzysecurity.com/tutorials/expDev/4.html\n\nCorelan:\n\nhttps://www.corelan.be/index.php/2009/07/19/exploit-writing-tutorial-part-1-stack-based-overflows/\nhttps://www.corelan.be/index.php/2009/07/23/writing-buffer-overflow-exploits-a-quick-and-basic-tutorial-part-2/\nhttps://www.corelan.be/index.php/2009/07/25/writing-buffer-overflow-exploits-a-quick-and-basic-tutorial-part-3-seh/\n\nWe will be using Python to construct our exploits, combined with a debugger such as Immunity or OllyDBG, it it is recommended to be familiar with both.",
      "id": 40065,
      "event_type": 40001,
      "title": "Hack to Basics - x86 Windows Based Buffer Overflows, an introduction to buffer overflows.",
      "includes": "",
      "link": "https://www.eventbrite.com/e/hack-to-basics-x86-windows-based-buffer-overflows-an-introduction-to-buffer-overflows-valley-of-tickets-63998523306",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40017,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T01:30+0000",
      "start_date": "2019-08-10T21:30+0000"
    },
    {
      "description": "The use of remote-access malware has never been more prevalent, and in order to replicate or mitigate this threat, an understanding as to how the infrastructure supporting such an attack operates is crucial. From accounting for \noutbound network filtering controls, to building resilience with redundant inbound proxies, deploying an implant blindly into a target is more complex than 'msf > exploit'.\n\nThis workshop aims to build an understanding around how malware Command and Control (C2) infrastructure is designed, built, and configured, and to provide attendees with experience in deploying malware within a realistic network environment. This will include:\n\n- A run-through of a basic red team campaign\n- The properties of a solid malware implant\n- Spinning-up Command and Control (C2) infrastructure, including burner inbound proxies, etc.\n- Configuring an implant to find and utilise outbound routes from a realistic corporate network, and to call back to our new infrastructure\n- Basic delivery of malware via common delivery routes\n- Gaining a persistent presence, and identifying routes to the campaign objectives\n\nWe will be using Meterpreter and the Metasploit framework as the implant supported by Kali Linux, alongside Apache as a reverse proxy; all of which will be cloud-hosted. We will be using a variety of post-exploitation techniques to help attendees get to grips with some of the potential nuances of remote malware interaction (long RTTs, blind command execution, etc.).\n\nReading list:\n\nhttps://www.lockheedmartin.com/content/dam/lockheed-martin/rms/documents/cyber/Gaining_the_Advantage_Cyber_Kill_Chain.pdf\nhttps://ionize.com.au/reverse-https-meterpreter-and-empire-behind-nginx/\nhttps://medium.com/@truekonrads/reverse-https-meterpreter-behind-apache-or-any-other-reverse-ssl-proxy-e898f9dfff54",
      "id": 40066,
      "event_type": 40001,
      "title": "An Introduction to Deploying Red Team Infrastructure",
      "includes": "",
      "link": "https://www.eventbrite.com/e/an-introduction-to-deploying-red-team-infrastructure-red-rock-i-tickets-63439433052",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40018,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T01:30+0000",
      "start_date": "2019-08-08T21:30+0000"
    },
    {
      "description": "Wireless Networks (Wifi) are the most used type of network nowadays and most people don't know really how vulnerable they are, even WPA/WPA2 Enterprise.\n\nIn this workshop we will cover most wifi encryptions being used today, how they work behind the scenes and the theory of the cracking process. Also, you will be able to apply this knowledge on the spot with some real-life-scenario wifi networks.\n\nSome encryptions are mathematically difficult to crack, where the cracking process could take lifetimes. But not to worry, there still are ways to get around this with an attack called Man-in-the-middle (MITM). Be wary! You never know to whom's Internet Access Point you're connecting and who's eavesdropping on you.\n\nEver wondered how to get somebody's passwords of a website? After this workshop you will be able to supplant a website without the victim ever knowing it with Wifiphishing or DNS Spoofing the client's router.\n\n\nWhat to know before\nLinux commands (sed, awk, grep and the basic ones)\nBasic shell scripting \nBasic knowledge about WEP/WPA/WPA2/WPS\n\nWhat you will learn \nHow wifi security works\nHow to audit a wireless network \nHow to perform and automate Wifi attacks (WEP/WPA/WPA2 (personal & enterprise)/WPS)\nHow to use the cloud to crack passwords (GpuHash.me, AWS EC2) \nHow to use your own GPU to crack passwords. (in case you have one)\n\nHow technical is the class\n40% theory and concepts\n60% writing and testing commands/scripts and attacking wifis. \n\nWhat tools are we going to use \naircrack-ng (ifconfig, iwconfig, airmon-ng, airodump-ng, aireplay-ng, aircrack-ng, airbase-ng, airdecap-ng)\nReaver (reaver, wash)\nRadius Servers (radiusd)\nPyrit\ntshark/Wireshark/tcpdump\nEttercap\n\nWhat to read in advance \nVivek Ramachandran & Cameron Buchanan, 2015, Kali Linux Wireless Penetration Testing Beginner's Guide, Birmingham B3 2PB, United Kingdom.",
      "id": 40067,
      "event_type": 40001,
      "title": "Hacking Wifi",
      "includes": "",
      "link": "https://www.eventbrite.com/e/hacking-wifi-red-rock-viii-tickets-63607346285",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40016,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T01:30+0000",
      "start_date": "2019-08-08T21:30+0000"
    },
    {
      "description": "Layer 2 can be a lesser-known attack surface; the techniques have been known for a while, have well-documented mitigations, and are often thought of as so old, they _can't possibly still be around, right?_ \n\nBut this under-represented attack surface is also of great value to an attacker. Network segregation on a typical internal network is commonplace, and often heavily relied upon to segregate, isolate, and limit the spread of a compromise. A misconfigured switch or switch port can be the difference between an attacker compromising the desk phones, and core business server infrastructure. And when the misconfiguration can be a single two-word line in a ten-thousand line switch configuration file, it's easy to see how the basic hardening controls can be missed.\n\nThis workshop will run through analysing Layer 2 network traffic, identifying protocols and information of interest within network traffic, launching DTP attacks to pivot within a misconfigured network, and man-in-the-middling traffic via this pivot to compromise a target host (including using various tools in conjunction with virtual network interfaces). In terms of tooling, we will be looking to utilise the likes of Wireshark, Yersinia and Bettercap to launch the various network attacks, with standard Kali tooling/normal Linux functionality to exploit and escalate privileges on the target host. \n\nReading list (not required, but can be of interest):\n\nhttps://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipaddr_arp/configuration/15-mt/arp-15-mt-book/arp-config-arp.html\nhttps://www.cisco.com/c/en/us/td/docs/switches/lan/catalyst2960/software/release/12-2_53_se/configuration/guide/2960scg/swvlan.html\nhttps://www.computernetworkingnotes.com/ccna-study-guide/vlan-tagging-explained-with-dtp-protocol.html\nhttps://www.blackhat.com/presentations/bh-usa-02/bh-us-02-convery-switches.pdf\nhttps://digi.ninja/blog/abusing_dtp.php",
      "id": 40068,
      "event_type": 40001,
      "title": "Attacking Layer 2 Network Protocols",
      "includes": "",
      "link": "https://www.eventbrite.com/e/attacking-layer-2-network-protocols-red-rock-i-tickets-63439506271",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40018,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T01:30+0000",
      "start_date": "2019-08-09T21:30+0000"
    },
    {
      "description": "This is an introduction to functional programming concepts. It's not an intro to a language or a tool, but to a set of ideas. It's a powerful one for any hacker to learn, but especially for blue teamers who find themselves writing or maintaining increasingly complex code. Practicing it can help defenders write safer code that scales well.\n\nWhy speak particularly toward blue team? \n\nDefenders are often unsung heros today. Blue teamers, like system admins, may find themselves writing code to glue things together, fill in the gaps between existing tools, or make up for lack of tools altogether. If your codebase evolves into a critical system, the work of managing its rising complexity can become a serious challenge. Defense is hard, and studying the esoterics of software architecture can be a rare luxury (or an exercise in frustration, depending on your situation.) This workshop aims to hand you the distilled, demystified truth, sans the cryptic terminology. We will collectively build some code that illustrates the philosophy of the functional paradigm, and has a good chance of being useful in your work.\n\nWhy functional programming? \n\nThis is a paradigm from the days of Lisp and the original generation of MIT hackers. After decades of obscurity, it is moving into the mainstream because it answers two serious problems particularly well: rising code complexity, and the need to support parallelism. Any parts of it that you take away from this workshop are likely to improve your quality of life as a software engineer.\n\nFor this workshop, we will choose two programming languages to work with: one for comfort, and one for stretching. Python will be the comfort language, because of its widespread use in many fields. Haskell will be the stretch language, and no one is expected to try it if they're not comfortable. What we want is for you to get a sense of how the functional approach looks, not just in a mainstream language like Python, but also in a language built especially with the functional style in mind.",
      "id": 40069,
      "event_type": 40001,
      "title": "Functional Programming for the Blue Team",
      "includes": "",
      "link": "https://www.eventbrite.com/e/functional-programming-for-the-blue-team-valley-of-fire-ii-tickets-63998222406",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40019,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T21:00+0000",
      "start_date": "2019-08-10T17:00+0000"
    },
    {
      "description": "r2c is writing and helping others write tools to exploit and eradicate entire vulnerability classes at scale. In this workshop, we'll show how to develop program analysis tools that can be depended on in analysis pipelines and quickly run at massive scale. If you've ever wondered \"but surely, no programmer would upload something that does that do NPM\" this is the place to be! Our command line tool for local analyzer development is freely available and publicly documented&mdash;we'll show you how to get started and invite you to collaborate with us on to build pipelines that use pre-computed intermediary representations that we already have. We'll also show how to use our collaborative triage tools with impact prioritization that can quickly allow turning these analysis results into bug-bounty submissions. No program (static/dynamic) analysis background required (though it is helpful!) Motivated developers should be able to make at least one bug bounty submission by the end of the workshop.",
      "id": 40070,
      "event_type": 40001,
      "title": "Finding Vulnerabilities at Ecosystem-Scale",
      "includes": "",
      "link": "https://www.eventbrite.com/e/finding-vulnerabilities-at-ecosystem-scale-red-rock-iv-tickets-63608247982",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40013,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T21:00+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "Malspam with an attached malicious document has now become the standard delivery vector for most criminal malware. In order to evade detection it is not uncommon for these malicious documents to execute a long chain of scripts involving macros, Javascript, and PowerShell before downloading the final payload. As a result incident responders and malware analysts need to be comfortable analyzing different document formats, and script languages to make sense of these delivery chains.\n\nIn this workshop you will work through the triage of a live malware delivery chain that includes a malicious document, malicious scripts, and a final malware payload. During this process you will be exposed to different document formats, and malscripts while you practice the skills required to manually analyze these delivery chains. This workshop focuses on the fundamental analysis techniques used when identifying, deobfuscating, and analyzing maldocs and malscripts. However, we will also provide an introduction to some free and open source tools that can be used to speed up the analysis process. \n\nThis workshop is aimed at junior incident responders, hobby malware analysts, and general security or IT practitioners who are interested in learning more about the malware triage process. If you have no experience with malware analysis but you have a good understanding of scripting languages like VBScript, and Javascript, and you are familiar with windows internals you should have no problem completing the workshop. \n\nYou will be provided with a VirtualMachine to use during the workshop, please make sure to bring a laptop that meets the following requirements. Your laptop must have VirtualBox or VMWare installed and working prior to the start of the course. Your laptop must have at least 60GB of disk space free, preferably 100GB. Your laptop must also be able to mount USB storage devices. Make sure you have the appropriate dongle if you need one.",
      "id": 40071,
      "event_type": 40001,
      "title": "Malware Triage - Analyzing The Modern Malware Delivery Chain",
      "includes": "",
      "link": "https://www.eventbrite.com/e/malware-triage-analyzing-the-modern-malware-delivery-chain-red-rock-ii-tickets-63609242958",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40011,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T21:00+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "MacOS has a strong reputation for security and comes with many restrictions such as the usage of an App Store to prevent malicious code being installed. However, we have found that since MacOS is the minority platform for many software packages and security platforms, it rarely gets the same attention from security vendors as Windows. This workshop will teach you to exploit that lack of attention from software like Microsoft Office and security platforms like a leading EDR solution to break in and out of a MacOS estate. The principles also apply to other *nix environments like Linux.\n\nWe will walk you through how to use open source tools, both unmodified and customized, can be used to take advantage of the difference in capability, e.g., script detection, between Windows and non-Windows platforms. We will show you how to map out an environment, how to gain code execution in multiple ways, grab credentials, find files, collect screenshots and webcam shots and exfiltrate the loot while remaining undetected.\n\nThe key takeaway is that despite the myriad of operating system security features present in MacOS and Linux, and the addition of EDR, protected MacOS or Linux environments can still be compromised by a diligent attacker using open source tooling. This workshop will show you how!\n\n[Unfortunately we cannot provide an EDR system for you to play with, so please bring your own or practice the techniques without that particular opponent.]",
      "id": 40072,
      "event_type": 40001,
      "title": "Mind the Gap Between Attacking Windows and Mac: Breaking In and Out of Protected MacOS environments",
      "includes": "",
      "link": "https://www.eventbrite.com/e/mind-the-gap-between-attacking-windows-and-mac-breaking-in-and-out-of-protected-macos-environments-tickets-63608046379",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40020,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T21:00+0000",
      "start_date": "2019-08-10T17:00+0000"
    },
    {
      "description": "Wi-Fi attack capability is an important part of any hacker's toolbox. Wi-Fi extends the perimeter of a supposedly-secure network to sidewalks, parking lots, and trendy coffee shops. But many hackers don't know how Wi-Fi is simultaneously both easy and difficult to attack. To understand this duality, hackers must get hands-on time attacking all kinds of networks. You really need to see both success and failure, both self-inflicted and environmental, to fully understand how to compromise Wi-Fi networks.\n\n\nThis workshop isn't targeted at Faraday-level attendees. We assume that you know what a laptop and Wi-Fi is and continue from there. What you'll be doing in this workshop is:\n\n\n0. Determining your desired result of the attack\n\n1. Reconnoitering Wi-Fi networks and RF spectrum\n\n2. Identifying and prioritizing network and station targets\n\n3. Determining the best attack type for identified targets\n\n4. Hacking the bejeezus out of the target while avoiding detection\n\n\nYou'll do all of these amazing things with your laptop and Kali Linux. Kali has an exceptional set of Wi-Fi hacking tools built right in that you'll become much more familiar with during this session. You'll use a variety of tools to identify networks and connected stations, conduct broadcast denial of service attacks, capture authentication handshakes, and crack session keys.\n\n\nPip and Alex will demonstrate some techniques using different hardware like spectrum analyzers and noise generators so you can decide whether those are tools you want to add to your toolbox as well. However, none of those tools are necessary for the workshop, and many hackers never need anything beyond a laptop, Kali, a good wordlist, and practice.\n\n\nWe'll tweet any last minute workshop updates or preparation steps from @alexhammeratt.",
      "id": 40073,
      "event_type": 40001,
      "title": "Hacking Wi-Fi for Beginners",
      "includes": "",
      "link": "https://www.eventbrite.com/e/hacking-wi-fi-for-beginners-red-rock-iii-tickets-63605681305",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40014,
      "conference": "DEFCON27",
      "end_date": "2019-08-08T21:00+0000",
      "start_date": "2019-08-08T17:00+0000"
    },
    {
      "description": "BLE CTF is a series of Bluetooth low energy challenges in a capture the flag format. It was created to teach the fundamentals of interacting with and hacking Bluetooth Low Energy services. Each exercise, or flag, aims to interactively teach a new concept to the user. For this workshop, we will step through a series of exercises to teach beginner students new concepts and allow more seasoned users to try new tools and techniques. After completing this workshop, you should have a good solid understanding of how to interact with and hack on BLE devices in the wild.\n\n\n\nIf you have done BLE CTF in the past, this class is still valuable. This class will be based off of a complete rewrite of BLE CTF which is being released as version 2.0. It will still have many of the challenges from 1.0, but restructured, where every flag is hosted in a completely separate GATT service. Along with the v1.0 flags, new new version allows for more advanced challenges which were not possible in the past.\n\n\n\nTo prepare for the workshop, please follow the the setup documentation located at https://github.com/hackgnar/ble_ctf/blob/master/docs/workshop_setup.md",
      "id": 40074,
      "event_type": 40001,
      "title": "Learning to Hack Bluetooth Low Energy with BLE CTF",
      "includes": "",
      "link": "https://www.eventbrite.com/e/learning-to-hack-bluetooth-low-energy-with-ble-ctf-red-rock-iv-tickets-63605954121",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40013,
      "conference": "DEFCON27",
      "end_date": "2019-08-08T21:00+0000",
      "start_date": "2019-08-08T17:00+0000"
    },
    {
      "description": "Summarize what your training will cover, attendees will read this to get an idea of what they should know before your training, and what they will learn after. Use this to inform about how technical your class is, what tools will be used, what materials to read in advance to get the most out of your training. This abstract is the primary way people will be drawn to your session.\n\nThis cross-discipline, hands-on training will walk participants through Android application testing and APK reversing basics. The tools and techniques imparted in this training will help guide APK analysis, mobile threat research, and mobile application penetration testing. Free and open source tools will be emphasized, while recognizing the potential role of commercial tools in static and dynamic analysis of APKs. The training will conclude with a CTF-style competition requiring participants to use their new skills to dissect actual Android applications including malicious APKs, intentionally vulnerable APKs, and custom APKs. An entry-level Android device will be provided to each participant to use during the class and CTF depending on class size.",
      "id": 40075,
      "event_type": 40001,
      "title": "Hacking the Android APK",
      "includes": "",
      "link": "https://www.eventbrite.com/e/hacking-the-android-apk-red-rock-v-tickets-63607020310",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40012,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T01:30+0000",
      "start_date": "2019-08-08T21:30+0000"
    },
    {
      "description": "The open-source release of the NSA's Ghidra disassembler gives software reverse engineers a free option for high-capability interactive analysis of binary code. Many software reverse engineering (SRE) practitioners have been spending time since the release learning about Ghidra and bringing it into their workflow. It also gives those new to SRE a toolset to learn with that is not restricted by commercial license costs or \"demo\" limitations.\n\nThe purpose of this workshop is to teach beginners, with no prior experience in software reverse engineering, about the analysis of software in the Ghidra disassembler. We'll cover the following major topics, with high degree of interaction between the instructors and students:\n\n- Defining software reverse engineering terms\n- Setting up an environment for Ghidra\n- Ghidra configuration and usage\n- Linking and Loading\n- Data types\n- C data types and constructs in assembly\n- Simple anti-RE tricks and how to analyze them\n- Methodology for approaching unknown programs (prioritization, analysis)\n- Analysis exercise with a malware sample",
      "id": 40076,
      "event_type": 40001,
      "title": "Introduction to Reverse Engineering With Ghidra",
      "includes": "",
      "link": "https://www.eventbrite.com/e/introduction-to-reverse-engineering-with-ghidra-red-rock-v-tickets-63609250982",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40012,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T01:30+0000",
      "start_date": "2019-08-09T21:30+0000"
    },
    {
      "description": "Machine learning has become commonplace in software engineering and will continue to grow in importance. Currently, most work focuses on improving classifier accuracy. However, as more and more models interact with the real world, practitioners must consider how resilient their models are against adversarial manipulation. Successful attacks can have serious implications, like crashing a car, misclassifying malicious code, or enabling fraud.\n\nIn this workshop, you will learn how to think like an adversary so that you can build more resilient machine learning systems. You'll discover how to use free and open source tools to construct attacks against and defenses for machine learning models, as well as how to holistically identify potential points of attack an adversary could exploit. You'll leave able to critically examine a machine learning system for weaknesses, mount attacks to surface problems, and implement and evaluate practical defenses.",
      "id": 40077,
      "event_type": 40001,
      "title": "Hands on Adversarial Machine Learning",
      "includes": "",
      "link": "https://www.eventbrite.com/e/hands-on-adversarial-machine-learning-red-rock-vi-tickets-63608585993",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40021,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T21:00+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "Get hands on experience writing custom network protocol fuzzers.\nThis class will cover the basics of network protocol \"smart fuzzing.\"\nExercises will utilize the open source network protocol fuzzing\nframework, boofuzz.\nAttendees will gain practice reverse engineering a network protocol,\nimplementing and iterating on a custom fuzzer, and identifying\nvulnerabilities.\n\nAfter:\n\n 1. You will know the basics of fuzzing.\n 2. You will know how to write custom network protocol fuzzers using\nstate of the art open source tools.\n 3. You will have hands on experience with this widely-discussed but\nstill largely mysterious test method.\n\nBefore (Prerequisites): You should:\n\n 1. Be comfortable doing some basic programming in Python.\n 2. Understand basic network protocol concepts (e.g. what is a\nprotocol and what is a network layer).\n 3. Be familiar with WireShark and how to use it.\n 4. Have a laptop with at least 8 GB of RAM (16 GB recommended).\n\nWhat you won't learn:\n\n 1. Exploit development.\n 2. Python programming. Because you can already do that (see above). ;)\n\nFuzzing is a wide and deep field with a wide array of technologies.\nThis class is\na beginner-friednly deep dive into one niche of the fuzzing world.",
      "id": 40078,
      "event_type": 40001,
      "title": "Advanced Custom Network Protocol Fuzzing",
      "includes": "",
      "link": "https://www.eventbrite.com/e/advanced-custom-network-protocol-fuzzing-red-rock-vi-tickets-63609251985",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40021,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T01:30+0000",
      "start_date": "2019-08-09T21:30+0000"
    },
    {
      "description": "In the world of connected devices some are more dangerous than others. Devices that connect our bodies to a network are especially intriguing. These devices are often fraught with vulnerabilities and security concerns. In this workshop participants will have an opportunity to learn about different medical devices and explore their attack surfaces. There will be a collection of connected medical devices on-premise that we will scan, take-apart, and explore. Some of the topics in the course will include: network scanning for medical devices, firmware analysis, vulnerability hunting, Wireless/RF analysis, and hardware analysis and assessment. \n\n\nWe will cover vulnerabilities on the insecure DICOM protocol. We are going to showcase how to leverage pynetdicom to write python scripts for attacking DICOM and exploit insecurely configured PACS servers leading to the extraction of sensitive PHI (Protected Health Information). DICOM, being a highly complex protocol, can also allow for other attack vectors such as embedding PE malware. Another aspect of the training will cover vulnerabilities found in IoT infrastructure with a focus on IP cameras and video management servers. These often run insecure protocols like zeroconf and have web portals that are easily authentication brute-forceable and poorly configured. We are specifically going to examine the WS-Discovery protocol which provides some interesting attack vectors by putting too much trust on the local network.\n\n\nHands-on exercises will be conducted by the students throughout the training for each section under the guidance of the instructors.",
      "id": 40079,
      "event_type": 40001,
      "title": "Hacking Medical Devices",
      "includes": "",
      "link": "https://www.eventbrite.com/e/hacking-medical-devices-red-rock-ii-tickets-63605552921",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40011,
      "conference": "DEFCON27",
      "end_date": "2019-08-08T21:00+0000",
      "start_date": "2019-08-08T17:00+0000"
    },
    {
      "description": "Exploit Kits haven't disappeared, they've simply moved to Microsoft Office. Traditional Exploit Kits (EKs) have the ability to fingerprint and compromise web browser environments, but with the advent of sandboxing and advanced security measures, there has been a shift toward using the Microsoft Office environment as a primary attack surface. Document Exploit Kits (DEKs) leverage DCOM, ActiveX controls, and logic bugs to compromise machines by packing multiple exploits into a single file.\n\nIn this workshop you will learn how to analyze exploits, shellcode, and infection chains produced by modern Document Exploit Kits such as ThreadKit and VenomKit.\n\nThis workshop is aimed at security professionals who are interested in gaining experience with reverse engineering, malware analysis and exploit development. Previous experience in any of these areas will assist the attendee in completing the workshop successfully in a timely fashion. The skills learned in this workshop are most applicable to those who work or are interested in blue team areas, such as those in security operations centers (SOCs), incident responders, intel analysts, and reverse engineers. Those who work or are interested in red team areas will find the content applicable for re-implementation for use in offensive exercises.\n\nThe following tools will be used in this workshop:\n\n- rtfobj for OLE object extraction\n- x64dbg for dynamic analysis of exploits, shellcode, and infection chains\n- procmon and procexp for dynamic analysis of infection chains\n- IDA Pro for static analysis of vulnerable applications and shellcode\n- ffdec for static analysis of Adobe Flash exploits\n- FakeNet-NG and Wireshark for network traffic analysis",
      "id": 40080,
      "event_type": 40001,
      "title": "From EK to DEK: Analyzing Document Exploit Kits",
      "includes": "",
      "link": "https://www.eventbrite.com/e/from-ek-to-dek-analyzing-document-exploit-kits-red-rock-i-tickets-63438831252",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40018,
      "conference": "DEFCON27",
      "end_date": "2019-08-08T21:00+0000",
      "start_date": "2019-08-08T17:00+0000"
    },
    {
      "description": "Microsoft is constantly adapting their security to counter new threats. Specifically, the introduction of the Microsoft Antimalware Scripting Interface (AMSI) and its integration with Windows Defender has significantly raised the bar. In this hands-on class, we will learn the methodology behind obfuscating malware and avoiding detection. Students will explore the inner workings of Windows Defender and learn to employ AMSI bypass techniques and obfuscate malware using Visual Basic (VB) and Powershell. Then identify and evade sandbox environments to ensure the payloads are masked when arriving at the intended target. The final capstone will be tying all the concepts together.\n\nIn this workshop we will:\n\n1. Introduce AMSI and explain its importance\n\n2. Learn to analyze malware scripts before and after execution\n\n3. Understand how obfuscate code to avoid AMSI and Windows Defender\n\n4. Detect and avoid sandbox environments",
      "id": 40081,
      "event_type": 40001,
      "title": "Introduction to Sandbox Evasion and AMSI Bypasses",
      "includes": "",
      "link": "https://www.eventbrite.com/e/introduction-to-sandbox-evasion-and-amsi-bypasses-red-rock-iv-tickets-63609241955",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40013,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T01:30+0000",
      "start_date": "2019-08-09T21:30+0000"
    },
    {
      "description": "In this workshop, you will learn how to defend Linux and Windows environments with osquery, using techniques that could easily be adapted to Mac and containerized environments. Then, we will look at how we can leverage osquery to hunt for malware and attackers, as well as how we could use osquery in a controlled environment to do some basic malware analysis.\n\nWe will cover osquery deployment scenarios and configurations as well as ways we can implement it to improve the security of servers and workstations.\n\nSpecifically, we will use osquery to monitor specific security configurations, detect lateral movement, detect malware, and even see how we can use it in lab environments to analyze malware.\n\nIf you have never used osquery before, this workshop will get you started. If you have used osquery before, this workshop will help you get the most out of it, by allowing you to develop queries and an understanding of the schema and how it can be applied to protect environments and detect attacks.\n\nThe topics covered will include:\n\n* Setup, configuration and flags\n* Logging results\n* Building simple to complex queries\n* Monitoring for lateral movement\n* Tracking important security configurations on Windows and Linux\n* Detecting malware\n* Performing basic malware analysis on a VM with osquery",
      "id": 40082,
      "event_type": 40001,
      "title": "Defending environments and hunting malware with osquery",
      "includes": "",
      "link": "https://www.eventbrite.com/e/defending-environments-and-hunting-malware-with-osquery-red-rock-vii-tickets-63606251009",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40015,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T01:30+0000",
      "start_date": "2019-08-09T21:30+0000"
    },
    {
      "description": "Kerberos delegation is a dangerously powerful feature that allows services to impersonate users. Due to the complexity of Kerberos delegation attacks, they are often overlooked or left unexplored. However, the introduction of Resource-based Constrained Delegation substantially widens the Kerberos attack surface, making it more important than ever for security professionals to engage with this challenge. This workshop will offer security professionals a deep dive into Kerberos delegation and demonstrate how it can be abused for privilege escalation and lateral movement.\n\nWe will open with a crash-course in Microsoft's Kerberos implementation and its delegation features, from the fundamentals of Kerberos authentication, through legacy unconstrained delegation, to classic constrained delegation. We will offer demos and hands-on labs to experiment with abusing these features.\n\nIn the second half of the workshop, we will cover resource-based constrained delegation, explain the differences between classic constrained delegation and resource-based constrained delegation, and explore novel attack primitives including:\n- Compromising hosts by modifying Active Directory computer objects\n- Bypassing restrictions on protocol transition to impersonate arbitrary users\n- Compromising a host by abusing the ticket-granting-ticket of a computer account\n- Performing local privilege escalation on Windows 10 and Windows Server 2016/2019 hosts by abusing account profile pictures\n- Performing remote code execution on SQL Servers through directory listing abuse\n- Achieving hostless domain persistence\n\nParticipants will get an opportunity to try the above attacks in a lab environment.\n\nWe will also explore mitigating controls, as well as detection opportunities.",
      "id": 40083,
      "event_type": 40001,
      "title": "Constructing Kerberos Attacks with Delegation Primitives",
      "includes": "",
      "link": "https://www.eventbrite.com/e/constructing-kerberos-attacks-with-delegation-primitives-red-rock-vii-tickets-63606378390",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40015,
      "conference": "DEFCON27",
      "end_date": "2019-08-08T21:00+0000",
      "start_date": "2019-08-08T17:00+0000"
    },
    {
      "description": "Mainframes power every industry you care about. Yet hackers have no idea how to even begin approaching this these big iron beasts. Where do you even start? VTAM? CICS? TSO? This workshop aims to give you the tools and language you can use to hack a mainframe. Starting with reconnaissance and ending with privilege escalation this workshop will walk you through all the tools and techniques you can use to hack a mainframe in 2019. Students will be introduced to the platform by being allowed to explore the operating system and allowing students to understand the weaknesses within. Students will also get introduced to open source tools and libraries available for all the steps of a penetration test including Nmap, metasploit, python scripts, REXX scripts and even HLASM. The majority of the workshop will be spent performing instructor led hands on mainframe testing with the tools available. Goals for each segment will be laid out with appropriate time afforded to students to allow them the ability to gain a deep understanding of how a test could and should be performed. Exercises will be based on real world attack scenarios developed by the trainers. This training specifically focuses on z/OS.",
      "id": 40084,
      "event_type": 40001,
      "title": "Evil Mainframe Jr: Mainframe hacking from recon to privesc",
      "includes": "",
      "link": "https://www.eventbrite.com/e/evil-mainframe-jr-mainframe-hacking-from-recon-to-privesc-red-rock-i-tickets-63439560433",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40018,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T21:00+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "This workshop will instruct attendees on how to carry out sophisticated wireless attacks against corporate infrastructure. Attendees will learn how to attack and gain access to WPA2-Enterprise networks, bypass network access controls, and perform replay attacks to gain administrative control over an Active Directory environment. External wireless adapters and preconfigured live USBs will be provided to all workshop attendees, and material learned in the lectures will be practiced within a realistic lab environment.",
      "id": 40085,
      "event_type": 40001,
      "title": "Advanced Wireless Attacks Against Enterprise Networks",
      "includes": "",
      "link": "https://www.eventbrite.com/e/advanced-wireless-attacks-against-enterprise-networks-red-rock-vii-tickets-63607316195",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40015,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T01:30+0000",
      "start_date": "2019-08-08T21:30+0000"
    },
    {
      "description": "Recently, Industrial Control System (ICS) attacks have gained popularity in the media. However there are many misconceptions on what exactly ICS systems are and how they function. Although there are similarities to IT systems, there are a multitude of differences that an attacker needs to understand in order to properly assess this type of equipment. In this course, students will be introduced to what ICS is and isn't in terms of technology and functionality. Protocols such as Ethernet/IP, Modbus, and DNP3 will be discussed and illustrated in order for students to have a foundation to build their arsenal. Students will then explore openly available open source tools and examine the functionality of the protocols. After dissection of protocol commands and activities, the students will be led to create their own custom scripts that interact with ICS devices in the classroom.",
      "id": 40086,
      "event_type": 40001,
      "title": "Hacking ICS: From Open Source Tools to Custom Scripts",
      "includes": "",
      "link": "https://www.eventbrite.com/e/hacking-ics-from-open-source-tools-to-custom-scripts-red-rock-v-tickets-63608296126",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40012,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T21:00+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "Organizations spend millions of dollars to keep their assets safe with physical security systems, but these are not without flaw. This course is designed to help you assess, strategize, and navigate your way through the complex electronic physical access control systems and into the largest enterprise organizations. In this course, we will cover enterprise architecture, access control systems, wiring, protocols, controllers, door readers, RFID technologies and techniques, magnetic stripe and PIN attacks, as well as blending social engineering attacks. With our complete physical access lab you'll get hands on experience analyzing and programming multiple RFID card formats.",
      "id": 40087,
      "event_type": 40001,
      "title": "Red Teaming Techniques for Electronic Physical Security Systems",
      "includes": "",
      "link": "https://www.eventbrite.com/e/red-teaming-techniques-for-electronic-physical-security-systems-valley-of-fire-i-tickets-63606408480",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40017,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T21:00+0000",
      "start_date": "2019-08-10T17:00+0000"
    },
    {
      "description": "ICS cybersecurity has been a new subject for years now, especially since Stuxnet. Has the security level of ICS improved?\n\nWell, even if ICS are more and more interconnected, we can probably say yes for network segmentation, as well as patching. And it is mostly true for critical infrastructures that must comply with multiple laws around the world. But what about the most critical components such as PLCs?\n\nIn this workshop, you will learn how to attack PLCs, by attacking ICS protocols: a well-known legacy protocol, Modbus, as well as an open source protocol considered as the future of ICS communications, OPC-UA. And to do so, what could be better than giving you hands-on experience on real devices by hacking our model train?\n\nWe will start by defining industrial control systems and its main components, as well as explaining the key risks and vulnerabilities that affect them. We will then focus on their key assets, Programmable Logic Controllers (PLCs), and discover how they work, how they communicate, how they can be programmed to learn the methods and tools you can use to p*wn them.\n\nThen we will move on to real-world by attacking real PLCs from two major manufacturers on a dedicated setup featuring robot arms and a model train! And to conclude, probably the most difficult, let's discuss how to secure ICS communications.",
      "id": 40088,
      "event_type": 40001,
      "title": "Pentesting ICS 102 ",
      "includes": "",
      "link": "https://www.eventbrite.com/e/pentesting-ics-102-valley-of-fire-ii-tickets-64797701670",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40019,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T01:30+0000",
      "start_date": "2019-08-10T21:30+0000"
    },
    {
      "description": "The workshop aims towards making beginners aware and comfortable with various facets of Scapy and its real time usages in various task of penetration testing.\nThe flow of workshop will be as under:\n1. Scapy basics\n2. TCP Basics\n3. DHCP server\n4. DHCP server flooder || DNS/MDNS\n5. Crafting a layer using Scapy\n6. Fuzzing protocols with Scapy\n7. Covert channel using Scapy\n8. Scapy-radio\n\nAdded value to the workshop:\n\nWhat attendees will learn:\n- sending/receiving/displaying/modifying packets with Scapy\n- implementing custom layers in Scapy\n- implement answerMachines in Scapy\n- to construct tools implementing some real life examples\n- simple fuzzing through Scapy and generators\n- to decode live traffic with an implemented protocol\n\nWorking in Scapy consequently attendees will learn:\n- TCP basics\n- DHCP/DNS/MDNS basics\n- AJP13 protocol\n- fuzzing\n- Scapy-radio\n+\nPrebuilt VM containing all scripts and dependencies in place.\nAn ISO in progress can be found at:\nhttps://drive.google.com/open?id=1wJ9OQOAnew3upyoFdMUz1hlo0WEuogJW\n(/root contains install script. /src contains scripts. python-netaddr dependency needs to be installed manually as of now with apt.)",
      "id": 40089,
      "event_type": 40001,
      "title": "scapy_dojo_v_1",
      "includes": "",
      "link": "https://www.eventbrite.com/e/scapy-dojo-v-1-lake-mead-i-tickets-63439609580",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40020,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T01:30+0000",
      "start_date": "2019-08-10T21:30+0000"
    },
    {
      "description": "This workshop aims to provide attendees hands-on experience on writing custom backdoor payloads using C# for the most common command and control frameworks including Metasploit, Powershell Empire and Cobalt Strike. The workshop consists in 7 lab exercises; each of the exercises goes over a different technique that leverages C# and .NET capabilities to obtain a reverse shell on a victim Windows host. The covered techniques include raw shellcode injection, process injection, process hollowing, runtime compilation, parent pid spoofing, antivirus bypassing, etc. At the end of this workshop attendees will have a clear understanding of these techniques both from an attack and defense perspective.",
      "id": 40090,
      "event_type": 40001,
      "title": "Writing custom backdoor payloads using C#",
      "includes": "",
      "link": "https://www.eventbrite.com/e/writing-custom-backdoor-payloads-using-c-lake-mead-ii-tickets-63439591526",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40010,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T21:00+0000",
      "start_date": "2019-08-10T17:00+0000"
    },
    {
      "description": "You have a theory about something you have found while roaming the network or conducting your own hackfest, but how do you go about proving it? This workshop will be a hands-on journey deep into the world of analysis. While analysis is a bit of an art form, there are methods that can be applied to make it less of a gut feeling and more of a scientific approach to support your hypothesis. From network forensics to log analysis to endpoint forensics and malware analysis, we will review numerous quick methods to gain context over the data you have gathered and apply critical thinking in an attempt to find the answers. Sometimes, the answers weren't meant to be found, but we'll also discuss how to make the best of any conclusion that you reach.",
      "id": 40091,
      "event_type": 40001,
      "title": "Analysis 101 for Hackers and Incident Responders",
      "includes": "",
      "link": "https://www.eventbrite.com/e/analysis-101-for-hackers-and-incident-responders-red-rock-iv-tickets-63606992226",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40013,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T01:30+0000",
      "start_date": "2019-08-08T21:30+0000"
    },
    {
      "description": "TBA",
      "id": 40092,
      "event_type": 40001,
      "title": "Analysis 101 for Hackers and Incident Responders",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40013,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T01:30+0000",
      "start_date": "2019-08-08T21:30+0000"
    },
    {
      "description": "DNS fragmentation attacks are a more recent series of attacks that take advantage of the consistent composition of fragmented DNS responses by sending a crafted (malicious) second fragment to be reassembled with a legitimate first fragment at the IP layer. Even if DNSSEC is fully implemented, an attacker can still poison unsigned \"glue\" records.\n\nThese types of attacks are difficult, and have really only been considered remotely feasible over IPv4. Most nameservers use \"per-destination\" IP-layer ID (IPID) counters, and the IPID in the IPv6 Fragment Extension Header cannot be easily guessed blindly, as the number of bits in the field has been comparatively doubled to 32 bits (making blind-guessing even in ideal conditions take an average 34 million iterations).\n\nUnfortunately, as part of optimizations made to Linux. The IPID counter is no longer truly \"per-destination\" and the IPID for a given destination can be inferred consistently enough to facilitate an attack. This allows DNS poisoning on IPv4 and IPv6 with equal consistency and precision, and makes poisoning on the first attempt \"thousands\" of times easier.\n\nThis talk will cover how this attack is carried out, how consistent it really can be, and mitigations that can be put in place by operators of both DNS nameservers and resolvers to limit its effectiveness.",
      "id": 40093,
      "event_type": 40002,
      "title": "First-try\" DNS Cache Poisoning with IPv4 and IPv6\nFragmentation",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40001,
      "conference": "DEFCON27",
      "end_date": "2019-08-08T07:45+0000",
      "start_date": "2019-08-08T07:00+0000"
    },
    {
      "description": "ìA concept is a brick. It can be used to build a courthouse of reason. Or it can be thrown through the window.î\n_ Gilles Deleuze\n\nEver since Smashing the Stack For Fun And Profit was published by Aleph One almost a quarter century ago the security world has completely changed the way it defends exploitation. Canary stack, DEP, ASLR, CFI and various other mitigation techniques were developed to address various exploit techniques. Yet, ROP remains a prominent practice employed by many exploits even today.\n\nROP is the most common exploitation method for attackers to mutate memory bugs on target process into malicious executable code. ìNext Genî endpoint security products try to address ROP and other exploitation methods. Windows embraces many mitigation techniques as well. However, these mitigation features such as CFG can in fact be leveraged and increase ROPís attack surface and allow it to even bypass exploit protections!\n\nIf you are intrigued by ROP, want to learn about methods in Windows that protect against ROP and how to bypass them - this talk is for you! On top of that a novel method of bypassing ROP mitigation of most products will also be revealed.",
      "id": 40094,
      "event_type": 40002,
      "title": "Exploiting Windows Exploit Mitigation for ROP Exploits",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40002,
      "conference": "DEFCON27",
      "end_date": "2019-08-08T17:45+0000",
      "start_date": "2019-08-08T17:00+0000"
    },
    {
      "description": "ver the past years, our team has used several new approaches to identify multiple critical vulnerabilities in SQLite and Curl, two of the most widely used basic software libraries. These two sets of vulnerabilities, which we named \"Magellan\" and \"Dias\" respectively, affect many devices and software. We exploited these vulnerabilities to break into some of the most popular Internet of things devices, such as Google Home with Chrome. We also exploited them on one of the most widely used Web server (Apache+PHP) and one of the most commonly used developer tool (Git).\n\nIn this presentation, we will share how we try to crack the Google Home from both hardware and software aspects, get and analyze the newest firmware, solve the problem, and introduce new methods to discover vulnerabilities in SQLite and Curl through Fuzz and manual auditing. Through these methods, we found \"Magellan\", a set of three heap buffer overflow and heap data disclosure vulnerabilities in SQLite ( CVE-2018-20346, CVE-2018-20505 CVE-2018-20506 ) We also found \"Dias\", two remote memory leak and stack buffer overflow vulnerabilities in Curl ( CVE-2018-16890 and CVE-2019-3822 ). Considering the fact that these vulnerabilities affect many systems and software, we have issued a vulnerability alert to notify the vulnerable vendor to fix it.\n\nWe will disclose the details of \"Magellan\" and \"Dias\" for the first time and highlight some of our new vulnerability exploitation techniques. In the first part, we will introduce the results of our analysis on hardware, how to get the newest firmware from simulating an update request, and attack surface of Google Home. We will show how to use Magellan to complete the remote exploit of Google Home, we will also give a brefing talk about how to use Dias to complete the remote attack on Apache+PHP and Git. Finally, we will summarize our research and provide some security development advice to the basic software library developers.",
      "id": 40095,
      "event_type": 40002,
      "title": "Breaking Google Home: Exploit It with SQLite (Magellan)",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40002,
      "conference": "DEFCON27",
      "end_date": "2019-08-08T18:45+0000",
      "start_date": "2019-08-08T18:00+0000"
    },
    {
      "description": "Shor's Algorithm for factoring integer numbers is the big threat to cryptography (RSA/ECC) as it reduces the complexity from exponential to polynomial, which means a Quantum Computer can reduce the time to crack RSA-2048 to a mere 10 seconds. However current noisy NISQ type quantum computers are very limited to something like 16 bit RSA keys. And the quality of the current qubits is so bad that error-correction comes at a massive cost of at least 100 times the amount of qubits.\n\nWhile the world is pre-occupied whether we have universal quantum computers big enough for Shor's algorithm, Quantum Annealing is stealing the show with having factored a 20-bit number just in January this year using 97 qubits. And these qubits are actually good enough to factor bigger numbers. If we assume a linear scalability, we'd \"only\" need around 10,000 qubits to factor a 2048bit RSA key. D-Wave announced a quantum computer with 5,640 qubits, so that puts it within reach soon. \n\nSo, could Quantum Annealing be more of a threat to cryptography than Shor's algorithm on universal quantum computers? How do these algorithms work? How do they achieve a polynomial complexity to what traditional computers need exponential time? What impact will this have on the competition from NIST for the design of post-quantum-cryptography algorithms?",
      "id": 40096,
      "event_type": 40002,
      "title": "Are Quantum Computers Really A Threat To Cryptography? A Practical Overview Of Current State-Of-The-Art Techniques With Some Interesting Surprises",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40002,
      "conference": "DEFCON27",
      "end_date": "2019-08-08T19:45+0000",
      "start_date": "2019-08-08T19:00+0000"
    },
    {
      "description": "From small business to large enterprise, VOIP phones can be found on nearly every desk. But how secure are they? What if your phone was spying on every conversation you have? \nThis talk is an introduction to hardware hacking and as a case study Iíll use the [REDACTED] Deskphone, a device frequently deployed in corporate environments. Iíll use it to introduce the tools and methodology needed to answer these questions.  \n \nDuring this talk, attendees will get a close up look at the operations of a hardware hacker, including ARM disassembly, firmware extraction using binwalk, micro-soldering to patch an EEPROM and get a root shell over UART, and ultimately uncover an already known decade-old bug that somehow remained unnoticed in the deviceís firmware.  \n \nBeyond the case study I will also address alternative tactics; some did not work, others may have but were not the lowest-hanging fruit. When it comes to hardware hacking, the process is as important as the result; knowing that there are multiple ways to reach the end goal helps researchers remain confident when hurdles arise. After the talk, attendees will have an increased distrust towards always-on devices; however, they will have the background knowledge to investigate the products and systems they encounter daily.",
      "id": 40097,
      "event_type": 40002,
      "title": "Intro to Embedded Hacking -- How you too can find a decade old bug in widely deployed devices.  [REDACTED] Deskphones, a case study.",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40002,
      "conference": "DEFCON27",
      "end_date": "2019-08-08T20:45+0000",
      "start_date": "2019-08-08T20:00+0000"
    },
    {
      "description": "People are always talking about binary vulnerabilities when attacking desktop applications. Memory corruptions are always costly to find. Meanwhile, mitigations introduced by operating systems make them harder to be exploited. More and more applications are using hybrid technologies, so we can try web security tricks to pwn them reliably with less effort.\n\nOur presentation will summarize attack surfaces and methods to find security issues in desktop applications. In particular, we will explicate some real-world cases, such as chaining multiple vulnerabilities (information leaking, CSP bypass, opened debugging port) to achieve RCE in a specialized IDE, sensitive file leaking in famous editors, privileged APIs abusing in many IM applications and so on. During our research, we find some issues actually reside in popular libraries. These flaws may affect more applications than we will demonstrate in this talk.\n\nWeb security knowledge is usually unfamiliar to desktop application developers. Attacking desktop apps using web security tricks is a non-competitive \"blue ocean\". Our presentation will focus on many design misconceptions and implementation mistakes in desktop applications. By sharing these representative lessons, we hope to help desktop application developers improve the security of their products.",
      "id": 40098,
      "event_type": 40002,
      "title": "Web2Own: Attacking Desktop Apps From Web Security's Perspective",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40002,
      "conference": "DEFCON27",
      "end_date": "2019-08-08T21:45+0000",
      "start_date": "2019-08-08T21:00+0000"
    },
    {
      "description": "The DEF CON 101 Panel is the place to go to learn about the many facets of DEF CON and to begin your DEF CONian Adventure. The idea is to help attendees get the best experience out of DEF CON (and also tell them how to survive the weekend!). It is a way for people who have participated in making DEF CON what it is today to share those experiences and, hopefully, inspire attendees to expand their horizons. DEF CON offers so much more than just talks and the DEF CON 101 panel is the perfect place to learn about all things DEF CON so you, dear reader, can get the best experience possible. The panel will end with the time honored tradition of \"Name the n00b\" where lucky attendees will be brought up on stage to introduce themselves to you and earn the coveted 101 n00b handle. Don't worry if you don't make it on to the stage, you can stick around for the n00b party after the panel and get your handle then!",
      "id": 40099,
      "event_type": 40002,
      "title": "DEF CON 101 Panel",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40002,
      "conference": "DEFCON27",
      "end_date": "2019-08-08T23:45+0000",
      "start_date": "2019-08-08T22:00+0000"
    },
    {
      "description": "Incorporating natural elements, complex fabrication techniques, and components rarely seen by the outside world, the DEFCON 27 Badge brings our community together through Technology's Promise. Join DEFCON's original electronic badge designer Joe Grand on a behind-the-scenes journey of this year's development process and the challenges, risks, and adventures he faced along the way.",
      "id": 40100,
      "event_type": 40002,
      "title": "Behind the Scenes of the DEFCON 27 Badge",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T17:45+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "A SIMULATED crisis is unfolding on a national scale, based loosely on the NotPetya attack of 2017.  Triggered by a yet-unknown adversary, what started as a an isolated technical issue has quickly escalated into a society-wide event affecting millions of citizens, several industries, and spanning government jurisdictions.  Who is in charge, how do they cooperate with others, and how do they make decisions?  The Wilson Center, Hewlett Foundation and I Am The Calvary are teaming up to bring public policymakers together with security researchers and others to discover how our nation might respond to a wide-scale ìcyber crisisî.  Work in tandem with sitting Members of Congress to understand what levers of power Congress yields and how Members can address policy gaps in the future.",
      "id": 40101,
      "event_type": 40002,
      "title": "Hacking Congress: The Enemy Of My Enemy Is My Friend",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T17:45+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "This talk is the grand finale of a four-year long investigation that started with analyzing an IoT botnet, to discovering the structured industry that exists behind social media manipulation (SMM). SMM is the deliberate act of paying for popularity with followers or activity on social media. \n\nAdopting a bottom-up approach, the thorough methodology undertook to study the botnet will be presented: from building honeypots, infecting them with malware and conducting a man-in-the-middle-attack on the honeypotsí traffic to access the decrypted HTTPS content between the C&Cs and social networks. Then, the various investigative paths taken to analyze this large data set, leading to the discovery of industry actors involved in the supply chain of social media manipulation, will be presented. These investigative paths include traffic analysis, various OSINT approaches to reveal and understand actors, reverse-engineering the software that automates the use and creation of fake accounts, forum investigations, and qualitative profiling. All actors involved in the industry will be mapped, from malware authors, to reseller panels, and customers of fake popularity.  \n\nThe potential profitability of the industry will then be discussed, as well as the revenue division in the chain, demonstrating that the ones making the highest revenue per fake follower sold are not the malware authors, but rather those at the end of the chain.",
      "id": 40102,
      "event_type": 40002,
      "title": "Behind the Scenes: The Industry of Social Media Manipulation Driven by Malware†",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T17:45+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "Secure facilities in North America use lock systems like Medeco, Abloy, Assa and Mul-T-Lock partly to resist lock picking, but also to prevent the duplication and creation of unauthorised keys.  Places such as the White House and the Canadian Parliament buildings go so far as to use a key profile exclusive to that facility to ensure that no-one is able to obtain key blanks on which to make a copy.  However, there are tens of thousands of unrestricted key blank profiles in existence - many match very closely to these restricted key blanks, and can be used instead of the real blanks to cut keys on. Moreover, keys are just pieces of metal - we will present numerous practical techniques to create restricted keys without authorisation - including new attacks on Medeco, Mul-T-Lock and Abloy key control systems.  We will touch on all aspects of key control, including patents and interactive elements, and discuss how to defeat them and how facility managers can fight back against these attacks.",
      "id": 40103,
      "event_type": 40002,
      "title": "Duplicating Restricted Mechanical Keys",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T17:45+0000",
      "start_date": "2019-08-09T17:00+0000"
    },
    {
      "description": "AI needs no introduction as one of the most overhyped technical fields in the last decade. The subsequent hysteria around building AI-based systems has also made them a tasty target for folks looking to cause major mischief. However, most of the popular proposed attacks specifically targeting AI systems focus on the algorithm rather than the system in which the algorithm is deployed. Weíll begin by talking about why this threat model doesnít hold up in realistic scenarios, using facial detection and self-driving cars as primary examples. We will also learn how to more effectively red-team AI systems by considering the data processing pipeline as the primary target.",
      "id": 40104,
      "event_type": 40002,
      "title": "Don't Red-Team AI Like a Chump",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T18:45+0000",
      "start_date": "2019-08-09T18:00+0000"
    },
    {
      "description": "Tor is a free-software anonymizing network that helps people around the world use the Internet in safety. But who cares how good Tor's privacy is, if your government prevents you from reaching the Tor network?\n\nIn the beginning, some countries filtered torproject.org by DNS (so we made website mirrors and an email autoresponder for downloading Tor), and then some countries blocked Tor relays by IP address (so we developed bridges, which are essentially unlisted relays), and then some countries blocked Tor traffic by Deep Packet Inspection (so we developed pluggable transports to transform Tor flows into benign-looking traffic).\n\nThen things got weird, with China's nationwide active probing infrastructure to enumerate bridges, with Amazon rolling over to Russia's threats when Telegram used \"domain fronting\" to get around blocking, with Turkey blocking Tor traffic by DPI in more subtle ways, with Venezuela and Ethiopia and Iran trying new tricks, and more.\n\nIn this talk I'll get you up to speed on all the ways governments have tried to block Tor, walk through our upcoming steps to stay ahead of the arms race, and give you some new -- easier -- ways that let you help censored users reach the internet safely.",
      "id": 40105,
      "event_type": 40002,
      "title": "The Tor Censorship Arms Race: The Next Chapter",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T18:45+0000",
      "start_date": "2019-08-09T18:00+0000"
    },
    {
      "description": "Nowadays more and more 4G modules are built into IoT devices around the world, such as vending machines, car entertainment systems, laptops, advertising screens, and urban cameras etc.  But no one has conducted a comprehensive security research on the 4G modules.  We carried out this initiative and tested all the major brand 4G modules in the market (more than 15 different types).  The results show all of them have similar vulnerabilities, including remote access with weak passwords, command injection of AT Command/listening services, OTA upgrade spoofing, command injection by SMS, and web vulnerability.  Through these vulnerabilities we were able to get to the shell of these devices.  In addition to using wifi to exploit these vulnerabilities, we created a new way to attack through fake base station system, triggered by accessing the intranet of cellular network, and successfully run remote command execution without any requisites.  In this talk, we will first give an overview on the hardware structure of these modules.  Then we will present the specific methods we use in vulnerability probe. In the final section we will demonstrate how to use these vulnerabilities to attack car entertainment systems of various brands and get remote control of cars.",
      "id": 40106,
      "event_type": 40002,
      "title": "All the 4G Modules Could Be Hacked",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T18:45+0000",
      "start_date": "2019-08-09T18:00+0000"
    },
    {
      "description": "eBPF (or \"extended\" Berkeley Packet Filter) is a bytecode instruction set and virtual machine used as a safe computing environment within the Linux kernel to perform arbitrary programmatic actions. It is a redesign of Linux's original in-kernel BPF bytecode VM used to power features like tcpdump filters. eBPF has an entirely different set of capabilities and instructions, with its primary goal being to serve as a JIT-able virtual machine instruction set that can be targeted by compilers of a memory-safe \"restricted C\" language. In the Linux kernel, it is actively being applied to anything and everything to provide performant programmatic capabilities to userland that extend traditionally kernel-based functionality.\n\nIn this exploit development focused talk, we will first introduce eBPF and discuss several nefarious techniques enabled by the technology. As we do so, we will cover the respective sets of APIs, file descriptor types, and other eBPF machinery that enable such techniques, building up from various forms of hidden IPC channels to full-fledged rootkits. Within this talk, we will walk through the implementations of the techniques we discuss so that attendees will walk away with the knowledge of how to implement their own variants. Along the way we will discuss novel container breakout techniques and interesting \"dual-purpose\" eBPF features that enable the development of mutative syscall hooks that work for processes that work for processes already attached by a debugger. Finally, we will provide insight on how defenders should begin to attempt to detect and recover from such abuses, when possible at all.\n\nThis presentation significantly extends on work we first presented at 35C3, which focused more heavily on the underlying aspects of general eBPF-based kernel tracing. In contrast, this talk will demo new techniques and include substantially improved versions of techniques presented previously as proofs-of-concept.",
      "id": 40107,
      "event_type": 40002,
      "title": "Evil eBPF In-Depth: Practical Abuses of an\nIn-Kernel Bytecode Runtime",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T18:45+0000",
      "start_date": "2019-08-09T18:00+0000"
    },
    {
      "description": "When it comes to process injection in Windows, there are only 6-7 fundamental techniques, right? Wrong. In this talk, we provide the most comprehensive to-date ìWindows process injectionî collection of techniques. We focus on Windows 10 x64, and on injections from running 64-bit medium integrity process to another running 64-bit medium integrity process, without privilege elevation. We pay special attention to the new Windows protection technologies, e.g. CFG and CIG. We differentiate between memory write primitives and execution techniques, and discuss memory allocation strategies. Our collection is curated, analyzed, tabulated, with straight-forward, research-grade PoCs. We tested each technique against Windows 10 x64 with and without protections, and we report on the requirements, limitations, and quirks of each technique. And of course ñ no decent DEF CON presentation is complete without new attacks. We describe a new memory writing primitive which is CFG-agnostic. We describe a new ìstack bombingî execution method (based on the memory write primitive above) that is inherently safe (even though overwriting the stack is a-priori a dangerous and destabilizing action). Finally, we release a library of all write primitives and execution methods, so users can generate ìtailor-madeî process injections.",
      "id": 40108,
      "event_type": 40002,
      "title": "Process Injection Techniques - Gotta Catch Them All",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T19:45+0000",
      "start_date": "2019-08-09T19:00+0000"
    },
    {
      "description": "This is a comprehensive dive into the current emergency phones with an in-depth look at the phones used in elevators. This talk will provide unique insight into a topic that hasn't been covered before: Elevator Phones. During this talk, I will discuss the commonality between elevator phone brands. I will cover a new, never before released, set of default passwords these system use.  I will show a tool kit and how to use it to access elevator phones locally, as well as remotely. In addition, I will show how to reprogram a phone , how to make the elevator state its location, and how to alert the passenger that help is on the way. Finally, I will demonstrate some attacks, including how you can use elevator phones as listening devices to silently listen to conversations of people inside an elevator.  Iím WillC, your elevator operator, let's go for a ride!",
      "id": 40109,
      "event_type": 40002,
      "title": "Phreaking Elevators",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T19:45+0000",
      "start_date": "2019-08-09T19:00+0000"
    },
    {
      "description": "Computer security is now a public policy issue. Election security, blockchain, \"going dark,\" the vulnerabilities equities debate, IoT safety , data privacy, algorithmic security and fairness, critical infrastructure: these are all important public policy issues with a strong Internet security component. But while an understanding of the technology involved is fundamental to crafting good policy, there is little involvement of technologists in policy discussions. This is not sustainable. We need public-interest technologists: people from our fields helping craft policy, and working to provide security to agencies and groups working in the broader public interest. We need these people in government, at NGOs, teaching at universities, as part of the press, and inside private companies. This is increasingly critical to both public safety and overall social welfare. This talk both describes the current state of public-interest technology, and offers a way forward for us individually and collectively for our field. The defining policy question of the Internet age is this: How much of our lives should be governed by technology, and under what terms? We need to be involved in that debate.SSL VPNs protect corporate assets from Internet exposure, but what if SSL VPNs themselves are vulnerable? Theyíre exposed to the Internet, trusted to reliably guard the only way to intranet. However, we found pre-auth RCEs on multiple leading SSL VPNs, used by nearly half of the Fortune 500 companies and many government organizations. To make things worse, a ìmagicî backdoor was found to allow changing any userís password with no credentials required! To show how bad things can go, we will demonstrate gaining root shell from the only exposed HTTPS port, covertly weaponizing the server against their owner, and abusing a hidden feature to take over all VPN clients!\n\nIn such complicated closed-source systems, gaining root shell from outside the box certainly ainít easy. It takes advanced web and binary exploitation techniques to struggle for a way to root shell, which involves abusing defects in web architectures, hard-core Apache jemalloc exploitation and more. We will cover every detail of all the dirty tricks, crazy bug chains, and the built-in backdoor. After gaining root shell into the box, we then elaborate on post exploitation and how we hack back the clients. In addition, we will share the attack vectors against SSL VPNs to kick start researches on similar targets. On the other hand, from our previous experience, we derive general hardening actions that mitigate not only all the above attacks, but any other potential 0days.\n\nIn summary, we disclose practical attacks capable of compromising millions of targets, including tech giants and many industry leaders. These techniques and methodologies are published in the hope that it can inspire more security researchers to think out-of-the-box; enterprises can apply immediate mitigation, and realize that SSL VPN is not merely Virtual Private Network, but also a ìVulnerable Point of your Networkî.",
      "id": 40110,
      "event_type": 40002,
      "title": "Infiltrating Corporate Intranet Like NSA _Pre-auth RCE on Leading SSL VPNs",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T19:45+0000",
      "start_date": "2019-08-09T19:00+0000"
    },
    {
      "description": "The 2016 WWDC saw the dawn of Apple Pay Web, an API that lets websites embed an Apple Pay button within their web-facing stores.  Supporting it required a complex request flow, complete with client certificates and a custom session server. This proved detrimental, since Apple failed to caution against important side effects of taking in untrusted URLs.  As a result, many new SSRF vulnerabilities entered the world. Worse yet, while they were exploitable and discoverable in similar ways, they were spread across distinct codebases in several programming languages, so could not be patched in any generic way.\n\nApple is not alone - in the process of gluing the web together, Twilio, Salesforce, and others have all created similarly broad attack surfaces.  When companies fail to take an honest, empathetic look at how clients will use a product, they shove along hidden security burdens. Those who integrate with an API have less context than those who create it, so are in a worse position to recognize these risks.\n\nEngineers have been talking about defensive programming for decades, but top companies still have trouble practicing it.  In this talk we explore these mistakes with demos of affected software, and introduce a powerful model for finding broad classes of bugs.",
      "id": 40111,
      "event_type": 40002,
      "title": "API-Induced SSRF: How Apple Pay Scattered\nVulnerabilities Across the Web",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T19:45+0000",
      "start_date": "2019-08-09T19:00+0000"
    },
    {
      "description": "Pointer Authentication (in short, PAuth) is the latest security mechanism in iOS. It is proposed to protect the integrity of pointers with hardware-assisted encryption, thus eliminating the threats of code-reuse attacks. In PAuth, a cryptographic signature called PAC is calculated from a pointer value and inserted into the pointer. When the pointer is about to be used, the PAC is extracted and verified whether it is consistent with the original pointer value. In this way, PAuth is able to ensure that the pointers are not tampered. iOS deployed PAuth in user-space system services, protecting pointers that may affect the control flow and preventing code-reuse attacks like ROP and JOP.\n\n    However, in our study, we found that a fatal flaw in the implementation of iOS PAuth makes user-space system services till vulnerable to code-reuse attacks. The flaw is: iOS uses the same signing key in different user-space processes. This flaw allows a signed pointer from a malicious process can be correctly verified in a system service, thus making it possible to launch JOP. In this talk, we will explain how we found the flaw and why it is inevitable. In advance, we will demonstrate how to leverage this flaw and launch JOP attacks in a PAuth-protected system service. Also, we will propose a new tool, PAC-gadget, to automatically find JOP gadgets in PAuth-protected binaries.",
      "id": 40112,
      "event_type": 40002,
      "title": "HackPac: Hacking Pointer Authentication in iOS User Space",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T20:45+0000",
      "start_date": "2019-08-09T20:00+0000"
    },
    {
      "description": "Like most modern devices, building controllers have increasingly become network connected, exposing them to a wider range of threats. If malicious actors could manipulate access control systems, boiler rooms, or temperature control for critical industrial systems, the potential for catastrophic damage is extreme.\n\nMcAfee's ATR team has discovered a 0-day vulnerability in a major building controller.  This controller is a fully programmable native BACnetô device designed to manage a wide range of building systems.  By modifying BACnet broadcast traffic, a buffer overflow can be leveraged into a write-what-where (WWW) condition. This WWW leads to execution control, providing the attacker with a root shell and complete control over the device remotely.  Because this attack vector is through BACnet broadcast traffic, there is no authentication mechanism for the target device, allowing anyone on the same network to communicate with it directly and exploit the vulnerability without authentication. Currently, there are over 500 of these devices connected to the internet running in BACnet/IP Broadcast Management Device (BBMD) mode.  Utilizing this mode, broadcast traffic can travel over the internet, increasing the potentially devastating impact of this vulnerability.\n\nThis presentation will include a deep technical analysis of the vulnerability discovery process and demos illustrating an attack in a critical scenario.  Finally, we will discuss the steps taken by the vendor to patch this vulnerability and demonstrate its effectiveness.",
      "id": 40113,
      "event_type": 40002,
      "title": "HVACking: Understand the Difference Between Security and Reality!",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T20:45+0000",
      "start_date": "2019-08-09T20:00+0000"
    },
    {
      "description": "Hacking ëhigh securityí electronic locks has become a bit of a hobby, but what if you identify an unpatchable design pattern that unlocks buckets of cash and government secrets? How long do wait before telling ëpeopleí? letís talk about how these locks are designed, where they fail and we can rip this band-aid off together.",
      "id": 40114,
      "event_type": 40002,
      "title": "No Mas ñ How One Side-Channel Flaw Opens Atm, Pharmacies and Government Secrets Up to Attack",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T20:45+0000",
      "start_date": "2019-08-09T20:00+0000"
    },
    {
      "description": "Did you know that Elastic Block Storage (Amazon EBS) has a \"public\" mode that makes your virtual hard disk available to anyone on the internet? Apparently hundreds of thousands of others didn't either, because they're out there exposing secrets for everyone to see.\n\nI tore apart the petabytes of data for you and have some dirty laundry to air: encryption keys, passwords, authentication tokens, PII, you name it and it's here. Whole (virtual) hard drives to live sites and apps, just sitting there for anyone to read. So much data in fact that I had to invent a custom system to process it all.\n\nThere's a massive Wall of Sheep out there on the internet, and you might not have even noticed that you're on it. Actually, you should stop reading and go check that out right now.",
      "id": 40115,
      "event_type": 40002,
      "title": "More Keys Than A Piano: Finding Secrets In Publicly Exposed Ebs Volumes",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T20:45+0000",
      "start_date": "2019-08-09T20:00+0000"
    },
    {
      "description": "Whenever a new Mac malware specimen is uncovered, it provides a unique insight into the offensive Mac capabilities of hackers or nation-state adversaries. Better yet, such discoveries provide fully-functional capabilities that may be weaponized for our own surreptitious purposes! I mean, life is short, why write your own?\n\nWe'll begin this talk by discussing the methodology of subverting existing malware for \"personal use\", highlighting both the challenges and benefits of such an approach.\n\nNext, we'll walk-thru the weaponization of various Mac malware specimens, including an interactive backdoor, a file-exfiltration implant, ransomware, and yes, even adware. Customizations include various runtime binary modifications that will coerce such malware to accept tasking from our own C&C servers, and/or automatically perform actions on our behalf. \nOf course, in their pristine state, such samples are currently detected by AV products. As such we'll also walk-thru subtle modifications that will ensure our modified tools remains undetected by traditional detection approaches.\nIn conclusion, we'll highlight novel heuristic methods that can generically detect such threats to ensure Mac users remain protected even from such weaponized threats.",
      "id": 40116,
      "event_type": 40002,
      "title": "Harnessing Weapons of Mac Destruction",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T21:45+0000",
      "start_date": "2019-08-09T21:00+0000"
    },
    {
      "description": "From credit reporting agencies to hotel enterprises, major data breaches happen daily. However, when was the last time we considered the data security of children and middle-level education students? The infosec community spends so much time thinking about enterprise security and user privacy, but who looks after those who can't defend themselves? Unknown to most, there are only just a handful of major educational software providers -- and flaws in any of them can lead to massive holes which expose the confidential information of our rising generation, this speaker included. Additionally, while many dismiss educational data as ìjust containing gradesî, the reality is that these systems store extremely sensitive information from religious beliefs, health and vaccine-related data, to even information about parental abuse and drug use in the family.\n\nThis talk will cover never-before-seen research into the handful of prominent educational software companies, the vulnerabilities that were found, the thousands of schools and millions of students affected, and the personal fallout of such research. Vulnerabilities discussed will range from blind SQL injection to leaked credentials for the entire kingdom. If a high school student can compromise the data of over 5 million students and teachers, what can APT do?",
      "id": 40117,
      "event_type": 40002,
      "title": "Are Your Child's Records at Risk? The Current State of School Infosec",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T21:45+0000",
      "start_date": "2019-08-09T21:00+0000"
    },
    {
      "description": "This talk explores how AI is revolutionizing hardware side-channel attacks and what this new wave of attacks mean for the future of hardware cryptography. Based on the lessons learned while successfully attacking many hardware AES implementations using deep-learning this talk discuss why those attacks are fundamentally more efficient and details how to conduct then in practice.",
      "id": 40118,
      "event_type": 40002,
      "title": "How Deep Learning Is Revolutionizing Side-Channel Cryptanalysis",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T21:45+0000",
      "start_date": "2019-08-09T21:00+0000"
    },
    {
      "description": "In theory, brute force key recovery attacks against modern ciphers like AES should be impractical with the current state of computer hardware. It's often said that recovering an AES key should take longer than the remainder of the life of the sun. However, this assumes that keys are chosen properly, and that there is no way to determine whether a key is the correct one after a candidate key is used to decrypt a captured ciphertext.  In practice, these conditions do not always hold. In much the same way that hash functions are impossible to reverse but hash cracking is still a practical attack, in the real world it is often possible to perform practical key search attacks. In this talk, we will discuss the common mistakes and common conditions that allow for practical brute force recovery of keys for modern block ciphers such as AES. We will also discuss optimizations to speed up key search efforts, and present our FOSS tool, which implements our approach.",
      "id": 40119,
      "event_type": 40002,
      "title": "Practical Key Search Attacks Against Modern Symmetric Ciphers",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T21:45+0000",
      "start_date": "2019-08-09T21:00+0000"
    },
    {
      "description": "Configuration Management (CM) tools are used to provision systems in a uniform manner. CM servers are prime targets for exploitation because they are connected with key machines. The tools themselves are powerful from a security standpoint: they allow an attacker to run commands on any and every connected system. Unfortunately, many security professionals do not have CM experience, which prevents them from using these tools effectively. MOSE empowers the user to weaponize an organizationís CM tools without having to worry about implementation-specific details.\n\nMOSE first creates a binary based on user input. Once transferred to the CM server and run, this binary dynamically generates code that carries out the desired malicious behavior on specified systems. This behavior can include running arbitrary system commands, creating or deleting files, and introducing backdoors. MOSE puts the generated code in the proper place so that all targeted systems will run it on their next check-in with the server, removing the need for the user to integrate it manually.\n\nCM tools are a powerful resource, but they have a barrier to entry. MOSE aims to remove this barrier and make post exploitation more approachable by providing a tool to translate the attacker's desired task into commands executable by the CM infrastructure.",
      "id": 40120,
      "event_type": 40002,
      "title": "MOSE: Using Configuration Management for Evil",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T22:45+0000",
      "start_date": "2019-08-09T22:00+0000"
    },
    {
      "description": "The Cult of the Dead Cow changed the culture of the entire security industry, the attitude of companies who had ignored risks, and even how the feds dealt with hackers. In this session, four key figures from the groupís first 35 years will cover their greatest hits and screw-ups, highlighting the lessons for other hackers out to make a difference.\n\nThey will be questioned by Joseph Menn, whose new book on the group shows how it evolved from a network of bulletin board operators to the standard-bearers of hacker culture. cDc Minister of Propaganda Deth Vegetable and long serving text-file editor Omega will appear for the first time under their real names, covering the groupís formative years and how it handled such recent controversies as WikiLeaks, neo-Nazis, and the presidential candidacy of cDc alum Beto OíRourke.\n\ncDc tech luminaries Zatko and Rioux will discuss the release of Back Orifice at Def Con in 1998, which allowed non-hackers to hijack Windows machines, drawing worldwide attention to the insecurity of Microsoftís operating system, and Riouxís pathbreaking sequel, Back Orifice 2K, which prompted Microsoft to hire hackers as security consultants, including those from Zatko and Riouxís @stake. Zatko will share insights from leading inside the government, where he ran cybersecurity grantmaking at DARPA, the people who brought you the internet. And Rioux will explain whatís possible in the private sector, where he co-founded unicorn Veracode, which dramatically improved code review by major software buyers.",
      "id": 40121,
      "event_type": 40002,
      "title": "Change the World, cDc Style: Cow tips from the first 35 years",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T22:45+0000",
      "start_date": "2019-08-09T22:00+0000"
    },
    {
      "description": "First commercially introduced in 2013, Cisco Trust Anchor module(TAm) is a proprietary hardware security module that is used in a wide range of Cisco products, including enterprise routers, switches and firewalls. TAm is the foundational root of trust that underpins all other Cisco security and trustworthy computing mechanisms in such devices. We disclose two 0-day vulnerabilities and show a remotely exploitable attack chain that reliably bypasses Cisco Trust Anchor. We present an in-depth analysis of the TAm, from both theoretical and applied perspectives. We present a series of architectural and practical flaws of TAm, describe theoretical methods of attack against such flaws. Next, we enumerate limitations in current state-of-the-art offensive capabilities that made the design of TAm seem secure.\n\nUsing Cisco 1001-X series of Trust Anchor enabled routers as a demonstrative platform, we present a detailed analysis of a current implementation of TAm, including results obtained through hardware reverse engineering, Trust Anchor FPGA bitstream analysis, and the reverse engineering of numerous Cisco trustworthy computing mechanisms that depend on TAm. Finally, we present two 0-day vulnerabilities within Cisco IOS and TAm and demonstrate a remotely exploitable attack chain that results in persistent compromise of an up-to-date Cisco router. We discuss the implementation of our TAm bypass, which involves novel methods of reliably manipulating FPGA functionality through bitstream analysis and modification while circumventing the need to perform RTL reconstruction. The use of our methods of manipulation creates numerous possibilities in the exploitation of embedded systems that use FPGAs. While this presentation focuses on the use of our FPGA manipulation techniques in the context of Cisco Trust Anchor, we briefly discuss other uses of our bitstream modification techniques.",
      "id": 40122,
      "event_type": 40002,
      "title": "100 Seconds of Solitude: Defeating Cisco Trust\nAnchor With FPGA Bitstream Shenanigans",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T22:45+0000",
      "start_date": "2019-08-09T22:00+0000"
    },
    {
      "description": "Active Directory has always been a popular target for attackers, with a constant rise in attack tools attempting to compromise and abuse the main secrets storage of the organization. One of the weakest spots in Active Directory environments lies in the design of one of the oldest authentication protocols ñ NTLM, which is a constant source of newly discovered vulnerabilities. From CVE-2015-0005, to the recent LDAPS Relay vulnerability, it is clear why this protocol is one of the attackersí favorites.\n\nAlthough there are offered mitigations such as server signing, protecting the entire domain from NTLM relay is virtually impossible. If it werenít bad enough already, we will present several new ways to abuse this infamous authentication protocol, including a new critical zero-day vulnerability we have discovered which enables to perform NTLM Relay and take over any machine in the domain, even with the strictest security configuration, while bypassing all of today's offered mitigations. Furthermore, we will present why the risks of this protocol are not limited to the boundaries of the on-premises environment and show another vulnerability which allows to bypass various AD-FS restrictions in order to take over cloud resources as well.",
      "id": 40123,
      "event_type": 40002,
      "title": "Relaying Credentials Has Never Been Easier: How to Easily Bypass the Latest NTLM Relay Mitigations",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T22:45+0000",
      "start_date": "2019-08-09T22:00+0000"
    },
    {
      "description": "Malware authors are always looking for new ways to achieve code injection, thereby allowing them to run their code in remote processes. Code Injection allows hackers to better hide their presence, gain persistence and leverage other processesí data and privileges. \n\nFinding and implementing new, stable methods for code injection is becoming more and more challenging as traditional techniques are now widely detected by various security solutions or limited by native OS protections. \n\nInject-Me is a new method to inject code to a remote process in x64. Inject-Me is in fact ìinjection-lessî ñ the remote (target) process is manipulated to read data from the injecting process, copy and execute it. The manipulation is mainly based on abusing ReadProcessMemory and calling conventions in X64. In addition to presenting Inject-Me, the talk will mention a generalized approach to copying data in remote processes to recreate shellcode from the injecting process.",
      "id": 40124,
      "event_type": 40002,
      "title": "Please Inject Me, a x64 Code Injection",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T23:20+0000",
      "start_date": "2019-08-09T23:00+0000"
    },
    {
      "description": "For the past 3 years d4rkm4tter has been obsessed with monitoring the wireless networks at DEF CON. This talk will take you on a journey through the successes and failures that lead to the creation of the WiFiCactus and the over 1 TB of data captured. A history of each capture project including a summary of the most interesting pieces of data will be shown.\n\nMany people spread a lot of fear, uncertainty and doubt about the wireless environments during DEF CON. This presentation aims to bring some clarity to what is really happening in the airwaves during one of the largest hacker conferences in the world. This will include presenting data on the attacks and sensitive information that exists in the airwaves. This presentation will demonstrate the risks of using wireless networks and information leaks that can be captured by anyone who is passively listening. Countermeasures and protection strategies will be provided to help you avoid having your data captured by those who might be listening. \n\nWith the number of connected devices around us, there has never been a better time to start wardriving or warwalking. Everyone is capable of profiling wireless data around them thanks to cheap hardware and open source tools. As hackers it is important for us to discover issues and vulnerabilities while validating claims of security by software and hardware vendors. Monitoring wireless communication is a great way to start validating those claims. All of the hardware and methods used will be provided so that anyone can do this type of monitoring on their own. Hack the Planet!",
      "id": 40125,
      "event_type": 40002,
      "title": "I Know What You Did Last Summer: 3 Years of Wireless Monitoring at DEF CON",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T23:20+0000",
      "start_date": "2019-08-09T23:00+0000"
    },
    {
      "description": "Surveillance detection routes are a daily occurrence for clandestine operatives and agents all over the world. These mentally taxing counter-surveillance measures often mean the difference between life and death. Surveillance Detection Scout hopes to ease that burden. Scout currently supports Tesla Models S, 3 and X, running license plate recognition on 3 camera feeds to alert you in real time if you're being followed. When you park, Scout remains vigilant, implementing familiar face detection as well. By combining timestamped vehicle location data & video, computer vision and an intuitive web interface, it becomes apparent that Scout has just as many offensive as defensive applications. Over time, SDS captures and reports on observed patterns of life, allowing you to quickly gain an overview of your surroundings (or your target) with minimal effort. Whether you're conducting or evading surveillance, Scout has got your 6.",
      "id": 40126,
      "event_type": 40002,
      "title": "Surveillance Detection Scout - Your Lookout on Autopilot",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T23:20+0000",
      "start_date": "2019-08-09T23:00+0000"
    },
    {
      "description": "Return-oriented Programming (ROP) has been the predominate code-reuse attack for over a decade, but there are other options. Many mitigations can detect ROP due to heuristics, but these fail to detect Jump-oriented Programming (JOP). The JOP ROCKET is a reverse engineering framework dedicated to facilitating JOP exploits. It allows hackers to discover JOP gadgets. This includes dispatcher gadget's, which helps to subvert and direct the control flow, and functional gadgets, our primitives. This tool provides numerous options to give hackers flexibility on how to find gadgets, to narrow and expand possibilities. Additionally, the tool uses opcode-splitting to discover many unintended gadgets. All gadgets are classified based on operation as well as registers used and affected. Thus, hackers could easily obtain the desired functional gadgets, such as MOV EBX, [VALUE], using simple language commands. Because of JOP's much more complex set up, the tool provides this classification, so time isnít wasted hunting through results.\n\nJOP is rarely done in the wild. Part of that complexity is in set up, but another part is the lack of dedicated tools. Having to find JOP gadgets manually could be time-consuming and require expertise. JOP ROCKET simplifies that, allowing the JOP gadgets to be found quickly and easily.\n\nThis talk will give brief content on ROP, and then it introduces JOP and its history. Then we will dive into JOP ROCKET, discussing its features, how to use it to find JOP gadgets, and how to set up your own JOP exploit. We will then demo the tool.",
      "id": 40127,
      "event_type": 40002,
      "title": "The JOP ROCKET: A Supremely Wicked Tool for JOP Gadget Discovery, or What to Do If ROP Is Too Easy",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T23:20+0000",
      "start_date": "2019-08-09T23:00+0000"
    },
    {
      "description": "Ever wonder why the S in SD cards stands for Secure? Well, it turns out that it is possible to read and/or write protect these cards by software using specific commands. As you might expect, this process isnít as \"secure\" as the name implies leading to multiple issues. This talk will present some of these features and the vulnerabilities discovered while poking at cards from various manufacturers. The equipment used in this talk is quite easily attainable allowing for easy replication and learning about these attacks.",
      "id": 40128,
      "event_type": 40002,
      "title": "Poking the S in SD cards",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T23:50+0000",
      "start_date": "2019-08-09T23:30+0000"
    },
    {
      "description": "Amidst the current public outcry about privacy abuses by corporate america, one sector has received far less scrutiny than it deserves: phone companies. Americaís phone companies have a hideous track record on privacy. During the past two decades, these descendants of ìMa Bellî have been caught, repeatedly, selling (or giving away) their customersí sensitive data to the government, bounty hunters, private investigators, data brokers, and stalkers.\n\nThe DEFCON community is familiar with the phone companiesí role in the Bush-era ìwarrantless wiretappingî program and the NSAís surveillance of telephone metadata, revealed by Edward Snowden. Far fewer people know that the carriers were also willing participants in a massive Drug Enforcement Administration (DEA) spying program, which the government quietly shut down after two decades in 2013. \n \nEven less well-understood is how these corporations reap profits by selling our information to the private sector. As just one example, the carriers for years used shady middlemen to provide nearly unlimited access to Americansí location data to anyone with a credit card.\n\nJoin Oregon Senator Ron Wyden to learn why the phone companies have gotten one free pass after another, and what heís doing to hold them accountable.",
      "id": 40129,
      "event_type": 40002,
      "title": "Can You Track Me Now? Why The Phone Companies Are Such A Privacy Disaster",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T23:50+0000",
      "start_date": "2019-08-09T23:30+0000"
    },
    {
      "description": "Reverse engineering is critical to exploitation.  However, going through the process of reverse engineering can often lead to a great deal more than just uncovering a bug.  So much so that you might find what you need for exploitation even if you don't find a bug.\n\nThatís right.  If you go through object data, object representation, object states, and state changes enough you can find out quite a lot.  Yes.  Poor application logic is a bitch.  Just ask any application penetration tester.  This time it is not the magstripe.  Itís appsec and you will get to see how application attacks can be used against a hardware platform.\n\nIn this talk, I will go through the journey that I took in reverse engineering the public transportation system of an east asian mega-city, the questions that I asked as I wondered ìHow does this work?î, the experiments that I ran to answers those questions, what I learned that lead me to an exploit capable of generating millions of dollars in fake tickets for that very same system, and how other designers can avoid the same fate.  Not without risk, this research was done under a junta so I will also be telling you how I kept myself out of jail while doing it.  Please join me.  You wonít want to miss it.",
      "id": 40130,
      "event_type": 40002,
      "title": "Breaking The Back End!† It Is Not Always A Bug.† Sometimes, It Is Just Bad Design!",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T23:50+0000",
      "start_date": "2019-08-09T23:30+0000"
    },
    {
      "description": "We show practical attacks against OpenPGP and S/MIME encryption and digital signatures in the context of email. Instead of targeting the underlying cryptographic primitives, our attacks abuse legitimate features of the MIME standard and HTML, as supported by email clients, to deceive the user regarding the actual message content. We demonstrate how the attacker can unknowingly abuse the user as a decryption oracle by replying to an unsuspicious looking email. Using this technique, the plaintext of hundreds of encrypted emails can be leaked at once. Furthermore, we show how users could be tricked into signing arbitrary text by replying to emails containing CSS conditional rules. An evaluation shows that 17 out of 19 OpenPGP-capable email clients, as well as 21 out of 22 clients supporting S/MIME, are vulnerable to at least one attack. We provide different countermeasures and discuss their advantages and disadvantages",
      "id": 40131,
      "event_type": 40002,
      "title": "Re: What's up Johnny? ñ Covert Content Attacks on Email End-to-End Encryption",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-09T23:50+0000",
      "start_date": "2019-08-09T23:30+0000"
    },
    {
      "description": "Technologyís promise flows within medicine like blood through veins. With every drip of life-saving medicine given to the smallest babies, with every paced beat of a broken heart, connected tech has changed the way we treat patients and offers near limitless potential to improve our health and wellness. But itís taken an army of dedicated protectors to ensure that such promise isnít outweighed by peril- and hackers are fighting on the front lines to safeguard medical devices and infrastructure so they remain worthy of our trust. Join docs quaddi and r3plicant as they once again curate a selection of medicineís finest hackers and allies for D0 N0 H4RM- the uniquely DEF CON conversation between the unsung heroes in the healthcare space- security researchers and advocates working to protect patients one broken med device at a time. Spun from an off-con hotel room gathering between friends into progressively in demand talks at DC 25 and 26, weíve returned to bring you insight and inspiration- divorced from the spin and formality of an increasingly industry-saturated landscape- from the people whose primary goal is to kick ass and save lives.",
      "id": 40132,
      "event_type": 40002,
      "title": "D0 N0 H4RM: A Healthcare Security Conversation",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40007,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T05:00+0000",
      "start_date": "2019-08-10T03:00+0000"
    },
    {
      "description": "Do you love DEF CON? Do you hate having to wait for it all year? Well, thanks to DEF CON groups, you're able to carry the spirit of DEF CON with you year round, and with local people, transcending borders, languages, and anything else that may separate us!In this fireside chat, your DEF CON groups team who works behind the scenes to make DCG possible will invite group leaders to share how they started their groups, how they found meeting space, how they decide what content to present each meeting, and other topics. Potential new group leaders can find out how to start and run a local group, and existing group leaders and members can share and get operational ideas for running the best group possible. During the Fireside chat, we'll have the ability to keep it an open forum for questions and ideas, as well as a great opportunity to meet other groups.",
      "id": 40133,
      "event_type": 40002,
      "title": "Panel: DEF CON Groups",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40007,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T06:00+0000",
      "start_date": "2019-08-10T05:15+0000"
    },
    {
      "description": "Historically, hypervisors have existed in the cloud for efficient utilization of resources, space, and money. \n\nThe isolation feature is one of the reasons hypervisors are heavily moving to other ecosystems, like Automobiles, so that for example, if an Infotainment crashes, it does not affect other sensitive ECUs like ADAS. Blackberry QNX and AGL announced the use of hypervisors in their deployments on Cars.\n\nThe trending is real, but there is a big challenge! Most of the systems in Cars and Medical devices run on ARM, plus, protection at the hypervisor level is still limited. So, is it possible to have a framework that runs at the hypervisor level, able to monitor at the OS level and most important, capable to identify and kill threats coming into the monitored devices?\n\nDuring this talk we will walk you through the steps needed to setup a framework running on Xilinx ZCU102 board able to monitor ARM-based devices and to kill malicious threats identified. Also will discuss challenges on syscall monitoring, single-stepping limitations, techniques to stay stealthy, techniques to detect and kill traditional malware seen in enterprise like Ransomware, Heap Exploits and capabilities on VM Escape attacks and feasibilty to detect Spectre-like exploits.",
      "id": 40134,
      "event_type": 40002,
      "title": "Weaponizing Hypervisors to Fight and Beat Car and Medical Devices Attacks",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T17:45+0000",
      "start_date": "2019-08-10T17:00+0000"
    },
    {
      "description": "Buying Supreme is even harder when most of your competitors are AI. The era of bot purchasing has arrived and more often than not, purchasing shoes, shirts, and swag, requires shell scripting. We will look at how simplistic (and how complicated) purchasing bots have become, how to write them, and what companies are trying to do to fight them, and why theyíre failing at conquering the machines.",
      "id": 40135,
      "event_type": 40002,
      "title": "Rise of the Hypebots: Scripting Streetwear",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T17:45+0000",
      "start_date": "2019-08-10T17:00+0000"
    },
    {
      "description": "Computer security is now a public policy issue. Election security, blockchain, \"going dark,\" the vulnerabilities equities debate, IoT safety , data privacy, algorithmic security and fairness, critical infrastructure: these are all important public policy issues with a strong Internet security component. But while an understanding of the technology involved is fundamental to crafting good policy, there is little involvement of technologists in policy discussions. This is not sustainable. We need public-interest technologists: people from our fields helping craft policy, and working to provide security to agencies and groups working in the broader public interest. We need these people in government, at NGOs, teaching at universities, as part of the press, and inside private companies. This is increasingly critical to both public safety and overall social welfare. This talk both describes the current state of public-interest technology, and offers a way forward for us individually and collectively for our field. The defining policy question of the Internet age is this: How much of our lives should be governed by technology, and under what terms? We need to be involved in that debate.",
      "id": 40136,
      "event_type": 40002,
      "title": "Information Security in the Public Interest",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T17:45+0000",
      "start_date": "2019-08-10T17:00+0000"
    },
    {
      "description": "Thereís a new, largely unaddressed threat in the security industry today, Endpoint Detection and Response (EDR), which aims to stop threat actors in their tracks. The scenario plays out like this... At first your campaign is going well and your attacker objectives are being met. Then, your lovingly crafted payloads become analyst samples, youíre evicted from the environment and you lose your persistence. You and the analyst are now having a bad time. You may feel this is just fear mongering, but we assure you, the risk is real.Fortunately, we have a few new tricks up our sleeves to keep this nightmare scenario at bay.  While many would have you believe that we live in a measured and signed boot Utopia on modern systems, we will show you the seedy underbelly of this Brave New World. By abusing early boot mechanisms and UEFI platform firmware, we are able to evade common detection. By showing up early to the fight, we sucker punch EDR, leaving it in a daze unable to see our malicious activities. We put a new twist on old code injection techniques and maintain persistence in UEFI firmware, making an effective invisibility cloak. By leveraging these two techniques, you and the analyst can have a happy and relaxing evening. From that point on - the good olí days are back again! Plunder away!",
      "id": 40137,
      "event_type": 40002,
      "title": "EDR Is Coming; Hide Yo Sh!t",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T17:45+0000",
      "start_date": "2019-08-10T17:00+0000"
    },
    {
      "description": "For many of us, our cars are one of the largest purchases we will ever make. In an always connected world it is natural that we would want to have the convenience of being able to remotely monitor our vehicles: to do everything from remind ourselves exactly where exactly we parked, verify we locked our vehicle, or even remote start it so it will be warmed up (or cooled down) when we get in. There are a variety of vendors offering aftermarket alarm systems that provide these conveniences and offer a peace of mind. But how much can we trust the vendors of these systems are protecting access to our cars in the digital domain? In this talk, Jmaxxz will tell the story of what he found when he looked into one such system.",
      "id": 40138,
      "event_type": 40002,
      "title": "Your Car is My Car",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T18:45+0000",
      "start_date": "2019-08-10T18:00+0000"
    },
    {
      "description": "PULL OVER!\nNo, it is a cardigan, but thanks for noticing! After getting a nasty speeding ticket, OG SecKC HA/KC/ER hevnsnt decided enough was enough, and set out to fully understand police speed measurement devices, and develop homebrew countermeasures that are legal in some states (and some that are not). Come learn how police RF (X, K, KA) and Laser speed detection systems work and how to implement your own homebrew jamming countermeasures on the cheap, essentially making your vehicle invisible to law enforcement. HOP IN and BUCKLE UP, this talk is going to FUEL your hardware hacking desires! You better be able to think fast to keep up with this talk and prepare to get home in record time.",
      "id": 40139,
      "event_type": 40002,
      "title": "HAKC THE POLICE",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T18:45+0000",
      "start_date": "2019-08-10T18:00+0000"
    },
    {
      "description": "Companies are coming for your brains.  The electricity in your brains, to be more precise. Valve, Facebook, Elon Musk and more are funding research into technologies that will translate neural signals into controls for devices like computers, smartphones, and VR/AR environments.  While this would be super exciting, it represents some serious data privacy issues.  First: what kind of private information can be elicited from your neural signals?  Itís possible to use a specific kind of neural response to visual and audio stimuli to deduce information about the userÖ like where you bank, who you know, your real identity, etc (Edward Nygma in Batman Forever, anyone?)  \nMore broadly, there is also the issue of what happens when you provide your neural signals to a company.  If youíre worried about what Facebook is doing with your information now, imagine what they can do when they have hours of information straight from your brain.  If neural data is treated the same as your DNA, commercial companies become the owners of your thoughts (as electrical signals).  Will they readily share it with the FBI without probable cause?  These kinds of questions, and many more, are starting to surface with neurally-controlled devices and other emerging technologies.  This talk will cover all of this and more.",
      "id": 40140,
      "event_type": 40002,
      "title": "Hacking Your Thoughts - Batman Forever meets Black Mirror",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T18:45+0000",
      "start_date": "2019-08-10T18:00+0000"
    },
    {
      "description": "Mobile app hacking peaked in 2015 with tools like keychain-dumper & ssl-kill-switch released but requiring jailbroken/rooted devices. Back then, wresting the power to understand & modify apps on our devices from dystopian looking mega corps was our cause. As jailbreaks became infrequent, the hackersí arsenal was left behind. While this is progress against dark uses of hacking, done to protect our freedom fighters, how can hackers still hold power to account? Can we still find flaws in apps/devices & live up to the protections the technology promises? \n\nEnter runtime binary instrumentation with Frida. Itís possible to analyze apps in their final state when executed on real hardware running the latest iOS/Android with no jailbreaks. This fills a gap between source analysis & debuggers. But, simply enumerating app classes requires studying multiple blogs & a deep read of the docs. We created Objection to simplify this & hide the boilerplate so hackers could focus on unravelling apps. But, many people still rely on simple hacks & automation & rarely use new advanced techniques such as reflectively inspecting live heap objects, canary execution tracing, runtime memory edits and filesystem exploration.\n\nWeíll show hackers, malware researchers & security engineers how to use these advanced mobile hacking techniques.",
      "id": 40141,
      "event_type": 40002,
      "title": "Meticulously Modern Mobile Manipulations",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T18:45+0000",
      "start_date": "2019-08-10T18:00+0000"
    },
    {
      "description": "Major US telecommunications companies AT&T, T-Mobile, and Sprint have been quietly selling access to their customersí real-time location data, including cell tower information as well as highly precise GPS data. Through a complex network of dodgy data aggregators and middlemen companies, this data access eventually trickled down to a slew of different industries, used car salesman, landlords, and hundreds of bounty hunters, likely without your knowledge or informed consent. In this talk, based on leaked documents, sources, and first hand experience, Joseph will explain how this data industry works, the players involved, and also how the data access is available on the black market, where it can be used in any way an attacker fancies: Joseph paid a source $300 to successfully locate a phone in New York.",
      "id": 40142,
      "event_type": 40002,
      "title": "How You Can Buy AT&T, T-Mobile, and Sprint Real-Time Location Data on the Black Market",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T19:45+0000",
      "start_date": "2019-08-10T19:00+0000"
    },
    {
      "description": "Bluetooth Low energy version 5 has been published in late 2016, but we still have no sniffer supporting this specific version (and not that much compatible devices as well). The problem is this new version introduces a new channel hopping algorithm that renders previous sniffing tools useless as devices can no longer be attacked and connections analyzed. This new algorithm is based on a brand new pseudo-random number generator (PRNG) to provide better collision avoidance while kicking out all of our good old sniffing tools.\n\nUnless some random hacker manages to break this not-that-strong PRNG and upgrades his BLE sniffing tool to support this algorithm ;). In this talk, we will explain why this PRNG is vulnerable and how it can be easily defeated to sniff and jam communications between two BLE 5 devices. A new version of BtleJack will be released during this talk, providing an efficient way to sniff BLE 5 connections to our fellow IoT hacker family.",
      "id": 40143,
      "event_type": 40002,
      "title": "Defeating Bluetooth Low Energy 5 PRNG for Fun and Jamming",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T19:45+0000",
      "start_date": "2019-08-10T19:00+0000"
    },
    {
      "description": "The security of common enterprise infrastructure devices such as desktops and laptops has advanced over the years through incremental improvements in operating system and endpoint security. However, security controls for network devices such as enterprise printers are often ignored and thus present a greater potential for exploitation and compromise by threat actors seeking to gain a persistent foothold on target organisations.\n\nIn order to assess the current state of mainstream enterprise printer product security and to challenge common assumptions made about the security of these devices, which sit on key parts of enterprise networks and process sensitive data, we set out on a vulnerability and exploitation research project of six known vendors. We were able to find remote vulnerabilities in all printers tested through various attack vectors, revealing a large number of 0-day vulnerabilities in the process.\n\nIn this talk we walk through the entire research engagement, from initial phases such as threat modelling to understand printer attack surfaces to the development of attack methodologies and fuzzing tools used to target printer-specific protocols and functions. Besides of remarking important vulnerabilities found and their respective CVEís, proof of concept exploits showing how it is possible to gain full control of printers and all of the data they manage will be presented. This will show how to use enterprise printers as a method of persistence on a network, perhaps to exfiltrate sensitive data or support C2 persistence on Red Team engagements.\n\nWe also address a number of challenges that researchers can face when performing vulnerability research on devices such as printers and how we used different techniques to overcome these challenges, working with limited to no debugging and triage capabilities. We also present mitigations that printer manufacturers can implement in order to reduce printer attack surfaces and render exploitation more difficult.",
      "id": 40144,
      "event_type": 40002,
      "title": "Why You Should Fear Your ìmundaneî Office Equipment",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T19:45+0000",
      "start_date": "2019-08-10T19:00+0000"
    },
    {
      "description": "EDR solutions have landed in Linux. With the ever increasing footprint of Linux machines deployed in data centers, offensive operators have to answer the call. \n\nIn the first part of the talk we will share practical tips and techniques hackers can use to slide under the EDR radar, and expand post-exploitation capabilities.\n\nWe will see how approved executables could be used as decoys to execute foreign functionality. We will walk through the process of using well known capabilities of the dynamic loader. We will take lessons from user-land root-kits in evasion choices.\n\nPart two will focus on weaponizing the capabilities. We will show how to create custom preloaders, and use mimicry to hide modular malware in memory. We will create a \"Preloader-as-a-Service\" capability of sorts by abstracting storage of modular malware from its executing cradles. This PaaS is free to you though!\n\nWe fully believe the ability to retool in the field matters, so we have packaged the techniques into reusable code patterns in a toolkit you will be able to use (or base your own code on) after it is released. \n\nThis talk is for hackers, offensive operators, malware analysts and system defenders. We sincerely hope defensive hackers can attend and also have fun.",
      "id": 40145,
      "event_type": 40002,
      "title": "Zombie Ant Farm: Practical Tips for Playing Hide and Seek with Linux EDRs",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T19:45+0000",
      "start_date": "2019-08-10T19:00+0000"
    },
    {
      "description": "User rights and privileges are a part of the access control model in Active Directory. Applicable only at the local computer level, a user generally has different rights (through access tokens) on different machines in a domain. Another part of the access control model is security descriptors (ACLs) that protects a securable object. At the domain level, ACL abuse is well known and adversaries have used it for persistence. For user rights, the abuse is mostly with the help of groups (memberships, SID History etc.) or misconfigured delegated rights. \n\nA lesser-known area of abuse and offensive research is a combination of minimal Rights and ACE (hence the term RACE). Often overlooked in audits and assessments, using minimal rights along with favourable ACEs provides a very interesting technique of persistence and on-demand privilege escalation on a Windows machine with much desired stealth.\nThis talk covers interesting domain privilege escalation, persistence and backdoor techniques with the help of ACLs, minimal user rights and combinations of both. We will discuss how these techniques can be applied using open source tools and scripts. The talk also covers how to detect and mitigate such attacks. \n\nThe talk will be full of live demonstrations.",
      "id": 40146,
      "event_type": 40002,
      "title": "RACE - Minimal Rights and ACE for Active Directory Dominance",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T20:45+0000",
      "start_date": "2019-08-10T20:00+0000"
    },
    {
      "description": "The presentation demonstrates that the security of the A5/1 and A5/3 ciphers used to protect cellular calls are vulnerable to compromise leading to full decryption of GSM communications, using freely available open source solutions along with our tools we developed for this task.\n\nThe flaw being exploited lies in the heart of the design of GSM. In all implementations the standard requires GSM messages to first be error control encoded using a convolutional code and then encrypted. In the vast majority of implementations used today, encryption is performed using the A5/1 or A5/3 cipher. The convolutional code adds redundancy to the transmitted message, which can act like a fingerprint to identify the key used to encrypt the GSM message.\n\nTo exploit the vulnerability an attacker simply needs to capture a transmission and identify the GSM channel used. The standard defines the convolutional code and therefore how the redundancy may be interpreted to recover the encryption key.\n\nThis presentation considers passively capturing GSM traffic using A5/3 encryption and demonstrates a novel solution to cracking the key used without interacting with the mobile or network.",
      "id": 40147,
      "event_type": 40002,
      "title": "GSM: We Can Hear Everyone Now!",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T20:45+0000",
      "start_date": "2019-08-10T20:00+0000"
    },
    {
      "description": "This talk covers tag-side attacks against NFC communication protocols, including cracking of Mifare encryption keys and performing targeted attacks against NFC readers. In addition, it will cover the design and creation of devices capable of emulating NFC tags down to the raw protocol using standard components and tools, with no abstraction to dedicated hardware, covering and expanding on the capabilities of available products. This talk will contain how 13.56MHz NFC works at a raw level, how tools can be built for analysing it, how the protocol can be implemented in full on standard Microcontrollers, and the security weaknesses present in its design.",
      "id": 40148,
      "event_type": 40002,
      "title": "Tag-side attacks against NFC",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T20:45+0000",
      "start_date": "2019-08-10T20:00+0000"
    },
    {
      "description": "It is the year 2019. Humanity has almost won its long-standing war against Single-Sign On (SSO) bugs. The last of them were discovered and eradicated some time ago and the world is now living in an era of prosperity while the Auth Federation enjoys peaceful CVE-free times. However, while things seem to be running smoothly, new bugs are brewing at the core of major implementation libraries. This is probably the last chance for the evil empire to launch a world scale attack against the Auth Federation. \n\nIn this talk, we will present two new techniques: \n    1) A new breed of SAML implementation flaws that break XML signature validation and enable arbitrary modification of the SAML assertion, which enables attackers to authenticate as arbitrary users or grant themselves arbitrary authorization claims. Although any implementation may be affected by this flaw, we will show how it affects Microsoft Windows Identity Framework (WIF) applications, Windows Communication Foundation (WCF) web services, and flagship products such as SharePoint and Exchange Servers. \n    2) A bug in the .NET crypto library, which may allow attackers to gain Remote Code Execution (RCE) or Denial of Service (DoS) depending on the availability of code gadgets in the target server. \n\nA new tool to detect this type of vulnerability will also be discussed and released.",
      "id": 40149,
      "event_type": 40002,
      "title": "SSO Wars: The Token Menace",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T20:45+0000",
      "start_date": "2019-08-10T20:00+0000"
    },
    {
      "description": "Everyone knows that databases are the crown jewels from a hacker's point of view, but what if you could use a database as the hacking tool itself? We discovered that simply querying a malicious SQLite database - can lead to Remote Code Execution. We used undocumented SQLite3 behavior and memory corruption vulnerabilities to take advantage of the assumption that querying a database is safe.\n\nHow? We created a rogue SQLite database that exploits the software used to open it.Exploring only a few of the possibilities this presents weíll pwn password stealer backends while they parse credentials files and achieve iOS persistency by replacing its Contacts databaseÖ\n\nThe landscape is endless (Hint: Did someone say Windows 10 0-day?). This is extremely terrifying since SQLite3 is now practically built-in to any modern system.\n\nIn our talk we also discuss the SQLite internals and our novel approach for abusing them. We had to invent our own ROP chain technique using nothing but SQL CREATE statements. We used JOIN statements for Heap Spray and SELECT subqueries for x64 pointer unpacking and arithmetics. It's a new world of using the familiar Structured Query Language for exploitation primitives,laying the foundations for a generic leverage of memory corruption issues in database engines.",
      "id": 40150,
      "event_type": 40002,
      "title": "SELECT code_execution FROM * USING SQLite; -- Gaining code execution using a malicious SQLite database",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T21:45+0000",
      "start_date": "2019-08-10T21:00+0000"
    },
    {
      "description": "If toasters talking to fridges is no joke to you, then you are aware of the big Internet of Things hype these days. While all kind of devices get connected and hacked, one of the oldest class of IoT devices seems to be forgotten even though it is literally everywhere - VoIP phones.\n\nFor configuration and management purposes, VoIP phones run a web application locally on the device. We found several critical bugs (reported CVEs) in the web application as well as in the webserver which enabled us to hijack the phones. Starting with simple XSS and CSRF issues, via command injections and memory corruptions right through to remote code executions, all popular vulnerability classes can be found on those devices.\n\nWe will present our findings together with the tools and strategies we used, and will enable you to do the same with your own phones and other IoT devices.\n\nFurther, we will provide helpful ARM shell code patterns, scripts and tricks which hackers can use to find bugs. We will conclude our talk by showing that automatic tools fail to discover such vulnerabilities. Therefore, manual IoT pentesting is still required.\n\nIf you think these management interfaces are not exposed to the internet, you are wrong. In a scan, we found thousands of reachable phones vulnerable to our exploits.",
      "id": 40151,
      "event_type": 40002,
      "title": "I'm on your phone, listening - Attacking VoIP Configuration Interfaces",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T21:45+0000",
      "start_date": "2019-08-10T21:00+0000"
    },
    {
      "description": "Fuzzing remains to be the most effective technique for bugs hunting in memory-unsafe programs. Last year, hundreds of security papers and talks on fuzzing have been published and dozens of them were focused on adapting or improving American Fuzzy Lop in some way. Attracting with its simplicity and efficiency, AFL is the number one choice for the vast majority of security researchers. This high popularity means that hunting for bugs with AFL or a similar tool is becoming less and less fruitful since many projects are already covered by other researchers. It is especially hard when we talk about a project participating in Google OSS-Fuzz program which utilizes AFL to generate a half-trillion test cases per day.\n\nIn practice, this means that we can not blindly rely on AFL anymore and should search for better fuzzing techniques. In order to overcome this challenge, we need to understand how AFL and similar fuzzers work and be able to use their weaknesses to find new 0days. This talk is aimed to discuss these weaknesses on real examples, explain how we can do fuzzing better and release a new open-source fuzzer called Manul.\n\nManul is a high-scalable coverage-guided parallel fuzzer with the ability to search for bugs in open source and black box binaries on Windows and Linux. Manul was able to find 10 0-days in 4 widely-used projects that have been extensively tested by AFL. These vulnerabilities were not found by chance, but by analyzing and addressing issues exist in AFL. Authors will show several of the most critical vulnerabilities and explain why AFL overlooked them.\n\nThis talk will be interested for experienced hackers, who are willing to improve their bug hunting capabilities, as well as for new researchers, who are making their first steps on the thorny trail of bug hunting.",
      "id": 40152,
      "event_type": 40002,
      "title": "Zero bugs found? Hold my Beer AFL! How To Improve Coverage-Guided Fuzzing and Find New 0days in Tough Targets",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T21:45+0000",
      "start_date": "2019-08-10T21:00+0000"
    },
    {
      "description": "The capability to emulate x86 and other architectures has been around for some time. Malware analysts have several tools readily available in the public domain. However, most of the tools stop short of full emulation, halting or doing strange things when emulating library functions or system calls not implemented in the emulator. In this talk we introduce a new tool into the public domain, Binee, a Windows Process emulator. Binee creates a nearly identical Windows process memory model inside the emulator, including all dynamically loaded libraries and other Windows process structures. Binee mimics much of the OS kernel and outputs a detailed description of all function calls with human readable parameters through the duration of the process. We've designed Binee with two primary use cases in mind; data extraction at scale with a cost and speed similar to common static analysis tools, and second, for malware analysts that need a custom operating system and framework without the overhead of spinning up various configurations of virtual machines. Currently Binee can run on Windows, OS X, and Linux.",
      "id": 40153,
      "event_type": 40002,
      "title": "Next Generation Process Emulation with Binee",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T21:45+0000",
      "start_date": "2019-08-10T21:00+0000"
    },
    {
      "description": "For software to communicate with hardware, it needs to talk to a kernel-mode driver that serves as a middle-man between the two, helping to make sure everything operates as it should. In Windows that is done using the Kernel-Mode Driver Framework (KMDF).\n\nThese drivers are used to control everything in your computer, from small things like CPU fan speed, color of your motherboard LED lights, up to flashing a new BIOS.\n\nHowever, as the code in these drivers runs with the same privileges as the rest of the kernel, malicious drivers can be used to compromise the security of the platform. To that end, Microsoft relies on WHQL, code signing, and EV Signing to prevent drivers which have not been approved by Microsoft from being loaded into the kernel.\n\nUnfortunately, security vulnerabilities in signed drivers can be used to as a proxy to read and write hardware resources such as kernel memory, internal CPU configuration registers, PCI devices, and more. These helpful driver capabilities can even be misused to bypass and disable Windows protection mechanisms.\n\nLet us teach you how these drivers work, show you the unbelievable risk they pose, and enjoy our walk of shame as we parade all the silly and irresponsible things we discovered in our research.",
      "id": 40154,
      "event_type": 40002,
      "title": "Get Off the Kernel if You Canít Drive",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T22:45+0000",
      "start_date": "2019-08-10T22:00+0000"
    },
    {
      "description": "ì5G is comingî (apparently). That probably means, over the next few years, more and more people are going to be using more and more cellular-connected devices for their day-to-day TCP/IP activities.\n\nThe problem is, a lot of existing 4G modems and routers are pretty insecure. We found critical remotely-exploitable flaws in a selection of devices from variety of vendors, without having to do too much work. Plus, thereís only a small pool of OEMs working seriously with cellular technologies, and their hardware (& software dependencies) can be found running in all sorts of places. Their old 4G, 3G and even 2G-era code is going to be running in these 5G-capable devices.\n\nWith a small sample of consumer 4G routers as examples, weíre going to talk about how malleable, frustrating, and insecure these devices are. Weíll run through a few examples of existing 4G routers, from low-end bargain-basement end-of-life-never-to-be-fixed to higher-end devices. root is a means to an end, rather than the goal.",
      "id": 40155,
      "event_type": 40002,
      "title": "Reverse-Engineering 4g Hotspots for Fun, Bugs and Net Financial Loss",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T22:45+0000",
      "start_date": "2019-08-10T22:00+0000"
    },
    {
      "description": "Do you want to know how you can exploit DNS rebinding 10x faster, bypass prevention mechanisms, interactively browse the victim's internal network, and automate the whole process during your next red team exercise?\n \nThis talk will teach you how and give you an easy-to-use tool to do it.\n \nFirst, we will cover in detail the subtleties that make DNS rebinding attacks more effective in practice, including techniques and operational conditions that make it faster and more reliable. We'll also explain how to bypass commonly recommended security controls, dispelling attack and defense misconceptions that have been disseminated in blogs and social media posts.\n \nThis talk will include a number of demos using Singularity, our open source DNS rebinding attack framework that includes all the parts you need to get started pwning today, including:\n- Remote code execution and exfiltration payloads for common dev tools and software\n- Practical scanning and automation techniques to maximize the chance of controlling targeted services\n \nWe'll also show an interesting post-exploitation technique that allows you to browse a victim browser network environment via the attacker's browser without the use of HTTP proxies.\n \nYou'll leave this talk with the knowledge and tools to immediately start finding and exploiting DNS rebinding bugs.",
      "id": 40156,
      "event_type": 40002,
      "title": "State of DNS Rebinding - Attack & Prevention Techniques and the Singularity of Origin",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T22:45+0000",
      "start_date": "2019-08-10T22:00+0000"
    },
    {
      "description": ".NET malware is well-known by security analysts, but even existing many tools such as dnSpy,.NET Reflector, de4dot and so on to make the analysis easier, most professionals have used them as a black box tool, without concerning to .NET internals, structures, MSIL coding and details. In critical cases, it is necessary have enough knowledge about internal mechanisms and to debug these .NET threats using WinDbg.\n\nUnfortunately, .NET malware samples have become very challenger because it is so complicated to deobfuscated associated resources, as unpacking and dumping them from memory. Furthermore, most GUI debugging tools does an inside view of mechanisms such as CRL Loader, Managed Heap, Synchronization issues and Garbage Collection.\n\nIn the other side, .NET malware threats are incredibly interesting when analyzed from the MSIL instruction code, which allows to see code injections using .MSIL and attempts to compromise .NET Runtime keep being a real concern.\n\nThe purpose of this presentation is to help professionals to understand .NET malware threats and techniques by explaining concepts about .NET internals, mechanisms and few reversing techniques.",
      "id": 40157,
      "event_type": 40002,
      "title": ".NET Malware Threats: Internals And Reversing",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T22:45+0000",
      "start_date": "2019-08-10T22:00+0000"
    },
    {
      "description": "Brent provides a live demonstration reversing engineering 17 or more unknown passenger vehicle CAN networks in under 10 minutes using new automated techniques. These unsupervised techniques are over 90% accurate and consistent when tested using production CAN networks and different driving conditions. He then introduces the Python and R code used for the demo and posted to his public GitHub repository at https://github.com/brent-stone/CAN_Reverse_Engineering. The Dissertation explaining how the code works is also posted.",
      "id": 40158,
      "event_type": 40002,
      "title": "Reverse Engineering 17+ Cars in Less Than 10 Minutes",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T23:20+0000",
      "start_date": "2019-08-10T23:00+0000"
    },
    {
      "description": "It's been a while, something like DEF CON 19, since we had the chance to have more than a few minutes at closing ceremonies to talk to everyone about the DEF CON NOC. It is not uncommon for people during the show or throughout the year to come to us asking things here and there about the DEF CON network. Come see all the DEF CON NOC team on stage, yes, those you usually don't see anywhere during the show, because, well, we're making sure packets are flowing and people are interneting. Come learn what we do, how we do it and possibly answer any questions that you might have about the \"most hostile network in the planet\".",
      "id": 40159,
      "event_type": 40002,
      "title": "NOC NOC. Who's there? All. All who? All the things you wanted to know about the DEF CON NOC and we won't tell you about",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T00:45+0000",
      "start_date": "2019-08-10T23:00+0000"
    },
    {
      "description": "In 2018 I somewhat innocently bought very expensive coffee (Nespresso capsules) online from Ebay. What followed was a series of unexpected additional packages from the manufacturer Nespresso and a lurking suspicion that something had gone terribly--if not criminally--wrong as a result of my purchase. This talk chronicles the obnoxious amounts of obsessive research and tracking that became my new hobby--stalking Nespresso fraudsters and my decidedly non-technical attempts at developing a generic search profile and reporting the fraudsters to anyone who would listen, to include : the persons whose identities had been stolen, Nespresso, Ebay, and the FBI. Ultimately I just ended up with a LOT of coffee; a lingering sense that I had committed several crimes; and no faith left in humanity.",
      "id": 40160,
      "event_type": 40002,
      "title": "Confessions of an Nespresso Money Mule: Free Stuff & Triangulation Fraud",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T23:20+0000",
      "start_date": "2019-08-10T23:00+0000"
    },
    {
      "description": "Data collected by vacuum cleaning robot sensors is highly privacy-sensitive, as it includes details and metadata about consumersí habits, how they live, when they work or invite friends, and more. Connected vacuum robots are not as low-budget as other IoT devices and vendors indeed invest into their security. This makes vacuum cleaning robot ecosystems interesting for further analysis to understand their security mechanisms and derive takeaways.\n\nIn this talk we discuss the security of the well-protected Neato and Vorwerk ecosystems. Their robots run the proprietary QNX operating system, are locally protected with secure boot, and use various mechanisms that ensure authentication and encryption in the cloud communication. Nonetheless, we were able to bypass substantial security components and even gain unauthenticated privileged remote execution on arbitrary robots. We present how we dissected ecosystem components including a selection of vacuum robot firmwares and their cloud interactions.",
      "id": 40161,
      "event_type": 40002,
      "title": "Vacuum Cleaning SecurityóPinky and the Brain Edition",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T23:20+0000",
      "start_date": "2019-08-10T23:00+0000"
    },
    {
      "description": "We are hackers, we won't do as you expect or play by your rules, and we certainly don't trust you. JAR files are really ZIPs...unzip them! So are Microsoft's DOCX, XLSX, PPTX, etc. Let's open them up! macOS applications (.app \"files\") are really directories you can browse?! Sweet, let's do that.\n\nLess well known but similarly prevalent are Flat Package Mac OS X Installer (.pkg) files. These are actually XAR archives that, among other things, contain many plaintext files (including shell, Perl, and Python scripts) as cpio files compressed using gzip.\n\nIn this presentation I'll walk you through extracting the contents of these installer packages, understanding their structure, and seeing how they work while highlighting where security issues can come up. To drive the point home of what can go wrong, I'll include examples of serious security issues I've seen in the wild and show you how they can be exploited to elevate privileges and gain code/command execution.\n\nAfter this talk, .pkg files will no longer be opaque blobs to you. You'll walk away knowing tools and techniques to tear them open, understand how to evaluate what they're really doing on your computer, and a methodology for finding bugs in them. As a final bonus, I'll include a subtle trick or two that can be used on red teams.",
      "id": 40162,
      "event_type": 40002,
      "title": "Unpacking Pkgs: A Look Inside Macos Installer Packages And Common Security Flaws",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T23:50+0000",
      "start_date": "2019-08-10T23:30+0000"
    },
    {
      "description": "It's been a while, something like DEF CON 19, since we had the chance to have more than a few minutes at closing ceremonies to talk to everyone about the DEF CON NOC. It is not uncommon for people during the show or throughout the year to come to us asking things here and there about the DEF CON network. Come see all the DEF CON NOC team on stage, yes, those you usually don't see anywhere during the show, because, well, we're making sure packets are flowing and people are interneting. Come learn what we do, how we do it and possibly answer any questions that you might have about the \"most hostile network in the planet\".",
      "id": 40163,
      "event_type": 40002,
      "title": "NOC NOC. Who's there? All. All who? All the things you wanted to know about the DEF CON NOC and we won't tell you about",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T00:00+0000",
      "start_date": "2019-08-10T23:30+0000"
    },
    {
      "description": "Input sanitization issues will always exist, although itís surprising at how weíre still seeing amateur mistakes being made on everyday applications and systems used by millions. After making some observations against automatic license plate recognition (ALPR) data requested via the freedom of information act (FOIA) while having reminiscent conversations about old hacker tales, it turned on the evil bit, leading to some interesting ideas. Weíll go over this adventure of poking at systems using totally valid user-controlled data that causes unexpected behavior in the real world. Itís always a strange thing when you can ìexploitî unexpected attack surface, due to poor specification, especially in government systems.",
      "id": 40164,
      "event_type": 40002,
      "title": "Go NULL Yourself or: How I Learned to Start Worrying While Getting Fined for Otherís Auto Infractions",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T23:50+0000",
      "start_date": "2019-08-10T23:30+0000"
    },
    {
      "description": "Apache Solr is a search platform used by many enterprise companies to add a full text search functionality to their websites. Often hidden behind firewalls, it provides a rich API to search across large datasets. If this API is used by web applications in a wrong way, it may open a possibility for injection attacks to completely modify the query logic.\n\nIn this talk weíll shed some light on the new type of vulnerabilities for web applications - Solr parameter injection, and provide some useful ways how to achieve remote code execution through it. We also provide exploits for almost all known vulnerabilities for Apache Solr, including the two new RCEs we reported this year.",
      "id": 40165,
      "event_type": 40002,
      "title": "Apache Solr Injection",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-10T23:50+0000",
      "start_date": "2019-08-10T23:30+0000"
    },
    {
      "description": "Join staffers at the Electronic Frontier Foundationóthe nation's premier digital civil liberties group fighting for freedom and privacy in the computer ageófor a candid chat about how the law is racing to catch up with technological change.\n\nThen meet representatives from Electronic Frontier Alliance allied community and campus organizations from across the country. These technologists and advocates are working within their communities to educate and empower their neighbors in the fight for data privacy and digital rights.\n\nThis discussion will include updates on current EFF issues such as the government's effort to undermine encryption (and add backdoors), the fight for network neutrality, discussion of our technology projects to spread encryption across the Web and emails, updates on cases and legislation affecting security research, and much more.\n\nHalf the session will be given over to question-and-answer, so it's your chance to ask EFF questions about the law, surveillance and technology issues that are important to you.",
      "id": 40166,
      "event_type": 40002,
      "title": "Meet the EFF - Meetup Panel",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40007,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T05:00+0000",
      "start_date": "2019-08-11T03:00+0000"
    },
    {
      "description": "In December 2018 INSINIA Security was involved in one of the biggest hacking stories of the year. A number of ìcelebritiesî, including Louis Theroux, Eamon Holmes and more, logged into their Twitter accounts just after Christmas to find a Tweet, from their account, saying: \n\nìThis account has been temporarily hijacked by INSINIA SECURITYî. \n\nThe tweet immediately directed people to our blog post, and the compromised accounts retweeted INSINIAís Tweet, saying:\n\nìThis account is now under the control of @InsiniaSRT. Luckily, this has been H4CK3D to highlight an important vulnerability. The user of this account has NOT lost access to it, no data compromised and is NOT under attack. See how it was doneÖî.\n\nWhat we did was simple. We used spoof texts to Tweet from these accounts. We NEVER had access to these accounts. We could never read DMís. We simply passively controlled these accounts with no opportunity of getting confidential data in return.\n\nSo what did the hacking community, journalists and commentators do?! They LOST THEIR SH*T OVER IT!\n\nìItís unethicalî ìItís a crimeî ìComputer Misuse Act counts for security researchers too!î ìYou guys are total f*cking idiots! \n\nThese are the types of things weíd heard from our peers. But why was the backlash so bad? In this talk, INSINIA explains why it was done, how it was done, how people reacted and how research can be released quickly and responsiblyÖ Without always getting the warm reception you might expect!",
      "id": 40167,
      "event_type": 40002,
      "title": "We Hacked TwitterÖ And the World Lost Their Sh*t Over It!",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40007,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T06:00+0000",
      "start_date": "2019-08-11T05:15+0000"
    },
    {
      "description": "Is targeting microcontrollers worth the effort? Nowadays, they are responsible for controlling a wide range of interesting systems, e.g., physical security systems, carís ECUs, semaphores, elevators, sensors, critical components of industrial systems, some home appliances and even robots.\n\nIn this talk, it will be explained how microcontrollers can be backdoored too. After a quick review of basic knowledge about uC, we will dive into three different approaches to achieve payload injection, from basic to advanced techniques. The first method consists on locating the entry point of the firmware and inject our payload there, this is an easy way to execute it at least once. As a second -and more complex- technique, we will backdoor the EUSART communication injecting a malicious payload at the code routine of that hardware peripheral; we will be able to get the right memory address by inspecting the GIE, PEIE and polling process at the uC interrupt vector. Finally, the third technique allow us to take control of the microcontrollerís program flow by manipulating the stack writing memory addresses at the TOS; with this we can execute a payload made with instructions already written in the original program, performing it just like a ROP-chain technique.",
      "id": 40168,
      "event_type": 40002,
      "title": "Backdooring Hardware Devices By Injecting Malicious Payloads On Microcontrollers",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T17:45+0000",
      "start_date": "2019-08-11T17:00+0000"
    },
    {
      "description": "Analysts believe there are currently on the order of 10 billions Internet of Things (IoT) devices out in the wild. Sometimes, these devices find their way up people's butts: as it turns out, cheap and low-power radio-connected chips aren't just great for home automation - they're also changing the way we interact with sex toys. In this talk, we'll dive into the world of teledildonics and see how connected buttplugs' security holds up against a vaguely motivated attacker, finding and exploiting vulnerabilities at every level of the stack, ultimately allowing us to compromise these toys and the devices they connect to.",
      "id": 40169,
      "event_type": 40002,
      "title": "Adventures In Smart Buttplug Penetration (testing)",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T17:45+0000",
      "start_date": "2019-08-11T17:00+0000"
    },
    {
      "description": "WebAssembly is the newest way to play video games in your web browser. Both Unity3d and Unreal Engine now support WebAssembly, meaning the amount of WebAssembly games available is growing rapidly. Unfortunately the WebAssembly specification is missing some features game hackers might otherwise rely on. In this talk I will demonstrate adapting a number of game hacking techniques to WebAssembly while dealing with the limitations of the specification.\n\nFor reverse engineers, I will show how to build and inject your own \"watchpoints\" for debugging WebAssembly binaries and how to insert symbols into a stripped binary. \n\nFor game hackers, I will show how to use binary instrumentation to implement some old-school game hacking tricks and show off some new ones.\n\nI will be releasing two tools: a binary instrumentation library built for modifying WebAssembly binaries in the browser, and a browser extension that implements common game hacking methods a la Cheat Engine.",
      "id": 40170,
      "event_type": 40002,
      "title": "Hacking WebAssembly Games with Binary Instrumentation",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T17:45+0000",
      "start_date": "2019-08-11T17:00+0000"
    },
    {
      "description": "Nearby sharing apps are very convenient and fast when you want to transfer files and have been pre-installed on billions of devices. However, we found that most of them will also open a door for attackers to steal your files and even more.\n\nFirst, we did a comprehensive research about all top mobile vendors' pre-installed nearby sharing apps by reverse engineering. Many serious vulnerabilities are found on most of them and reported to vendors. Algorithm and design flaws in these apps can lead to file leaking and tampering, privacy leaks, arbitrary file downloads and even remote code execution. We will present all the related vulnerabilities' details and exploit techniques. Next, we conducted the same research on lots of third-party file sharing apps and found that they are even worse about security and are used by surprising more than 1 billion users. Files transferred between them are nearly naked when our MITM attack devices are nearby. Finally, we will summarize all the attack vectors and two common attack models. We will also present the attack demos and related tools.\n\nBesides, we will present our practical mitigations. Currently, we are working with most of the top vendors to mitigate these vulnerabilities. Through this talk, we want to notify users and mobile vendors to pay more attention to this serious situation and fix it better and sooner.",
      "id": 40171,
      "event_type": 40002,
      "title": "Your Secret Files Are Mine: Bug Finding And Exploit Techniques On File Transfer App Of All Top Android Vendors",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T17:45+0000",
      "start_date": "2019-08-11T17:00+0000"
    },
    {
      "description": "Shellcodes are short executable stubs that are used in various attack\nscenarios, whenever code execution is possible. After briefly recalling\nhow they work in general and what interesting things they can do,\nbesides obviously running a reverse-shell, we'll have to deal with the\nreality that shellcodes are usually not particularly stealthy, due in\npart to the very suspicious presence of non-printable characters. In a\ntutorial-like fashion, we'll address increasingly more complex\nconstraints. As a reward, we reveal new methods for writing in\nparticular alphanumeric shellcodes and attacking platforms for which (to\nthe best of our knowledge) no such shellcode was previously known.\n\nDon't know anything about constrained shellcodes? Do not worry: we'll\nstart from the ground up. Black-belt in shellcoding? We have you\ncovered, stay until the end were we'll get our hands dirty!",
      "id": 40172,
      "event_type": 40002,
      "title": "The ABC of Next-Gen Shellcoding",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T18:45+0000",
      "start_date": "2019-08-11T18:00+0000"
    },
    {
      "description": "Software-defined-radio has revolutionized the state of the art in IoT security and especially one of the most widespread devices: Smart TV. This presentation will show in detail the HbbTV platform of Smart TV, to understand and demonstrate two attacks on these televisions using low cost SDR devices: TV channel and HbbTV server impersonation (channel and URL injection). This last attack will allow more sophisticated remote attacks: social engineering, keylogging, crypto-mining, and browser vulnerability assessment.",
      "id": 40173,
      "event_type": 40002,
      "title": "SDR Against Smart TVs: URL and Channel Injection Attacks",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T18:45+0000",
      "start_date": "2019-08-11T18:00+0000"
    },
    {
      "description": "In this talk, we will share our research in which we successfully exploit Qualcomm WLAN in FIRMWARE layer, break down the isolation between WLAN and Modem and then fully control the Modem over the air.\n\nSetup the real-time debugger is the key. Without the debugger, it's difficult to inspect the program flow and runtime status. On Qualcomm platform, subsystems are protected by the Secure Boot and unable to be touched externally. We'll introduce the vulnerability we found in Modem to defeat the Secure Boot and elevate privilege into Modem locally so that we can setup the live debugger for baseband.\n\nThe Modem and WLAN firmware is quite complex and reverse engineering is a tough work. Thanks to the debugger, we finally figure out the system architecture, the components, the program flow, the data flow, and the attack surfaces of WLAN firmware. We'll share these techniques in detail, along with the zero-days we found on the attack surfaces.\n\nThere are multiple mitigations on Qualcomm baseband, including DEP, stack protection, heap cookie, system call constraint, etc. All the details of the exploitation and mitigation bypassing techniques will be given during the presentation.\n\nStarting from Snapdragon 835, WLAN firmware is integrated into the Modem subsystem as an isolated userspace process. We'll discuss these constraints, and then leverage the weakness we found to fully exploit into Modem.",
      "id": 40174,
      "event_type": 40002,
      "title": "Exploiting Qualcomm WLAN and Modem Over The Air",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T18:45+0000",
      "start_date": "2019-08-11T18:00+0000"
    },
    {
      "description": "It's a nice sunny day on your vacation, the views are stunning, and like on any other day you take out your DSLR camera and start taking pictures. Sounds magical right? But when you get back to your hotel the real shock hits you: someone infected your camera with ransomware! All your images are encrypted, and the camera is locked. How could that happen?In this talk, we show a live demo of this exact scenario. Join us as we take a deep dive into the world of the Picture Transfer Protocol (PTP). The same protocol that allows you to control your camera from your phone or computer, can also enable any attacker to do that and more. We will describe in detail how we found multiple vulnerabilities in the protocol and how we exploited them remotely(!) to take over this embedded device.But it doesn't end here. While digging into our camera, we found a reliable way to take over most of the DSLR cameras without exploiting any vulnerability at all. We simply had to ask our camera to do that for us, and it worked.\n\nThis is the first vulnerability research on the Picture Transfer Protocol, a vendor agnostic logical layer that is common to all modern-day cameras. As DSLR cameras are used by consumers and journalists alike, this opens up the door for future research on these sensitive embedded devices.",
      "id": 40175,
      "event_type": 40002,
      "title": "Say Cheese - How I Ransomwared Your DSLR Camera",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T18:45+0000",
      "start_date": "2019-08-11T18:00+0000"
    },
    {
      "description": "After having compromised on-premise for many years, there is now also the cloud! Now your configuration mistakes can be accessed by anyone on the internet, without that fancy next-gen firewall saving you. With this talk Iíll share my current research on Azure privileges, vulnerabilities and what attackers can do once they gain access to your cloud, or how they can abuse your on-premise cloud components. We start with becoming Domain Admin by compromising Azure AD Sync, sync vulnerabilities that allow for Azure admin account takeover and insecure Single Sign On configurations. Up next is cloud roles and privileges, backdooring Azure AD with service accounts, escalating privileges as limited admin and getting past MFA without touching someone's phone. Then we finish with cloud integrations, also known as \"how a developer can destroy your whole infrastructure with a single commit\": Exploring Azure DevOps, backdooring build pipelines, dumping credentials and compromising Azure Resource Manager through connected services. Besides all the fun we'll also look into how this translates into the questions you should ask yourself before moving things to the cloud and how this differs from on-premise.",
      "id": 40176,
      "event_type": 40002,
      "title": "I'm In Your Cloud... Pwning Your Azure Environement",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T19:45+0000",
      "start_date": "2019-08-11T19:00+0000"
    },
    {
      "description": "During a classic cyber attack, one of the major offensive goals is to execute code remotely on valuable machines. The purpose of that code varies on the spectrum from information extraction to physical damage. As defenders, our goal is to detect and eliminate any malicious code activity, while hackers continuously find ways to bypass the most advanced detection mechanisms. Itís an endless cat-and-mouse game where new mitigations and features are continuously added to the endpoint protection solutions and even the OS itself in order to protect the users against newly discovered attack techniques.   In this talk, we present a new approach for malicious code to bypass most of endpoint protection measures. Our approach covertly proxies the malicious code operations over the network, never deploying the actual malicious code on the victim side. We are going to execute code on an endpoint, without really storing the code on disk or loading it to memory. This technique potentially allows attackers to run malicious code on remote victims, in such a way that the code is undetected by the victimís security solutions.  We denote this technique as ìmalproxyingî.",
      "id": 40177,
      "event_type": 40002,
      "title": "Malproxying: Leave Your Malware at Home",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T19:45+0000",
      "start_date": "2019-08-11T19:00+0000"
    },
    {
      "description": "HTTP requests are traditionally viewed as isolated, standalone entities. In this session, I'll introduce techniques for remote, unauthenticated attackers to smash through this isolation and splice their requests into others, through which I was able to play puppeteer with the web infrastructure of numerous commercial and military systems, rain exploits on their visitors, and harvest over $50k in bug bounties.\n\nUsing these targets as case studies, Iíll show you how to delicately amend victim's requests to route them into malicious territory, invoke harmful responses, and lure credentials into your open arms. Iíll also demonstrate using backend reassembly on your own requests to exploit every modicum of trust placed on the frontend, gain maximum privilege access to internal APIs, poison web caches, and compromise my favourite login page.\n\nAlthough documented over a decade ago, a fearsome reputation for difficulty and collateral damage has left this attack optimistically ignored for years while the web's susceptibility grew. By applying fresh ideas and new techniques, Iíll unveil a vast expanse of vulnerable systems ranging from huge content delivery networks to bespoke backends, and ensure you leave equipped to devise your own desync techniques and tailor attacks to your target of choice.",
      "id": 40178,
      "event_type": 40002,
      "title": "HTTP Desync Attacks: Smashing into the Cell Next Door",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T19:45+0000",
      "start_date": "2019-08-11T19:00+0000"
    },
    {
      "description": "MikroTik routers keep getting owned. Theyíve been exploited by advanced threats like VPNFilter, Slingshot APT, and Trickbot. Theyíve been compromised by coin miners, botnets, and who knows what else. With each new campaign the security industry publishes new indicators of compromise and everyone moves on.\n\nHowever, MikroTik administrators operate in a sandbox. They have very limited access to the routerís underlying file system and almost no ability to directly interact with the Linux operating system. Due to these limitations, file hashes cannot answer the fundamental question that is asked again and again on the MikroTik forums, ìHave I been compromised?î\n\nItís time the users had their question answered. In this talk, Iíll present three vulnerabilities that can help MikroTik administrators break out of the sandbox. Iíll show how to use these vulnerabilities to help determine if the router has been compromised.",
      "id": 40179,
      "event_type": 40002,
      "title": "Help Me, Vulnerabilities. You're My Only Hope",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T19:45+0000",
      "start_date": "2019-08-11T19:00+0000"
    },
    {
      "description": "Your browser thinks my 192.168.1.1 is the same as your 192.168.1.1. Using a novel combination of redirects, Karma, JavaScript and caching we demonstrate that itís viable to attack internal management interfaces without ever connecting to your network. Using the MICASA-SUCASA tool itís possible to automate the exploitation of hundreds of interfaces at once. This presentation will introduce the attack vector and demonstration, but also the public release of the MICASA-SUCASA tool.",
      "id": 40180,
      "event_type": 40002,
      "title": "[ MI CASA-SU CASA ] My 192.168.1.1 is Your 192.168.1.1",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T20:45+0000",
      "start_date": "2019-08-11T20:00+0000"
    },
    {
      "description": "While recent research has explored the capability of attacks to cause harm by targeting devices ñ e.g., SCADA systems, vehicles, medical implant devices - little consideration has been given to the concept of attacks affecting psychological and physiological health by targeting humans themselves.\n\nIn a first-of-its-kind study, we assessed the capability of several consumer devices to produce sound at high and low frequencies which may be imperceptible to many people, as a result of remote and local attacks, and compared the resulting sound levels to maximum recommended levels. In doing so, we tested their viability as localised acoustic weapons which could cause temporary/permanent hearing damage and/or adverse psychological effects. We examined a number of countermeasures, including a tool to detect specified frequencies above specified thresholds. \n\nIn this talk, I will cover the background of malware which has, intentionally or not, caused physical or psychological harm. I will explore previous research on the harmful effects of sound, focusing particularly on high and low frequencies, and some of the guidance which has been proposed to limit exposure to such sound. I will examine the use of imperceptible sound as applied to security research (covert channels, ultrasonic tracking beacons, etc), and will present our experiments and findings, including threat models, methodology, the attacks we developed, and the implications of our results. Finally, I will suggest a number of countermeasures and outline some possible areas for future research.",
      "id": 40181,
      "event_type": 40002,
      "title": "Sound Effects: Exploring Acoustic Cyber-weapons",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T20:45+0000",
      "start_date": "2019-08-11T20:00+0000"
    },
    {
      "description": "With how many apps are running in the cloud, hacking these instances becomes easier with a simple vulnerability due to an unsanitized user input. In this talk, weíll discuss a number of different methods that helped us exfil data from different applications using Server-Side Request Forgery (SSRF). Using these methods, we were able to hack some of the major transportation, hospitality, and social media companies and make $50,000 in rewards in 3 months.",
      "id": 40182,
      "event_type": 40002,
      "title": "Owning The Clout Through Server-Side Request Forgery",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T20:45+0000",
      "start_date": "2019-08-11T20:00+0000"
    },
    {
      "description": "Today's systems sandbox code through traditional techniques: memory protection and user-kernel mode. Even high-security devices like hardware cryptocurrency wallets use such an architecture. Unfortunately, this arrangement has a history of security bugs due to misconfigured protection hardware, bugs in kernel code, hardware bugs, and side channels.\n\nThis talk proposes a new approach to isolation for devices like crypto wallets: separate the user and kernel onto two CPUs and multiplex processes by completely resetting the user processor between tasks so that there is no leakage.\n\nProcessor reset is more complicated than might be expected. Simply asserting the reset line isn't enough to clear all CPU-internal state, but it turns out that software can be used to clear this state. However, reasoning about the correctness of such code is challenging. This talk presents a tool that can be used to develop and formally verify the correctness of reset code for a given CPU implementation.\n\nThis talk also walks through a design of a wallet based on this reset-based isolation technique, discusses known security vulnerabilities in current designs such as the Ledger and Trezor wallets (including bugs in MPU misconfiguration, system calls, and drivers), and explores how a reset-based design could prevent such vulnerabilities.",
      "id": 40183,
      "event_type": 40002,
      "title": "Want Strong Isolation? Just Reset Your Processor",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T20:20+0000",
      "start_date": "2019-08-11T20:00+0000"
    },
    {
      "description": "DARPAís Grand Cyber Challenge foretold an ominous future stricken with machines exploiting our code and automatically compromising our systems. Today, we have the chance to steel ourselves by creating new hope through stronger tools and techniques to find our bugs before our big-brother nationstates can take advantage. The firmware holding our phones, our routers, and our cars is our weakest link and it demands new methods of finding exploitable vulnerabilities. This talk will present Firmware Slap, the culmination of concolic analysis and semi-supervised firmware function learning. Each binary or library in a given firmware provides slices of information to accelerate and enable fault-resistant concolic analysis. These techniques provide a method of knowing where our vulnerabilities are and how we can trigger them.",
      "id": 40184,
      "event_type": 40002,
      "title": "Firmware Slap: Automating Discovery of Exploitable Vulnerabilities in Firmware",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40003,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T21:45+0000",
      "start_date": "2019-08-11T21:00+0000"
    },
    {
      "description": "Athletes are competing in virtual cycling by riding real bikes on stationary trainers which power the in-game athletic performance. Riders train and compete online against each other. New racing teams are even competing in Union Cycliste Internationale (UCI) sanctioned events. Better at hacking than riding? Me, too. Iíll expand on the dubious achievements of prior cycling cheaters by showing how to use the open source USBQ toolkit to inspect and modify USB communications between the Zwift application and the wireless sensors that monitor and control the stationary trainer. USBQ is a Python module and application that uses standard hardware, such as the Beaglebone Black, to inspect and modify communications between USB devices and the host. Youíll ride away with a lesson on building your own customized USB man-in-the-middle hacking tool, too.",
      "id": 40185,
      "event_type": 40002,
      "title": "Cheating in eSports: How to Cheat at Virtual Cycling\nUsing USB Hacks",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40004,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T21:45+0000",
      "start_date": "2019-08-11T21:00+0000"
    },
    {
      "description": "Ethereum smart contracts are Turing-complete programs that mediate transfers of money. It doesn't come as a surprise that all hell is breaking loose on the Ethereum blockchain.\n\nIn this talk, we'll introduce Karl, an Ethereum blockchain monitor, and Scrooge McEtherface, an auto-exploitation bot that extracts Ether from vulnerable smart contracts. Scrooge uses symbolic execution to detect vulnerable states that live up to three transactions deep and constructs exploit payloads using the Z3 constraint solver. \n\nWe'll also examine the game-theoretic consequences of Scrooge's existence. What if multiple bots compete for exploiting the same contracts? How about honeypots that counter-exploit bots? Is it possible to cheat those honeypots? When all is said and done, who is going to end up stealing money from whom?\n\nDuring the talk, we'll show many examples for vulnerable contracts, honeypots, and counter-honeypots, explain the role of transaction ordering and frontrunning, and launch a little challenge for the audience.",
      "id": 40186,
      "event_type": 40002,
      "title": "The Ether Wars: Exploits, counter-exploits and honeypots on Ethereum",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40005,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T21:45+0000",
      "start_date": "2019-08-11T21:00+0000"
    },
    {
      "description": "You've seen the Contests, you've played in a Contest, you've won a Contest and may have lost a Contest! Whatever the outcome was, come join as as we celebrate the winners and contestants of our DEF CON 27 Contests! DEF CON 27 Contests and Events Closing Ceremonies will be August 11th at 14:00 in Track 4. Black Badge winning Contests will still be honored at the main DEF CON 27 Closing Ceremonies on August 11th at 16:00 in the Paris Ballroom!",
      "id": 40187,
      "event_type": 40002,
      "title": "Contests Awards Ceremony",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40006,
      "conference": "DEFCON27",
      "end_date": "2019-08-11T22:30+0000",
      "start_date": "2019-08-11T21:00+0000"
    },
    {
      "description": "DEF CON 27 draws to a close. Prizes awarded, Black Badge winners announced, thanks given, future plans revealed.",
      "id": 40188,
      "event_type": 40002,
      "title": "Closing Ceremonies",
      "includes": "",
      "link": "",
      "updated_at": "2019-07-27T17:33+0000",
      "speakers": [
        40272
      ],
      "location": 40008,
      "conference": "DEFCON27",
      "end_date": "2019-08-12T01:00+0000",
      "start_date": "2019-08-11T23:00+0000"
    }
  ]
}