{
  "speakers": [
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Travis (Travco) Palmer is a Security Research Engineer at Cisco. Travis is a certified OSCP and OSCE who has been getting paid to either fix or break something for over seven years. He is a fan (and sometimes-contributer) of a number of simulator/sandbox video games, and keeper of too many unfinished hardware projects.",
      "id": 40001,
      "title": "Security Research\nEngineer, Cisco",
      "name": "Travis (Travco) Palmer",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Brian Somers is a Site Reliability Engineer for Cisco Umbrella (formerly OpenDNS). He specializes in large scale development on Unix-like platforms, software design & architecture, low level C development, and FreeBSD development.",
      "id": 40002,
      "title": "Site Reliability Engineer",
      "name": "Brian Somers",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@yair_omer",
      "link": "",
      "conference": "DEFCON27",
      "description": "Omer is End-Point team lead at Symantec (formerly Javelin Networks). His team focuses on methods to covertly manipulate OS internals. Before Symantec he was a malware researcher at IBM Trusteer for two years focusing on financial malware families. In the past he has worked at Algotec for six years developing medical imaging software and at IDF's technology unit for three years as dev team lead. Omer lectured on DerbyCon 8, Virus Bulletin and Zero Nights conferences. In his free time he revives historical photographic processes.",
      "id": 40003,
      "title": "Endpoint Team Lead at Symantec",
      "name": "Omer Yair",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@leonwxqian",
      "link": "",
      "conference": "DEFCON27",
      "description": "Wenxiang Qian is a senior security researcher at the Tencent Blade Team. He is focusing on security research of IoT devices. He also do security audits for web browsers. He was on the top 100 of annual MSRC list (2016 & 2017 ).  He published a book called \"Whitehat Talk About Web Browser Security \".",
      "id": 40004,
      "title": "Senior security researcher at Tencent Blade Team",
      "name": "Wenxiang Qian",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@Xbalien29",
      "link": "",
      "conference": "DEFCON27",
      "description": "YuXiang Li is a senior security researcher at Tencent Blade Team, specialized in the study of Mobile Security and IoT Security. He has reported multiple vulnerabilities of Android and received acknowledgments from vendors(Google/Huawei). He was a speaker of HITB AMS 2018 and XCON 2018.",
      "id": 40005,
      "title": "Senior security researcher at Tencent Blade Team",
      "name": "YuXiang Li",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@DroidSec_cn",
      "link": "",
      "conference": "DEFCON27",
      "description": "HuiYu Wu is a senior security researcher at Tencent Blade Team. Now his job is mainly focus on IoT security research and mobile security research. He was also a bug hunter, winner of GeekPwn 2015, and speaker of DEFCON 26 , HITB 2018 AMS and POC 2017.",
      "id": 40006,
      "title": "Senior security researcher at Tencent Blade Team",
      "name": "HuiYu Wu",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@abaumhof",
      "link": "",
      "conference": "DEFCON27",
      "description": "Andreas Baumhof is Vice President Quantum Technologies at Quintessence Labs. He is responsible for all developments relating to Quantum Technologies such as Quantum Random Number Generator, Quantum Key Distribution or Quantum Computing in general. Before this role, Andreas was CTO for ThreatMetrix Inc, the global leader in digital identities, where he was responsible for software engineering. He helped lead the company to a very successful exit and a 830m USD acquisition by Lexis Nexis/RELX. Andreas holds a mathematics degree from the University of Munich. In his spare time he enjoys mountain biking, snowboarding and spending time with his family.",
      "id": 40007,
      "title": "Vice President Quantum Technologies, QuintessenceLabs Inc.",
      "name": "Andreas Baumhof",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@phLaul",
      "link": "",
      "conference": "DEFCON27",
      "description": "Philippe Laulheret is a Senior Security Researcher on the McAfee Advanced Threat Research team. With a focus on Reverse Engineering and Vulnerability Research, Philippe uses his background in Embedded Security and Software Engineering to poke at complex system and get them to behave in interesting ways.\n\nHe previously talked about Reverse Engineering PSX game at Bsides PDX, created & contributed to some Hardware Hacking CTF when working at Red Balloon Security and shared the love of tearing apart VOIP phones during ad-hoc workshops at multiple conferences (Summer Con, Hardware Hacking Village, etc.)",
      "id": 40008,
      "title": "Senior Security Researcher @ McAfee Advanced Threat Research",
      "name": "Philippe Laulheret†",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Junyu Zhou, Security Researcher in Tencent Security Xuanwu Lab, CTF player from 0ops/A*0*E, is focusing on vulnerability research and web application security. Speaker of HITB2018Dubai and ZeroNights2018.",
      "id": 40009,
      "title": "Security Researcher in Tencent Security Xuanwu Lab",
      "name": "Junyu Zhou",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Ce Qin, Security Researcher in Tencent Security Xuanwu Lab for 3 years, focus on software security, mainly on browser and Desktop software.",
      "id": 40010,
      "title": "Security Researcher in Tencent Security Xuanwu Lab",
      "name": "Ce Qin",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Jianing Wang, Security Researcher in Tencent Security Xuanwu Lab, member of Syclover, is focusing on vulnerability research and web application security.",
      "id": 40011,
      "title": "Security Researcher in Tencent Security Xuanwu Lab",
      "name": "Jianing Wang",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "HighWiz is born of glitter and moon beams and he has all the right moves. He is the things that sweet dreams are made of and nightmares long to be... Years ago, with the help of some very awesome people*, he set about to create an event that would give the n00bs of DEF CON a place to feel welcomed and further their own pursuit of knowledge. For years he has held onto the simple tenet that \"You get out of DEF CON what you put into it\". HighWiz is the fabled Man on the Mountain whom people seek to gain a taste of his forbidden knowledge. He is a rare sighting at DEF CON only to be glimpsed by those lucky few. HighWiz is a member of the DEF CON CFP Review Board and Security Tribe. \n\n*Some (but not all) of the people HighWiz would like to thank for helping to make 101 into what it is today : Runnerup, Wiseacre, Nikita, Roamer, Shaggy, Lockheed, Pyr0, Zac, V3rtgio, 1o57, Neil, Sethalump, AlxRogan, Jenn, Zant, MalwareUnicorn, Clutch, TheDarkTangent, Siviak, Suggy, Ripshy, Valkyrie, Suggy, Flipper and all the members of Security Tribe. Shout outs to Security Tribe, GH, QC and The LonelyHackersClub",
      "id": 40012,
      "title": "",
      "name": "Highwiz",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@Niki7a",
      "link": "",
      "conference": "DEFCON27",
      "description": "DEF CON, Director of Content & Coordination. Wife & Mom. Chicken Soup repairwoman. SecurityTribe. &#x2620;&#x1F984;&#x1F308;&#x1F913; Into: hacks &#x1F4A1; snacks &#x1F32E; shellacs &#x1F485;&#x1F3FB;",
      "id": 40013,
      "title": "",
      "name": "Nikita",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Will was summoned to life through the trials of fire, fueled by the alcohol and excitement of DEF CON 25. He arose from those ashes of his former life into a malware making, maple syrup drinking n00b with a new attitude on life and lots of fury to share. On a path of creation and destruction, Will is on a relentless quest to conquer anyone that doubts him and maybe one day leave a mark that is just nearly as bright as the Phoenix itself.",
      "id": 40014,
      "title": "",
      "name": "Will",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "(or his n00bzness or el n00berino if youíre not into the whole brevity thing) pays the bills by working for a Silicon Valley company protecting the F500 doing Compliance and IT Security Globally by way of Wall Street and D&T. He grew up tying up phone lines across South Florida with his Bosun whistle. His love for all things wireless are due to his love of software defined radio and hatred of getting up to change the TV channel when the remote was lost. He has spoken at DEF CON, HackMiami (%27), DerbyCon and when advised of his right to remain silent, plead the fif!",
      "id": 40015,
      "title": "",
      "name": "n00bz",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Shaggy is a penetration tester by day and a renaissance man at night. He enjoys mastering new things and breaking anything put in front of him. When he is not messing around with technology he is making things with wood, performing card tricks, and seducing the masses with his warm gently voice.",
      "id": 40016,
      "title": "",
      "name": "Shaggy",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40017,
      "title": "",
      "name": "SecBarbie",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Tottenkoph has been going to DEF CON for over 10 years and has spent the past several cons volunteering as the Workshop department lead as well as serving on the Workshop Review Board. Tottie has spoken on things from security flaws in digital billboards to drunken insights on what random episodes of Babylon 5 *really* meant. She thinks the perfect date is April 25th, overuses exclamation points in text-based comms, and is excited to have a chance to meet/speak with more new attendees!",
      "id": 40018,
      "title": "",
      "name": "Tottenkoph",
      "updated_at": "2019-08-01T00:55+0000"
    },
    {
      "twitter": "@joegrand",
      "link": "http://www.grandideastudio.com†",
      "conference": "DEFCON27",
      "description": "Joe Grand, also known as Kingpin, is a computer engineer, hardware hacker, DEFCON badge designer (14, 15, 16, 17, 18, China 1, 27), teacher, advisor, runner, daddy, honorary doctor, TV host, member of legendary hacker group L0pht Heavy Industries, and the proprietor of Grand Idea Studio (grandideastudio.com).",
      "id": 40019,
      "title": "",
      "name": "Joe Grand (Kingpin)",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@thewilsoncenter",
      "link": "https://www.wilsoncenter.org/person/jane-harman",
      "conference": "DEFCON27",
      "description": "The Hon. Jane Harman is President of the Wilson Center, a think tank in Washington, DC.  She is a former nine-term Member of Congress who served on all the major security committees and represented an aerospace and technology hub in Southern California.",
      "id": 40020,
      "title": "President, The Wilson Center, Former Rep. (D-CA), aka Surfer Jane",
      "name": "Former Rep. Jane Harman",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@jimlangevin",
      "link": "https://langevin.house.gov/about-me/full-biography",
      "conference": "DEFCON27",
      "description": "The Hon. Jim Langevin represents Rhode Islandís 2nd Congressional district.  He is Ranking Member of the Emerging Threats and Capabilities Subcommittee and a senior member of the Cybersecurity and Infrastructure Protection Subcommittee.  Rep. Langevin is a member of the House Minority Whip Steny Hoyerís Senior Whip Team, and is responsible for educating other Democratic Members on key issues.",
      "id": 40021,
      "title": "(D-RI)",
      "name": "Rep. James Langevin",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@infosecjen",
      "link": "https://blog.rapid7.com/author/jen-ellis/",
      "conference": "DEFCON27",
      "description": "Jen Ellis is the Vice Preident of Community and Public Affairs at Rapid7.  She works directly with security researchers, technology providers and operators, and government entities to help them understand and address cybersecurity challenges together.",
      "id": 40022,
      "title": "Director of Public Affairs, Rapid 7",
      "name": "Jen Ellis",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@spacerog",
      "link": "https://securityintelligence.com/author/cris-thomas/",
      "conference": "DEFCON27",
      "description": "Cris Thomas works for IBM X-Force Red, and before that worked at Guardent, Trustwave, Tenable and others.  Cris created the first security research think tank L0pht Heavy Industries and the video news show The Hacker News Network.",
      "id": 40023,
      "title": "Director, X-Force Red Team, IBM, aka Space Rogue",
      "name": "Cris Thomas",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@RepTedLieu",
      "link": "https://lieu.house.gov/about/full-biography",
      "conference": "DEFCON27",
      "description": "The Hon. Ted Lieu represents Californiaís 33rd Congressional district. Now in his third term in Congress, Rep. Lieu currently sits on the House Judiciary Committee and House Foreign Affairs Committee. He also serves as Co-Chair of the Democratic Policy and Communications Committee and has emerged as a leader in cybersecurity in Congress.",
      "id": 40024,
      "title": "(D-CA)",
      "name": "Rep. Ted Lieu",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@obilodeau",
      "link": "https://gosecure.net/blog/",
      "conference": "DEFCON27",
      "description": "Olivier Bilodeau is leading the Cybersecurity Research team at GoSecure. With more than 10 years of infosec experience, he enjoys attracting malware in honeypots, writing tools for malware research, reverse-engineering all-the-things and vulnerability research. Passionate communicator, Olivier has spoken at several conferences like BlackHat Europe, DefCcon, Botconf, SecTor, Derbycon, HackFest and many more. Invested in his community, he co-organizes MontrÈHack, a monthly workshop focused on applied information security, and NorthSec, Montreal's community conference and Capture-The-Flag.",
      "id": 40025,
      "title": "Cybersecurity Research Lead at GoSecure†",
      "name": "Olivier Bilodeau",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@masarahclouston",
      "link": "https://gosecure.net/blog/",
      "conference": "DEFCON27",
      "description": "Masarah Paquet-Clouston is a security researcher at GoSecure, a PhD student at Simon Fraser University in criminology and one of Canadaís decorated 150 scientific innovators. With her background in economics and criminology, she specializes in the study of markets behind illicit online activities. She published in several peer-reviewed journals, such as Social Networks, Global Crime and the International Journal for the Study of Drug Policy, and presented at various international conferences including Virus Bulletin, Black Hat Europe, Botconf and the American Society of Criminology.",
      "id": 40026,
      "title": "Cybersecurity Researcher at GoSecure",
      "name": "Masarah Paquet-Clouston",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "https://ggrsecurity.com/DEFCON",
      "conference": "DEFCON27",
      "description": "Bill Graydon is a principal at GGR Security Consultants, and is active in research in electronic surveillance and alarm systems, human psychology in a secure environment and locking systems analysis.  He received a Masters in computer engineering and a certificate in forensic engineering from the University of Toronto, applying this at GGR to develop rigorous computational frameworks to model and improve security in the physical world.",
      "id": 40027,
      "title": "President and Principal, Physical Security Analytics",
      "name": "Bill Graydon",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Robert is a principal at GGR security. With a strong interest driving him forward, he is researching lock manipulation, picking, bypass, and other vulnerabilities, to discover and evaluate possible flaws or methods of attack. He has well-honed skills such as lock picking, decoding, locksmithing, as well as a thorough understanding of the mechanics and function of many types of high security locks, and electronic security systems and components, allowing him to effectively search for and test methods of cracking high security systems.",
      "id": 40028,
      "title": "Principal, GGR Security",
      "name": "Robert Graydon",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@adversariel",
      "link": "",
      "conference": "DEFCON27",
      "description": "Ariel Herbert-Voss is a PhD student at Harvard University, where she specializes in adversarial machine learning, cybersecurity, mathematical optimization, and dumb internet memes. She is an affiliate researcher at the MIT Media Lab and at the Vector Institute for Artificial Intelligence. She is a co-founder and co-organizer of the DEF CON AI Village, and loves all things to do with malicious uses and abuses of AI.",
      "id": 40029,
      "title": "PhD student, Harvard University",
      "name": "Ariel Herbert-Voss",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@RogerDingledine",
      "link": "",
      "conference": "DEFCON27",
      "description": "Roger Dingledine is president and co-founder of the Tor Project, a nonprofit that develops free and open source software to protect people from tracking, censorship, and surveillance online.\n\nWearing one hat, Roger works with journalists and activists on many continents to help them understand and defend against the threats they face. Wearing another, he is a lead researcher in the online anonymity field, coordinating and mentoring academic researchers working on Tor-related topics. Since 2002 he has helped organize the yearly international Privacy Enhancing Technologies Symposium (PETS).\n\nAmong his achievements, Roger was chosen by the MIT Technology Review as one of its top 35 innovators under 35, he co-authored the Tor design paper that won the Usenix Security \"Test of Time\" award, and he has been recognized by Foreign Policy magazine as one of its top 100 global thinkers.",
      "id": 40030,
      "title": "The Tor Project",
      "name": "Roger Dingledine",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@xi4ohuihui",
      "link": "",
      "conference": "DEFCON27",
      "description": "Shupeng (xiaohuihui) is a member of Baidu Security Lab. He is an expert on IoT security, AI security, penetration testing, etc. He was invited to talk on multiple security conferences, and successfully pwned IOT equipments on XPwn 2016/2017/2018, GeekPwn May/October 2017,the biggest pwn competitions in China.",
      "id": 40031,
      "title": "Senior Security Researcher, Baidu",
      "name": "XiaoHuiHui",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Ye Zhang is a security researcher of Baidu Security Lab X-Team. He's good at reverse engineering and malware analysis, now he focuses on finding IoT vulnerabilities.",
      "id": 40032,
      "title": "Security Researcher, Baidu",
      "name": "Ye Zhang",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Zheng Huang is the head of Baidu Security Lab X-Team. He is a prolific finder of vulnerabilities in the browser security area, has contributed a lot of vulnerabilities in Microsoft browsers, Chrome, and Safari. Previously, he mainly focused on malicious URL detection and defense of APT attacks, he is now responsible for the research of autonomous driving security.",
      "id": 40033,
      "title": "Leader of Baidu Security Lab X-Team, Baidu",
      "name": "ZhengHuang",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@chaosdatumz",
      "link": "",
      "conference": "DEFCON27",
      "description": "Jeff Dileo (chaosdata) is a security consultant by day, and sometimes by night. He hacks on embedded systems, mobile apps and devices, web apps, and complicated things that don't have names. He likes candy and arguing about text editors and window managers he doesn't actually use.",
      "id": 40034,
      "title": "Research Director, NCC Group",
      "name": "Jeff Dileo",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@itzikkotler",
      "link": "http://www.ikotler.org, Twitter: @itzikkotler",
      "conference": "DEFCON27",
      "description": "Itzik Kotler is CTO and Co-Founder of SafeBreach. Itzik has more than a decade of experience researching and working in the computer security space. He is a recognized industry speaker, having spoken at DEFCON, Black Hat USA, Hack In The Box, RSA, CCC and H2HC. Prior to founding SafeBreach, Itzik served as CTO at Security-Art, an information security consulting firm, and before that he was SOC Team Leader at Radware. (NASDQ: RDWR).",
      "id": 40035,
      "title": "Co-Founder & CTO at SafeBreach",
      "name": "Itzik Kotler",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "http://www.securitygalore.com/",
      "conference": "DEFCON27",
      "description": "Amit Klein is a world renowned information security expert, with 28 years in information security and over 30 published technical and academic papers on this topic. Amit is the VP Security Research at SafeBreach, responsible for researching various infiltration, exfiltration and lateral movement attacks. Before SafeBreach, Amit was the CTO for Trusteer (acquired by IBM) for 8.5 years. Prior to Trusteer, Amit was chief scientist for Cyota (acquired by RSA) for 2 years, and prior to that, director of Security and Research for Sanctum (acquired by Watchfire, now part of IBM security division) for 7 years. Amit has a B.Sc. from the Hebrew University in Mathematics and Physics (magna cum laude, Talpiot program), recognized by InfoWorld as a CTO of the year 2010 , and has presented at BlackHat USA, DefCon, NDSS, OWASP Global (keynote), InfoCom, DSN, HITB, RSA, OWASP EU, CertConf, BlueHat, CyberTech, APWG and AusCERT (keynote).",
      "id": 40036,
      "title": "VP Security Research at SafeBreach",
      "name": "Amit Klein",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@Willcaruana",
      "link": "",
      "conference": "DEFCON27",
      "description": "Will has grown up with a passion for making things. He has done a number of high voltage projects and recently been taking in interest in information security competing in a number of different CTFs across the country. Will also helps run the Car Hacking Village. He works bringing in the infosec and maker community to Macchina.",
      "id": 40037,
      "title": "",
      "name": "WillC",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@orange_8361",
      "link": "http://blog.orange.tw/",
      "conference": "DEFCON27",
      "description": "Cheng-Da Tsai, also as known as Orange Tsai, is the principal security research of DEVCORE and the member of CHROOT security group from Taiwan. He has spoken at conferences such as Black Hat USA/ASIA, DEF CON, HITCON, HITB, Hack.lu and CODEBLUE. He participates in numerous Capture-the-Flags (CTF), and also the team captain of HITCON, which won 2nd place in DEF CON 22/25.\n\nCurrently, he is focusing on application security and 0day research. Orange enjoys finding vulnerabilities and participating in Bug Bounty Programs. He is enthusiastic about Remote Code Execution (RCE), and uncovered RCEs in several vendors, such as Facebook, Uber, Apple, GitHub, Amazon, Yahoo, Netflix and Imgur.",
      "id": 40038,
      "title": "Principal Security Researcher from DEVCORE\nMember of HITCON(Hacks in Taiwan Conference)\nMember of CHROOT Security Group\nCaptain of HITCON CTF team",
      "name": "Orange Tsai",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@mehqq_",
      "link": "",
      "conference": "DEFCON27",
      "description": "Tingyi Chang, also known as Meh Chang, is a security researcher at DEVCORE. She focuses on binary program analysis and exploitation. She is a member of HITCON and 217 CTF team and has won the second place of DEF CON 25.",
      "id": 40039,
      "title": "Security Researcher from DEVCORE\nMember of HITCON CTF team",
      "name": "Meh Chang",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@joshmdx",
      "link": "",
      "conference": "DEFCON27",
      "description": "Joshua Maddux started out as a software engineer.  After a few years, having introduced his share of problems to the world, he turned his life around and started hunting for vulnerabilities.  Now at PKC Security he does a mix of software development and white-box penetration testing, with a focus on helping startups move fast without breaking too many things.\n\nAside from pentesting for clients, Joshua is also active in the bug bounty world. His past research has led to security updates in Java, Gitlab, United Airlines, Zapier, and others.",
      "id": 40040,
      "title": "Security Researcher / Software Engineer, PKC Security",
      "name": "Joshua Maddux",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@bxl1989",
      "link": "https://xiaolongbai.weebly.com/, Github: https://github.com/bxl1989/",
      "conference": "DEFCON27",
      "description": "Xiaolong Bai (twitter@bxl1989, github@bxl1989) is a security engineer in Alibaba Orion Security Lab. Before joining Alibaba, he received his Ph.D. degree in Tsinghua University. He has published several research papers on top conferences including IEEE S&P, Usenix Security, CCS, NDSS, and presented his research in Black Hat, DEF CON, HITB, CanSecWest, etc. He has been acknowledged by famous vendors, including Apple, Google, Facebook, Evernote, and Tencent for his contribution in discovering the vulnerabilities in their systems and improving the security of their products. He is a member of the OverSky team for private jailbreaking development.",
      "id": 40041,
      "title": "",
      "name": "Xiaolong Bai",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@SparkZheng",
      "link": "",
      "conference": "DEFCON27",
      "description": "Min (Spark) Zheng (twitter@SparkZheng, github@zhengmin1989) is a security expert in Alibaba Orion Security Lab. He received his Ph.D. degree in the CSE department of the CUHK. His research focuses on malware analysis, smartphone (Android & iOS) security, system design and implementation. Before receiving Alibaba A-Star offer award in 2015, he worked in FireEye, Baidu and Tencent. He was the champion of GeekPwn 2014 and AliCTF 2015. He won the ìbest security researcherî award in FIT 2016 for detecting the iOS/macOS vulnerabilities, XcodeGhost virus and WormHole RCE vulnerability. He is a member of the OverSky team for private jailbreaking development. He presented his research in DEFCON, HITB, BlackHat, RUXCON, etc.",
      "id": 40042,
      "title": "",
      "name": "Min (Spark) Zheng",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@fulmetalpackets",
      "link": "",
      "conference": "DEFCON27",
      "description": "Douglas McKee is a senior security researcher for the McAfee Advanced Threat Research team, focused on finding new vulnerabilities in both software and hardware. Douglas has an extensive background in penetration testing, reverse engineering, malware analysis and forensics and throughout his career has provided software exploitation training to many audiences, including law enforcement.  Douglas recently presented his research focused on hacking medical devices at DEFCON 26.",
      "id": 40043,
      "title": "Senior Security Researcher, McAfee Advanced Threat Research",
      "name": "Douglas McKee",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Mark Bereza is a security researcher and new addition to McAfee's Advanced Threat Research team. A recent alumnus of Oregon State's CS systems program, Mark's work has focused primarily on vulnerability discovery and exploit development for embedded systems.",
      "id": 40044,
      "title": "Security Researcher, McAfee Advanced Threat Research",
      "name": "Mark Bereza",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Mike Davis is a hardware security researcher and consultant with IOActive, and for some reason still responds to ëpharí.",
      "id": 40045,
      "title": "ioactive",
      "name": "phar",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Ben Morris is a Security Associate at Bishop Fox, a consulting firm providing cybersecurity services to the Fortune 500, global financial institutions, and high-tech startups. In this role, he focuses on application penetration testing, network penetration testing, and red-teaming.\n\nBen also enjoys performing drive-by pull requests on security tools and bumbling his way into vulnerabilities in widely used PHP and .NET frameworks and plugins. Ben has also contributed to Root the Box, a capture the flag security competition.",
      "id": 40046,
      "title": "Security Associate, Bishop Fox",
      "name": "xBen \"benmap\" Morris",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Patrick Wardle is the Chief Research Officer at Digita Security and founder of Objective-See. Having worked at NASA and the NSA, as well as presented at countless security conferences, he is intimately familiar with aliens, spies, and talking nerdy. Patrick is passionate about all things related to macOS security and thus spends his days finding Apple 0days, analyzing macOS malware and writing free open-source security tools to protect Mac users.",
      "id": 40047,
      "title": "Chief Research Officer, Digita Security",
      "name": "Patrick Wardle",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Bill is a 17-year-old high school student with an intense passion for the information security field. Bill's interests include game hacking, reverse engineering malware, and breaking things. Next year, Bill will be attending the Rochester Institute of Technology where he hopes to grow his career and knowledge in the enormous field of Cybersecurity. In his pursuit to make the world a better place, Bill constantly looks for the next big vulnerability following the motto \"break anything and everything\".",
      "id": 40048,
      "title": "Independent Security Researcher",
      "name": "Bill Demirkapi",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "https://elie.net",
      "conference": "DEFCON27",
      "description": "Elie Bursztein leads Google' security & anti-abuse research team. He has authored over fifty research papers in the field for which he was awarded 6 best papers awards and multiple industry distinctions including the Black Hat pwnie award. Born in Paris, he received a Ph.D from ENS-cachan in 2008 before working at Stanford University and ultimately joining Google in 2011.",
      "id": 40049,
      "title": "Google",
      "name": "Elie Bursztein",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@jmichel_p",
      "link": "https://www.j-michel.org/",
      "conference": "DEFCON27",
      "description": "Jean-Michel Picod is currently working at Google Switzerland. He holds an engineering degree in computer systems, networks and security. He has contributed on several open source projects (GoodFET, pynids, etc.) and published several open source tools such as DPAPIck, OWADE, scapy-radio, forensic scripts,",
      "id": 40050,
      "title": "Google",
      "name": "Jean Michel Picod",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Daniel Crowley - Daniel Crowley is the head of research and a penetration tester for X-Force Red. Daniel denies all allegations regarding unicorn smuggling and questions your character for even suggesting it. Daniel is the primary author of both the Magical Code Injection Rainbow, a configurable vulnerability testbed, and FeatherDuster, an automated cryptanalysis tool. Daniel enjoys climbing large rocks and is TIME magazine's 2006 person of the year. Daniel has been working in the information security industry since 2004 and is a frequent speaker at conferences including Black Hat, DEF CON, Shmoocon, and SOURCE. Daniel does his own charcuterie and brews his own beer. Daniel's work has been included in books and college courses. Daniel also holds the noble title of Baron in the micronation of Sealand.",
      "id": 40051,
      "title": "Research Baron, X-Force Red",
      "name": "Daniel \"ufurnace\" Crowley",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Daniel Pagan is a student at Georgia Tech, a DEFCON TV goon, and a Lord in the micronation of Sealand.",
      "id": 40052,
      "title": "Student, Georgia Tech",
      "name": "Daniel Pagan",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@Jayson_Grace",
      "link": "https://techvomit.net",
      "conference": "DEFCON27",
      "description": "Jayson Grace is a Penetration Tester on the Product Security Team at Splunk. Previously he founded and led the Corporate Red Team at Sandia National Laboratories. He holds a BS in Computer Science from the University of New Mexico, which gave him some great knowledge and also made him fatter and added a bunch of grey hairs. He has also previously worked as a tool developer, system administrator, and DevOps engineer. Jayson is passionate about empowering engineers to create secure applications, as well as coming up with novel automation methods to break things.",
      "id": 40053,
      "title": "Penetration Tester, Splunk",
      "name": "Jayson Grace",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@josephmenn",
      "link": "https://www.facebook.com/Joseph-Menn-author-of-Cult-of-the-Dead-Cow-and-Fatal-System-Error-178879563940/",
      "conference": "DEFCON27",
      "description": "Joseph Menn has just published Cult of the Dead Cow: How the Original Hacking Supergroup Might Just Save the World. He is an investigative reporter on security, and has covered the issue since 1999 at the Los Angeles Times, Financial Times and most recently Reuters. His previous books include Fatal System Error: The Hunt for the New Crime Lords who are Bringing Down the Internet and All the Rave: The Rise and Fall of Shawn Fanningís Napster.",
      "id": 40054,
      "title": "Author, Cult of the Dead Cow: How the Original Hacking Supergroup Might Just Save the World (PublicAffairs, June 2019)",
      "name": "Joseph Menn",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@dotMudge",
      "link": "",
      "conference": "DEFCON27",
      "description": "Mudge fronted the pioneer hacker space the L0pht and turned it into a venture-backed security business @Stake. He led sensitive government work at BBN and cybersecurity at DARPA before joining Google to work on special projects. He also led security at Stripe and founded Cyber-ITL, an independent testing lab for software security.",
      "id": 40055,
      "title": "",
      "name": "Peiter Mudge Zatko",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@dildog_",
      "link": "",
      "conference": "DEFCON27",
      "description": "Rioux was the first employee of the L0pht, updated password cracker L0phtcrack, stayed with @stake through its acquisition by Symantec and founded Veracode.",
      "id": 40056,
      "title": "",
      "name": "Chris Dildog Rioux",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@dethveggie",
      "link": "",
      "conference": "DEFCON27",
      "description": "Veggie took a break to go to graduate school in archaeology. Heís back now.",
      "id": 40057,
      "title": "",
      "name": "Deth Vegetable",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Omega has been very quietly working in security for a long time.",
      "id": 40058,
      "title": "",
      "name": "Omega",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@jatinkataria",
      "link": "",
      "conference": "DEFCON27",
      "description": "Jatin Kataria is the Principal Research Scientist at Red Balloon Security where he architects defensive technologies for embedded systems. Playing both the role of cat and of mouse at Red Balloon has many suggesting that he may be the first real source of perpetual energy. He tires of n-days easily and is always looking for new and exciting ELF shenanigans, caching complications, and the Fedex guy who lost his engagement ring. Prior to his time at Red Balloon Security, Jatin worked at a number of firms as a systems software developer and earned his Master of Engineering at Columbia University.",
      "id": 40059,
      "title": "Principal Scientist, Red Balloon Security",
      "name": "Jatin Kataria",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@rickyhousley",
      "link": "",
      "conference": "DEFCON27",
      "description": "Rick Housley is a Research Scientist at Red Balloon Security and leads their advanced hardware reverse engineering efforts. He often finds himself at the end of a soldering iron hoping he has not bricked another expensive COTs product. His focus at Red Balloon includes the discovery of previously unknown vulnerabilities, novel firmware extraction techniques, and advanced physical reverse engineering using custom tooling. When not designing secure-boot defeating EMPs and interposers, he is building axe handles and baby rattles in his woodshop.",
      "id": 40060,
      "title": "Research Scientist, Red Balloon Security",
      "name": "Rick Housley",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Dr. Ang Cui is the Founder and Chief Scientist of Red Balloon Security. Dr. Cui received his PhD from Columbia University in 2015. His doctoral dissertation, titled îEmbedded System Security: A Software-based Approachî, focused exclusively on scientific inquiries concerning the exploitation and defense embedded systems. Ang has focused on developing new technologies to defend embedded systems against exploitation. During the course of his research, he has uncovered a number of serious vulnerabilities within ubiquitous embedded devices like Cisco routers, HP printers and Cisco IP phones. Dr. Cui is also the author of FRAK and the inventor of Software Symbiote technology. Ang has received various awards on his work on reverse engineering commercial devices and is also the recipient of the Symantec Graduate Fellowship and was selected as a DARPA Riser in 2015.",
      "id": 40061,
      "title": "Chief Scientist, Red Balloon Security",
      "name": "Ang Cui",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Marina Simakov is a security researcher at Preempt, with a special interest in network security and authentication protocols. Prior to Preempt, Marina served as a Security Researcher at Microsoft for several years. She holds an M.Sc. in computer science, with several published articles, with a main area of expertise in graph theory. Marina previously spoke at various security conferences such as Black Hat, BlueHat IL and DEFCON.",
      "id": 40062,
      "title": "Senior Security Researcher @Preempt",
      "name": "Marina Simakov",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Yaron Zinar is a Lead Security Researcher at Preempt, delivering the industryís first Identity and Access Threat Prevention. Previously, Yaron spent over 12 years at leading companies such as Google and Microsoft where he held various positions researching and leading big data, machine learning and cyber security projects. Yaron is an expert on Windows Authentication protocols, among his team latest finding are CVE-2017-8563 and CVE-2018-0886, which he presented in Black Hat last year. Yaron holds an M.Sc. in Computer Science with focus on statistical analysis.",
      "id": 40063,
      "title": "Senior Security Researcher Lead @Preempt",
      "name": "Yaron Zinar",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Alon Weinberg is a security researcher at Deep Instinct. Prior to joining Deep Instinct two years ago, Alon served in the IDF for 4.5 years in an elite cyber unit as a security researcher.\n\nAs part of his role in Deep Instinct, Alon is in charge of finding new ways to enhance and develop protection and defense mechanisms. Alon leverages his experience in offensive operations, OS internals and programming to explore attack surfaces in Windows and macOS, analyze malware and research attack vectors and evasion techniques. Alon is a cross-fit junky and enjoys riding his motorcycle whenever his training routine allows it.",
      "id": 40064,
      "title": "Security Researcher, Deep Instinct",
      "name": "Alon Weinberg",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@d4rkm4tter",
      "link": "",
      "conference": "DEFCON27",
      "description": "d4rkm4tter is a mad scientist hacker who likes to meddle with hardware and software. He is particularly obsessed with wireless. He has a degree in computer science from Southern Utah University which he has put to use building and breaking a wide array of systems. These include web application pentesting, wireless monitoring and tracking as well as good old fashioned reverse engineering. He is the creator of the #WiFiCactus and has been seen presenting Demolabs at DEF CON and DEF CON China Beta. He is a Kismet cultist and active in the wireless and wardriving communities.",
      "id": 40065,
      "title": "Hacker",
      "name": "d4rkm4tter (Mike Spicer)",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@trumankain",
      "link": "",
      "conference": "DEFCON27",
      "description": "Truman Kain has a background in design and marketing, which he utilized to develop Dragnet, an intuitive, AI-powered social engineering framework released at DEF CON 26. This year, he has combined his machine learning and design experience to make Surveillance Detection Scout look and feel as OEM as possible.",
      "id": 40066,
      "title": "Sr. Information Security Analyst at Tevora",
      "name": "Truman Kain",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Dr. Bramwell Brizendine graduated with a Ph.D. in Cyber Operations in May, 2019. He holds master's degrees in Computer Science and Information Assurance. Bramwell is a professor at Dakota State University where he teaches topics such as reverse engineering, software exploitation, and malware analysis. Bramwell is the creator of the the JOP ROCKET, or the Jump-oriented Programming Reversing Open Cyber Knowledge Expert Tool. Bramwell has been interested in code-reuse attacks for several years. Bramwell was overcome by the urge to present a tool that made JOP more practical and useful for hackers who may wish to attempt using this more arcane class of code-reuse attacks. The JOP ROCKET is a by product of his doctoral dissertation.",
      "id": 40067,
      "title": "Assistant Professor of Computer and Cyber Sciences, Dakota State University",
      "name": "Dr. Bramwell Brizendine",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "https://0xevilc0de.com",
      "conference": "DEFCON27",
      "description": "Dr. Josh Stroschien is a professor at Dakota State University. Dr. Josh Stroschein teaches undergraduate and graduate courses in cyber security with a focus on malware analysis, reverse engineering and software exploitation. His research interests include malware analysis and software exploitation. Outside of DSU, you can find Josh providing training at such venues as DerbyCon, Hack-In-The-Box and ToorCon.",
      "id": 40068,
      "title": "Assistant Professor of Cyber Security/Network & Security Administration, Dakota State University",
      "name": "Dr. Joshua Stroschien",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@Baldanos",
      "link": "",
      "conference": "DEFCON27",
      "description": "Nicolas works as a security researcher for Kudelski Security in Switzerland. His research focuses on embedded devices and communication protocols. In his spare time, he now spends more time designing CTF challenges than solving them. He is also one of the main developers of the Hydrabus hardware hacking tool and part of the BlackAlps security conference committee.",
      "id": 40069,
      "title": "Cybersecurity Expert, Kudelski security",
      "name": "Nicolas Oberli",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@RonWyden",
      "link": "https://www.wyden.senate.gov/meet-ron",
      "conference": "DEFCON27",
      "description": "Sen. Ron Wyden is the  foremost defender of Americansí civil liberties in the U.S. Senate, and a tireless advocate for smart tech policies. Years before Edward Snowden blew the whistle on the dragnet surveillance of Americans, Wyden warned that the Patriot Act was being used in  ways that would leave Americans shocked and angry, and his questioning of NSA Director James Clapper in 2013 served as a turning point in the secret surveillance of Americansí communications. \n\nSince then, Wyden has  fought to protect Americansí privacy and security against unwanted intrusion from the government, criminals and foreign hackers alike. He has opposed the governmentís efforts to undermine strong encryption, proposed legislation to hold companies accountable  for protecting their usersí data, and authored legislation with Rand Paul to protect Americansí Fourth Amendment rights at the border. \n\nWyden is a senior member  of the Senate Select Committee on Intelligence and the top Democrat on the Senate Finance Committee. He lives in Portland, Oregon.",
      "id": 40070,
      "title": "U.S. Senator from Oregon. Senate Finance Ranking Member",
      "name": "U.S. Senator Ron Wyden",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@shogun7273",
      "link": "https://sourceforge.net/u/shogun7273/profile/",
      "conference": "DEFCON27",
      "description": "Gregory Pickett CISSP, GCIA, GPEN has a background in intrusion analysis for Fortune 100 companies but now heads up Hellfire Securityís Managed Security Services efforts and participates in their assessment practice as a network security subject matter expert.  As a security professional, his primary area of focus and occasional research is networks with an interest in using network traffic to better understand, to better defend, and sometimes to better exploit the hosts that live on them.  He holds a B.S. in Psychology which is completely unrelated but interesting to know.  While it does nothing to contribute to how he makes a living, it does demonstrate how screwed up he actually is.",
      "id": 40071,
      "title": "Cybersecurity Operations, Hellfire Security",
      "name": "Gregory Pickett",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@jensvoid",
      "link": "",
      "conference": "DEFCON27",
      "description": "Jens M¸ller is a PhD student at the Chair for Network and Data Security, Ruhr University Bochum, Germany. His research interests are legacy protocols and data formats, for which he loves to investigate what could possibly go wrong in a modern world. He has experience as a speaker on international security conferences (BlackHat, IEEE S&P, OWASP) and as a freelancer in network penetration testing and security auditing. Besides breaking thinks, he develops free open source software, for example, tools related to network printer exploit^H^H^H^H^H^H^H, um, \"debugging\".",
      "id": 40072,
      "title": "Ruhr University Bochum",
      "name": "Jens M¸ller",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@CdameffMD",
      "link": "",
      "conference": "DEFCON27",
      "description": "Christian (quaddi) Dameff MD is an emergency medicine doctor, former open capture the flag champion, prior DEF CON/RSA/Blackhat/HIMSS speaker, and security researcher. He is currently the Medical Director of Cybersecurity at The University of California San Diego. Published works include topics such as therapeutic hypothermia after cardiac arrest, novel drug targets for myocardial infarction patients, and other Emergency Medicine related works with an emphasis on CPR optimization. Published security research topics including hacking critical healthcare infrastructure, medical devices and the effects of malware on patient care. This is his fifteenth DEF CON.",
      "id": 40073,
      "title": "Medical Director of Security at The University of California San Diego",
      "name": "Christian ìquaddiî Dameff",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@JeffTullyMD",
      "link": "",
      "conference": "DEFCON27",
      "description": "Jeff (r3plicant) Tully is an anesthesiologist, pediatrician and security researcher with an interest in understanding the ever-growing intersections between healthcare and technology.",
      "id": 40074,
      "title": "Anesthesiologist at The University of California Davis",
      "name": "Jeff ìr3plicantî Tully MD",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Dr.Suzanne Schwartzís programmatic efforts in medical device cybersecurity extend beyond incident response to include raising awareness, educating, outreach, partnering and coalition-building within the Healthcare and Public Health Sector (HPH) as well as fostering collaborations across other government agencies and the private sector. Suzanne has been recognized for Excellence in Innovation at FDAís Womenís History Month on March 1st 2018 for her work in Medical Device Cybersecurity. Suzanne chairs CDRHís Cybersecurity Working Group, tasked with formulating FDAís medical device cybersecurity policy. She also co-chairs the Government Coordinating Council (GCC) for the HPH Critical Infrastructure Sector, focusing on the sectorís healthcare cybersecurity initiatives.",
      "id": 40075,
      "title": "Associate Director for Science and Strategic Partnerships at the US Food and Drug Administration FDA",
      "name": "Suzanne Schwartz MD",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@MarieGMoe",
      "link": "",
      "conference": "DEFCON27",
      "description": "Dr. Marie Moe cares about public safety and securing systems that may impact human lives, this is why she joined the grassroots organisation ìI Am The Cavalry\". Marie is a Research Manager at SINTEF, the largest independent research organisation in Scandinavia, and has a PhD in information security. She is also an Associate Professor at the Norwegian University of Science and Technology. She has experience as a team leader at NorCERT, where she did incident handling of cyberattacks against Norwayís critical infrastructure. She is currently doing research on the security of her own personal critical infrastructure, an implanted pacemaker that is generating every single beat of her heart. Marie loves to break crypto protocols, but gets angry when the broken crypto is in her own body.",
      "id": 40076,
      "title": "Researcher and Hacker",
      "name": "Marie Moe PhD",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@XSSniper",
      "link": "",
      "conference": "DEFCON27",
      "description": "Billy is the founder of Whitescope LLC, a startup focused on embedded device security.  Billy is recognized as one of the worldís most respected experts on emerging threats related to Industrial Control Systems (ICS), Critical Infrastructure (CI), and, medical devices. He discovered thousands of security vulnerabilities in hardware and software supporting ICS and critical infrastructure. Billy provided the research that led to the FDAís first cybersecurity safety advisory and research which helped spur the FDAís pre-market cybersecurity guidance. Billy is a contributing author to Hacking: The Next Generation, The Virtual Battlefield, and Inside Cyber Warfare.  He currently holds a Master of Science in Information Systems, an MBA, and a Masters of Military Operational Arts and Science.",
      "id": 40077,
      "title": "Founder of Whitescope",
      "name": "Billy Rios",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@JRadcliffe02",
      "link": "",
      "conference": "DEFCON27",
      "description": "Jay Radcliffe (CISSP) has been working in the computer security field for over 20 years. Coming from the managed security services industry as well as the security consultation field, Jay has helped organizations of every size and vertical secure their networks and data. Jay presented ground-breaking research on security vulnerabilities in multiple medical devices and was featured on national television as an expert on medical device cybersecurity. As a Type I diabetic, Jay brings a lifetime of being a patient to helping medical facilities secure their critical data without compromising patient care. Not only is Jay a prolific public speaker, but also works with legal firms on expert witness consultation related to IoT and cybersecurity issues. Jay holds a Master's degree in Information Security Engineering from SANS Technology Institute, as well as a Bachelor's degree in Criminal Justice/Pre-Law from Wayne State University. SC Magazine named him one of the Top Influential IT Security Thinkers in 2013.",
      "id": 40078,
      "title": "Security Researcher at Thermo Fisher Scientific",
      "name": "Jay Radcliffe",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@brentwdesign",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40079,
      "title": "Global Coordinator",
      "name": "Brent White / B1TK1LL3R",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@jaysonstreet",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40080,
      "title": "Ambassador",
      "name": "Jayson E. Street",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@darington",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40081,
      "title": "Web Master",
      "name": "Darington",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@aprilwright",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40082,
      "title": "Welcoming Committee & Liaison",
      "name": "April Wright",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@ZanshinH4x",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40083,
      "title": "Volunteer",
      "name": "Tim Roberts (byt3boy)",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@Bourbonnais_c",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40084,
      "title": "Volunteer",
      "name": "Casey Bourbonnais",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@ynots0ups",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40085,
      "title": "Social media",
      "name": "s0ups",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@Ali_Islam_Khan",
      "link": "",
      "conference": "DEFCON27",
      "description": "Ali Islam Khan is the Chief Executive Officer (CEO) and Co-Founder of Numen Inc. He is also an avid C programmer and has developed the core set of Numenís Virtual Machine Introspection (VMI) capabilities. Before quitting his job to work full time on Numen, Ali was Director R&D at FireEye where he was leading the R&D efforts for FireEyeís flagship email and network products. He is the founding member of FireEye Labs where he invented & developed some of the key detection technologies used in FireEye products today. Ali has multiple patents to his name and has over 13 yearsí experience in a wide range of cyber security disciplines, including cryptography, malware analysis, cyber-espionage and product development. He has successfully created and led global teams from scratch. Ali has spoken at conferences such as RSA and worked with various government agencies such as DHS, KISA on intelligence sharing efforts to counter nation-state level threats.\n \nKhan holds an MBA from UC Berkeley and a Masterís degree in network security from Monash University, Australia. He is an AUSAID scholar and the recipient of the prestigious Golden Key Award.",
      "id": 40086,
      "title": "CEO, Numen Inc.",
      "name": "Ali Islam",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Daniel Regalado aka DanuX is the CTO and Co-Founder of Numen Inc. He is a Mexican security researcher with more than 17 years in the scene. He has worked reversing malware  and exploits at Symantec Security Response Team and FireEye Labs and lately focused on IoT threats at Zingbox. He is credited with the discovery of most of the ATM malware worldwide. He is the co-author of famous book Gray Hat Hacking and he likes to present his discoveries in major security conferences like RECon, RSA, Defcon IoT/Car Hacking villages, BSIDES.",
      "id": 40087,
      "title": "CTO, Numen Inc",
      "name": "Dan Regalado (DanuX)",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@finalphoenix",
      "link": "",
      "conference": "DEFCON27",
      "description": "finalphoenix is a full-stack engineer who has been working on the web since man invented fire gifs. She likes React, Node, and the Unix fortune command. She specializes in web security and optimization, and in the process, discovered the dangerous world of automation to help her shop.",
      "id": 40088,
      "title": "Engineer & Hypebae",
      "name": "finalphoenix",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@schneierblog",
      "link": "https://www.schneier.com",
      "conference": "DEFCON27",
      "description": "Bruce Schneier is an internationally renowned security technologist, called a \"security guru\" by the Economist. He is the author of 14 books -- including the New York Times best-seller \"Click Here to Kill Everybody\" -- as well as hundreds of articles, essays, and academic papers. His influential newsletter \"Crypto-Gram\" and blog \"Schneier on Security\" are read by over 250,000 people. Schneier is a fellow at the Berkman Klein Center for Internet and Society at Harvard University; a Lecturer in Public Policy at the Harvard Kennedy School; a board member of the Electronic Frontier Foundation, AccessNow, and the Tor Project; and an advisory board member of EPIC and VerifiedVoting.org. He is also a special advisor to IBM Security.",
      "id": 40089,
      "title": "",
      "name": "Bruce Schneier",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@r00tkillah",
      "link": "",
      "conference": "DEFCON27",
      "description": "Michael (@r00tkillah) has done hard-time in real-time. An old-school computer engineer by education, he spends his days hacking the mothership for a fortune 100 company. Previously, he developed and tested embedded hardware and software, fooled around with strap-on boot roms, mobile apps, office suites, and written some secure software. On nights and weekends he hacks on electronics, writes CFPs, and contributes to the NSA Playset.",
      "id": 40090,
      "title": "Principal Troublemaker",
      "name": "Michael Leibowitz",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@Ttimzen",
      "link": "",
      "conference": "DEFCON27",
      "description": "Topher Timzen (@TTimzen) is currently a Principal Vulnerability Enthusiast and enjoys causing constructive mischief. Topher has spoken at conferences such as DEF CON, SecTor and BSidesPDX on offensive security research. Enjoying teaching, particularly about exploitation, he has been running the CTF at BSidesPDX for the past few years. Topher is located in the woods hiking or mountain biking when not computing.\n\nCollectively they have pretended to be bears, slayed a dragon or two, and have managed to not bring down a production server (for long). In reality, they just want to write malware.",
      "id": 40091,
      "title": "(@TTimzen), Principal Vulnerability Enthusiast",
      "name": "Topher Timzen",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Jmaxxz works as a software engineer, but is a hacker by passion. He is best known for his work on the August Smart Lock (DEF CON 24 ìBackdooring the Frontdoorî). In recent years IoT devices have been the focus of his work. He participated in the IoT village zero day track at DEF CON 24 and DEF CON 25. After enduring several polar vortexes, he decided it was probably time to investigate an IoT remote car starter.",
      "id": 40092,
      "title": "",
      "name": "Jmaxxz",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@hevnsnt",
      "link": "",
      "conference": "DEFCON27",
      "description": "Bill Swearingen (hevnsnt) has been in the hacking scene for decades, which is odd because his twitter profile says he is only 23 years old. Having spent his life dedicated to understanding how how things work, he is has focused this curiosity and knowledge to take advantage of our world in any way possible. His interests have always been focused on hardware hacking and loves releasing easy to replicate projects using cheap computing platforms such as Arduino and RaspberryPi.",
      "id": 40093,
      "title": "Worldís #23 Best Hacker",
      "name": "Bill Swearingen",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@GattaKat",
      "link": "https://kaipratt.site/web",
      "conference": "DEFCON27",
      "description": "Dr Katherine Pratt received her B.S. in aerospace engineering from MIT in 2008, and her PhD in Electrical and Computer Engineering (ECE) from the University of Washington (UW) in 2019.  During undergrad she completed several internships with the private space venture Blue Origin, working in systems and propulsion engineering.  She has served four years in the United States Air Force, working primarily as an operational flight test engineer on the F-35 Joint Strike Fighter.  Her doctoral dissertation focused on the privacy, ethics, and policy of information derived from elicited neural signals.  She was the recipient of a National Science Foundation Graduate Research Fellowship and the 2018-19 UW ECE Irene Peden Endowed Fellowship. During graduate school she interned with the ACLU of Washington through the Speech, Privacy, and Technology Project.  She also completed a six month fellowship as the first Congressional Innovation Scholar through Tech Congress where she crafted technology policy and legislation in the office of a member of the House of Representatives.",
      "id": 40094,
      "title": "NSF Graduate Research Fellow, University of Washington - Seattle",
      "name": "Katherine Pratt/GattaKat",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@leonjza",
      "link": "",
      "conference": "DEFCON27",
      "description": "Leon has been hacking for over a decade. Heís plied his trade at SensePost for the last three having previously worked for a bank and ISP in South Africa. Leon spends most of his daytime hours hacking large networks or web and mobile applications. Leon spends most of his nighttime hours building hacking tools and techniques to contribute back to the community.",
      "id": 40095,
      "title": "Researcher - SensePost",
      "name": "Leon Jacobs",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@josephfcox",
      "link": "",
      "conference": "DEFCON27",
      "description": "Joseph is an investigative reporter for Motherboard, the science and technology section of VICE. He covers cybersecurity, the digital underground, and social media platforms.",
      "id": 40096,
      "title": "Senior Staff Writer, Motherboard",
      "name": "Joseph Cox",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@virtualabs",
      "link": "",
      "conference": "DEFCON27",
      "description": "Damien is a senior security researcher who joined Digital Security in 2015 as the head of research and development. He discovered how wireless protocols can be fun to hack and quickly developed BtleJuice, one of the first Bluetooth Low Energy MitM framework, and BtleJack, a BLE swiss-army knife released in 2018.\n\nDamien presented at various security conferences including DEF CON, Hack In Paris, Chaos Communication Camp, Chaos Communication Congress, BruCon, Hack.lu, anda dozen times at Nuit du Hack, one of the oldest French hacking conference.",
      "id": 40097,
      "title": "Senior Security Researcher @ Econocom Digital.Security",
      "name": "Damien Cauquil (virtualabs)",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@daniel_rome",
      "link": "",
      "conference": "DEFCON27",
      "description": "Daniel is currently a security consultant and researcher at NCC Group. During his career he has worked in interesting security projects, always trying to ìbreakî as much as possible. In the last years Daniel has mostly been focused on embedded devices / IoT and all what surrounds it such as hardware, code review, reverse engineering, fuzzing or exploiting.",
      "id": 40098,
      "title": "Managing Security Consultant, NCC Group",
      "name": "Daniel Romero",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@Grifo",
      "link": "",
      "conference": "DEFCON27",
      "description": "Mario is a penetration tester and security consultant at NCC Group in Madrid. His interests revolve around all areas of computer security, always trying to learn new things, and specially enjoying writing tools during the process to make his life a bit easier.",
      "id": 40099,
      "title": "Senior Security Consultant, NCC Group",
      "name": "Mario Rivas",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@Op_Nomad",
      "link": "",
      "conference": "DEFCON27",
      "description": "Dimitry Snezhkov is a Sr. Security Consultant for X-Force Red. In this role he hacks code, tools, networks, apps and sometimes subverts human behavior too. Dimitry has spoken at DEFCON, THOTCON, DerbyCon, CircleCityCon, NorthSec, and presented tools at BlackHat Arsenal.",
      "id": 40100,
      "title": "Sr. Security Consultant, X-Force Red",
      "name": "Dimitry Snezhkov",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@nikhil_mitt",
      "link": "",
      "conference": "DEFCON27",
      "description": "Nikhil Mittal is a hacker, infosec researcher, speaker and enthusiast. His area of interest includes red teaming, active directory security, attack research, defense strategies and post exploitation research. He has 10+ years of experience in red teaming.\n\nHe specializes in assessing security risks at secure environments that require novel attack vectors and \"out of the box\" approach. He has worked extensively on Active Directory attacks, defense and bypassing detection mechanisms and Offensive PowerShell for red teaming. He is creator of multiple tools like Nishang, a post exploitation framework in PowerShell and Deploy-Deception a framework for deploying Active Directory deception. In his spare time, Nikhil researches on new attack methodologies and updates his tools and frameworks. \n\nNikhil has held trainings and boot camps for various corporate clients (in US, Europe and SE Asia), and at the world's top information security conferences. He has spoken/trained at conferences like Defcon, BlackHat, CanSecWest, BruCON, 44CON and more. He blogs at https://www.labofapenetrationtester.com/",
      "id": 40101,
      "title": "PentesterAcademy",
      "name": "Nikhil Mittal",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@zyx2k",
      "link": "",
      "conference": "DEFCON27",
      "description": "Campbell Murray is the global head of BlackBerry Cybersecurity Delivery and joined the organization through the acquisition of Encription Ltd, of which he was a founder and director. He has over 20 yearsí cybersecurity experience with an emphasis on offensive security techniques and security engineering in the IoT, industrial and transport arenas. Campbell is a founding director of both the TigerScheme and the CyberScheme.",
      "id": 40102,
      "title": "Global Head Cybersecurity Delivery, BlackBerry",
      "name": "Campbell Murray",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Michael Eoin Buckley is a senior cybersecurity consultant at BlackBerry with over 20 yearsí experience spanning cybersecurity consultancy, product security and both security and physical layer aspects of 3GPP cellular, Zigbee and IETF standards. In his role he leads the cybersecurity engineering effort and specializes in product security assessments of several areas such as automotive, healthcare and aerospace. Eoin holds a Ph.D. from Cornell University with a thesis focus on error control coding.",
      "id": 40103,
      "title": "Senior Cybersecurity Consultant",
      "name": "Eoin Buckley",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "James Kulikowski is a senior cybersecurity consultant at Blackberry and an active member at Unallocated Space in Baltimore Maryland. In his 15 years, James has worked with clients from the DoD and Intel community to companies in finance, healthcare and transportation. James previously specialized in risk management and policy development before transitioning to hardware and software security assessments.",
      "id": 40104,
      "title": "Senior Cybersecurity Consultant",
      "name": "James Kulikowski",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@Iskuri1",
      "link": "",
      "conference": "DEFCON27",
      "description": "Chris is a seasoned security researcher and testing consultant. His main focuses are in reverse engineering hardware, fingerprinting USB vulnerabilities and playing with Software Defined Radios, with his key strength lying in firmware analysis, which he utilises as part of the hardware testing team at Pen Test Partners.",
      "id": 40105,
      "title": "",
      "name": "Christopher Wade",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@pwntester",
      "link": "http://www.pwntester.com",
      "conference": "DEFCON27",
      "description": "Alvaro MuÒoz (@pwntester) is Principal Security Researcher at Micro Focus Fortify where he researches new software vulnerabilities and implement systems to detect them. His research focuses on web application frameworks where he looks for vulnerabilities or unsafe uses of APIs. Before joining the research team, he worked as an Application Security Consultant helping enterprises to deploy application security programs. MuÒoz has presented at many Security conferences including BlackHat, DEF CON, RSA, OWASP AppSec US & EU, JavaOne, etc and holds several infosec certifications, including OSCP, GWAPT and CISSP. He plays CTFs with Spanish int3pids team and blogs at http://www.pwntester.com.",
      "id": 40106,
      "title": "Software Security Researcher @ Fortify (Micro Focus)",
      "name": "Alvaro MuÒoz",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@olekmirosh",
      "link": "",
      "conference": "DEFCON27",
      "description": "Oleksandr Mirosh has over 11 years of computer security experience, including vulnerability research, penetration testing, reverse engineering, fuzzing, developing exploits and consulting. He is working for Fortify Software Security Research team in Micro Focus investigating and analyzing new threats, vulnerabilities, security weaknesses, new techniques of exploiting security issues and development vulnerability detection, protection and remediation rules. In the past, he has performed a wide variety of security assessments, including design and code reviews, threat modelling, testing and fuzzing in order to identify and remove any existing or potentially emerging security defects in the software of various customers.",
      "id": 40107,
      "title": "Software Security Researcher @ Fortify (Micro Focus)",
      "name": "Oleksandr Mirosh",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@GullOmer",
      "link": "",
      "conference": "DEFCON27",
      "description": "Omer Gull is a vulnerability researcher in the Malware and Vulnerability Research group at Check Point Software Technologies.\n\nOmer has a diverse background in security research, that includes web application penetration testing, RE and exploitation.\n\nHe loves Rum, Old School Hip-Hop and Memory Corruptions.",
      "id": 40108,
      "title": "Security Researcher at Check Point Software Technologies",
      "name": "Omer Gull",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@teamsik",
      "link": "",
      "conference": "DEFCON27",
      "description": "Bio Coming Soon",
      "id": 40109,
      "title": "Fraunhofer SIT",
      "name": "Stephan Huber",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Bio Coming Soon",
      "id": 40110,
      "title": "",
      "name": "Philipp Roskosch",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@Mshudrak",
      "link": "",
      "conference": "DEFCON27",
      "description": "Maksim is a security researcher and vulnerability hunter in open-source and blackbox applications. In the past, he had experience working on dynamic binary instrumentation framework DynamoRIO, developing extremely abstract Windows OS emulator for malware analysis at IBM Research as well as writing sophisticated fuzzer to search for vulnerabilities in machine code.  The latter was so exciting that he defended PhD on this topic. Today, he works on Red Team side at large cloud-based software company.\n\nMaksim has spoken at various security conferences around the world such as DEF CON, Positive Hack Days, Virus Bulletin and BSides SF.",
      "id": 40111,
      "title": "Security Researcher",
      "name": "Maksim Shudrak",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@switchp0rt",
      "link": "",
      "conference": "DEFCON27",
      "description": "Kyle is a Senior Threat Researcher in Carbon Black's TAU team. He has over 10 years of experience in many areas of computer science and IT. Prior to Carbon Black, Kyle worked in finance and with the DoD in various roles ranging from network/systems administrator, software engineer, reverse engineer, penetration tester and offensive tool developer. At Carbon Black, Kyle's focus is on large scale program analysis, primarily static but moving asymptotically toward dynamic analysis.",
      "id": 40112,
      "title": "Senior Threat Researcher, Carbon Black",
      "name": "Kyle Gwinnup",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@skipwich",
      "link": "",
      "conference": "DEFCON27",
      "description": "John is a Threat Researcher on Carbon Black's Threat Analysis Unit, focusing on automation of threat detection and building out infrastructure for large scale malware analysis. Within the field of threat detection and analysis, John specializes his research in binary classification, dynamic analysis and reverse engineering.",
      "id": 40113,
      "title": "Threat Researcher",
      "name": "John Holowczak",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@JesseMichael",
      "link": "",
      "conference": "DEFCON27",
      "description": "Jesse Michael is an experienced security researcher focused on vulnerability detection and mitigation who has worked at all layers of modern computing environments from exploiting worldwide corporate network infrastructure down to hunting vulnerabilities inside processors at the hardware design level. His primary areas of expertise include reverse engineering embedded firmware and exploit development. He has also presented research at DEF CON, Black Hat, PacSec, Hackito Ergo Sum, Ekoparty, and BSides Portland.",
      "id": 40114,
      "title": "",
      "name": "Jesse Michael",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@HackingThings",
      "link": "",
      "conference": "DEFCON27",
      "description": "Mickey Shkatov, a principal researcher at Eclypsium, has been performing security research and product security validation since 2010, He has also presented multiple times at DEF CON, Black Hat, PacSec, CanSecWest, BruCon, Hackito Ergo Sum, and BSides Portland.",
      "id": 40115,
      "title": "",
      "name": "Mickey Shkatov",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "g richter is the single-use pseudonym of a security researcher with a particular interest in embedded devices and cellular. He has done this kind of thing for money and fun for quite a while now, but before that, he also did other things that didnít involved as many computers. At the moment he's doing this for money at Pen Test Partners.",
      "id": 40116,
      "title": "Senior Researcher, Pen Test Partners LLP",
      "name": "g richter",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Gerald Doussot is a Principal Security Consultant at NCC Group, with over 20 years experience in information technology. Gerald has undertaken defensive and offensive security roles, including the design, implementation and management of security solutions, software development, integration and security Testing.",
      "id": 40117,
      "title": "Principal\nSecurity Consultant, NCC Group",
      "name": "Gerald Doussot",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Roger Meyer is a Principal Security Engineer at NCC Group with extensive experience in managing and leading complex engagements.  Roger specializes in web application security, network penetration testing, configuration reviews, and secure software development and architecture design.",
      "id": 40118,
      "title": "Principal\nSecurity Consultant, NCC Group",
      "name": "Roger Meyer",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@ale_sp_brazil",
      "link": "http://www.blackstormsecurity.com/bs/en/en_articles.html, Tool: https://github.com/alexandreborges/malwoverview",
      "conference": "DEFCON27",
      "description": "Alexandre Borges is a Security Researcher, who has been daily working on Reverse Engineering and Digital Forensic Analysis for many years.\n\nHe has taught training courses about Malware and Memory Analysis, Digital Forensics Analysis and Mobile Forensics around the world. Furthermore, Alexandre is the creator and maintener of Malwoverview triage tool: https://github.com/alexandreborges/malwoverview .\n\nAlexandre has spoken in several conferences such as DEF CON USA (2018), DEF CON CHINA (2019),  CONFidence Conference 2019, HITB 2019 Amsterdam, H2HC Conference (2015/2016), BSIDES Sao Paulo (2019/2018/2017/2016) and BHACK Conference (2018).\n\nFinally, it is a referee of Digital Investigation:The International Journal of Digital Forensics & Incident Response (https://www.journals.elsevier.com/digital-investigation/editorial-board)",
      "id": 40119,
      "title": "Security Researcher at\nBlackstorm Security",
      "name": "Alexandre Borges",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Dr. Brent Stone is a Cyber officer with the U.S. Military. His professional experience includes 10 years of IT and cyber work in North America, the Middle East, and Asia. The focus of his PhD research was developing AI methods to help security researchers overcome the 'security through obscurity' used in the automotive industry. He presented initial findings at the 2018 IEEE Connected and Automated Vehicles Symposium and is an active member of the Open Garage's car hacking group. He holds a B.S. in Computer Science from West Point, M.S. in IT security from Carnegie-Mellon, and PhD in Computer Science from the Air Force Institute of Technology.",
      "id": 40120,
      "title": "",
      "name": "Brent Stone",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@DEFCON_NOC, @effffn, @macmceniry, @Mike_Moore, @mansimusa, @c7five, @_CRV, @jaredbird, all the other NOC members who refuse to share their twitter handles and our very special guest Lord Raytheon",
      "id": 40121,
      "title": "",
      "name": "The DEF CON NOC",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@nianasavage",
      "link": "",
      "conference": "DEFCON27",
      "description": "Nina Kollars is writing a book about the ways in which hackers contribute to national security. She is a political scientist whose main research is in technological adaptation by users. Kollars is Associate Professor for the Naval War College in the Strategic and Operational Research Department. She conducts research on military weapons and the humans who use them. Largely unsatisfied with sitting still, Kollars has also worked for the Library of Congress' Federal Research Division, the Department of Afro-American Studies at Harvard University, the World Bank, an anti-glare coating factory on the third shift, and volunteers for BSides. She is the former viceroy of the DC strategy group Cigars, Scotch, and Strategy. She is also a certified bourbon steward.",
      "id": 40122,
      "title": "Associate Professor Naval War College Strategic and Operational Research Department",
      "name": "Nina Kollars",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40123,
      "title": "",
      "name": "Kitty Hegemon",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@seemoolab",
      "link": "",
      "conference": "DEFCON27",
      "description": "Jiska has a M.Sc. in IT-Security. She is a PhD student at the Secure Mobile Networking Lab (TU Darmstadt) since May 2014. Her main research interest are wireless physical layer security and reverse engineering. You might also know her embroidery projects or game shows from past CCC events.",
      "id": 40124,
      "title": "TU Darmstadt, Secure\nMobile Networking Lab",
      "name": "jiska",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Fabian has a M.Sc. in IT-Security. He is working as a researcher and analyst at ERNW. His main research interests are full stack IoT and web application security. In his free time, Fabian likes to capture some flags.",
      "id": 40125,
      "title": "",
      "name": "clou (Fabian Ullrich)",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@andywgrant",
      "link": "",
      "conference": "DEFCON27",
      "description": "Andy Grant is a Technical Vice President for NCC Group. While at NCC Group, Andy has worked on a wide-variety of security assessment and advisory projects. He has performed numerous application assessments on mobile (Android, iOS, WP7), desktop (OS X/macOS, Windows, Linux), and web platforms. He has also performed many internal and external network penetration tests and widget/third-party platform reviews. Andy has worked with small tech start-ups, small and large software development groups, and large financial institutions. Andy has a BS in Computer Science and an Advanced Computer Security Certificate from Stanford University.",
      "id": 40126,
      "title": "Technical Vice President, NCC Group",
      "name": "Andy Grant",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@DEFCON_NOC, @effffn, @macmceniry, @Mike_Moore, @mansimusa, @c7five, @_CRV, @jaredbird, all the other NOC members who refuse to share their twitter handles and our very special guest Lord Raytheon",
      "id": 40127,
      "title": "",
      "name": "(cont) The DEF CON NOC",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "droogie is a security researcher, interested in offensive security and hacking of retro and modern video games alike. He makes a living as a security consultant at IOActive, which helps fund his degenerate passion for hardware hacking on old video game console hardware. Heís spoken at conferences like CCC and Ruxcon and helped bring Metal Gear Online back to life, he enjoys international travel to security conferences to kick it with awesome hackers.",
      "id": 40128,
      "title": "Security Consultant at IOActive",
      "name": "droogie",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@artsploit",
      "link": "",
      "conference": "DEFCON27",
      "description": "Michael Stepankin is a Security Researcher at Veracode. He works on bringing new detection features to Veracodeís dynamic and static scanner engines. As a passionate hacker, he loves to hack enterprise java applications by day and write beautiful JavaScript code by night. Listed in Halls of Fame of various bug bounty programs, Michael has also worked as a penetration tester for many years.",
      "id": 40129,
      "title": "Security Researcher at Veracode",
      "name": "Michael Stepankin",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Kurt Opsahl is the Deputy Executive Director and General Counsel of the Electronic Frontier Foundation. In addition to representing clients on civil liberties, free speech and privacy law, Opsahl counsels on EFF projects and initiatives.  Opsahl is the lead attorney on the Coders' Rights Project, and is representing several companies who are challenging National Security Letters.  Before joining EFF, Opsahl worked at Perkins Coie, where he represented technology clients with respect to intellectual property, privacy, defamation, and other online liability matters, including working on Kelly v. Arribasoft, MGM v. Groksterand CoStar v. LoopNet. For his work responding to government subpoenas, Opsahl is proud to have been called a \"rabid dog\" by the Department of Justice. Prior to Perkins, Opsahl was a research fellow to Professor Pamela Samuelson at the U.C. Berkeley School of Information Management & Systems. Opsahl received his law degree from Boalt Hall, and undergraduate degree from U.C. Santa Cruz. Opsahl co-authored \"Electronic Media and Privacy Law Handbook.\" In 2007, Opsahl was named as one of the \"Attorneys of the Year\" by California Lawyer magazine for his work on the O'Grady v. Superior Courtappeal. In 2014, Opsahl was elected to the USENIX Board of Directors.",
      "id": 40130,
      "title": "Deputy Executive Director And General Counsel",
      "name": "Kurt Opsahl",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Camille Fischer is a Frank Stanton Fellow working on EFFís free speech and government transparency projects. Camille came to EFF from D.C. where she worked in the Obama White House and in the Department of Commerce advocating for civil, human rights, and due process protections in national security and law enforcement policies. She also ran projects to increase consumer security and privacy, like the move to chip cards (sorry not sorry), and has war stories about ECPA Reform, MLATs, and encryption. Camille graduated from Georgetown University Law Center and the University of Georgia (Go Dawgs). She takes pics and bakes pies.",
      "id": 40131,
      "title": "Frank Stanton Fellow",
      "name": "Camille Fischer",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Bennett is an engineer on the Tech Projects team, where he works on Privacy Badger and HTTPS Everywhere.\n\nBefore EFF, Bennett was at Access Now and MIT, and he has a Master's of Engineering for work on privacy-preserving machine learning. He cares about privacy, transparency, data ownership, and digital equity. He wishes ad companies would kindly stop tracking everyone. Outside of work he has hobbies and likes fun.",
      "id": 40132,
      "title": "Staff Technologist",
      "name": "Bennett Cyphers",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "As EFF's Grassroots Advocacy Organizer, nash works directly with community members and organizations to take advantage of the full range of tools provided by access to tech, while engaging in empowering action toward the maintenance of digital privacy and information security.",
      "id": 40133,
      "title": "Grassroots Advocacy Organizer",
      "name": "Nathan 'nash' Sheard",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Shahid leads EFF's grassroots, student, and community outreach efforts. He's a constitutional lawyer focused on the intersection of community organizing and policy reform as a lever to shift legal norms, with roots in communities across the country resisting mass surveillance. From 2009 to 2015, he led the Bill of Rights Defense Committee as Executive Director. \n\nOutside of his work at EFF, Shahid also DJs and produces electronic music, writes poetry & prose, kicks rhymes, organizes guerilla poetry insurgencies, plays capoeira, speaks truth to power on Truthout, occasionally elucidates legal scholarship, and documents counter-cultural activism for the Burning Man Journal. He also serves on the Boards of Directors of Defending Rights and Dissent, the Center for Media Justice, and the Fund for Constitutional Government.",
      "id": 40134,
      "title": "Panel Host, Director of Grassroots Advocacy",
      "name": "Shahid Buttar",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@MikeGHacks",
      "link": "",
      "conference": "DEFCON27",
      "description": "Mike Godfrey, Director of INSINIA Security, started life as a ìhackerî before he had hit his teens. With a professional background in Electro-technical / Electro-mechanical Engineering and almost 20 yearsí experience in building and breaking computers.\n\nMike offers a unique perspective when it comes to varied and multi-vector attacks and is regarded as one of the UKís most capable multi-skilled Cyber Security Specialists, gaining notoriety in the Cyber Security industry for using elements of different skills, both on hard and soft surfaces, to carry out highly technical and often highly intricate electronic attacks. One of these attacks includes hacking Costcoís high security Sentry display safe with nothing more than a magnet and a sock! This research was utilised and referenced by @Plor in his talk at DEF CON 25 ñ ìPopping a Smart Gunî. Mike has also been lucky enough to become a DEF CON speaker in 2018, one of the proudest moments of his life!\n\nMike works as a Cyber Security contributor for the BBC, LBC, Channel 4 and was the Ethical Hacker who discovered the TalkTalk and O2 data breach stories.",
      "id": 40135,
      "title": "Penetration Tester, INSINIA Security",
      "name": "Mike Godfrey",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@sekuryti",
      "link": "",
      "conference": "DEFCON27",
      "description": "Matthew's previous roles including Senior Penetration Tester and Researcher at SecureLink, Europe's largest managed security services provider and Operational Security Specialist at Ikea overseeing worldwide Operational Security as part of a Specialist Team. \n\nMatthew regularly speaks at industry events and lectures offensive security at Malmˆ's Technology University in Sweden.\n\nMatthew spent over 3 years as part of an R&D team building intrusion detection software, a secure cloud platform, SIEM tools and other security software, Matthew is not only a competent red teamer but also a valuable asset to any blue team.\n\nMatthew works as a Cyber Security contributor for the Telegraph, Talk Radio and SVT.",
      "id": 40136,
      "title": "Penetration Tester, INSINIA Security",
      "name": "Matthew Carr",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@UnaPibaGeek",
      "link": "",
      "conference": "DEFCON27",
      "description": "Sheila Ayelen Berta is an Information Security Specialist and Developer, who started at 12 years-old by herself. At the age of 15, she wrote her first book about Web Hacking, published by RedUSERS Editorial in several countries. Over the years, Sheila has discovered lots of vulnerabilities in popular web applications and softwares. She also has given courses of Hacking Techniques in universities and private institutes in Argentina. Sheila currently works as Security Researcher who specializes in offensive techniques, reverse engineering and exploit writing. She is also a developer in ASM (microcontrollers and microprocessors x86/x64), C/C++, Golang and Python. Sheila is an international speaker who has spoken at important security conferences such as Black Hat Briefings, DEFCON 26, DEFCON 25 CHV, HITB, HackInParis, Ekoparty, IEEE ArgenCon, Hack.Lu, OWASP Latam Tour and others.",
      "id": 40137,
      "title": "Security Researcher",
      "name": "Sheila Ayelen Berta",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@smealum",
      "link": "",
      "conference": "DEFCON27",
      "description": "smea got his start making video games for closed consoles like the Nintendo DS using whatever hacks were available at the time. At some point consoles started getting actual security features and he transitioned from just making homebrew software to actually making the jailbreaks that let people run it. He's best known for his work on the Nintendo 3DS and Wii U but has also done exploitation work against high profile web browsers and virtualization stacks. Now he hacks buttplugs, apparently.",
      "id": 40138,
      "title": "",
      "name": "smea",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Jack Baker is a professional vulnerability researcher and amateur video game hacker. His primary areas of expertise include web application security, embedded reverse engineering, and Tony Hawk's Pro Skater 3.",
      "id": 40139,
      "title": "",
      "name": "Jack Baker",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@h3rb0x",
      "link": "",
      "conference": "DEFCON27",
      "description": "Xiangqian Zhang is a security researcher at Tencent Security Xuanwu Lab and his research focuses on Mobile Security and IOT Security. Xiangqian found multiple Android kernel and system security vulnerabilities.",
      "id": 40140,
      "title": "",
      "name": "Xiangqian Zhang",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@liuhm09",
      "link": "",
      "conference": "DEFCON27",
      "description": "Huiming Liu is a security researcher at Tencent Security Xuanwu Lab and his research focuses on Mobile Security and IOT Security. Huiming has spoken at several security conferences including CanSecWest and BlackHat Asia.",
      "id": 40141,
      "title": "",
      "name": "Huiming Liu",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Hadrien Barral is an R&D engineer, focusing on Operating Systems, Security and High-Assurance software. In his spare time, he enjoys hacking on various and obscure systems.",
      "id": 40142,
      "title": "Hacker",
      "name": "Hadrien Barral",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "RÈmi GÈraud-Stewart is a cryptologist and security expert with Ecole normale superieure in Paris, focusing on intrusion and cyberwarfare.",
      "id": 40143,
      "title": "Hacker",
      "name": "RÈmi GÈraud-Stewart",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Georges-Axel Jaloyan is a PhD student at Ecole normale supÈrieure in Paris focusing on formal methods applied to reverse-engineering, in collaboration with the French Alternative Energies and Atomic Energy Commission (CEA).",
      "id": 40144,
      "title": "PhD Student at ENS",
      "name": "Georges-Axel Jaloyan",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@PcabreraCamara",
      "link": "http://www.fakebts.com",
      "conference": "DEFCON27",
      "description": "Industrial and Electronics Engineer, Pedro is an enthusiast of Software Defined Radio and UAVs, which has worked for 12 years in the main Spanish telecommunications operators, conducting security audits and pentesting in mobile and fixed networks. In addition to working with telecommunications operators, Pedro leads open source projects such as intrusion detection systems for GSM, UMTS and LTE networks, which has led him to study the various fake stations attacks and existing solutions. In recent years he has participated in security events in the United States (RSA, CyberSpectrum, Defcon DemoLabs), Asia (BlackHat Trainings) and Europe (Rootedcon, Euskalhack, AlligatorCON)",
      "id": 40145,
      "title": "Founder, Ethon Shield",
      "name": "Pedro Cabrera Camara",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@Gxiling",
      "link": "",
      "conference": "DEFCON27",
      "description": "Xiling Gong is a Senior Security Researcher of Tencent Blade Team. He has discovered many vulnerabilities of vendors like Google and Qualcomm. He is the speaker of CanSecWest 2018.",
      "id": 40146,
      "title": "Consultant, NCC Group",
      "name": "Xiling Gong",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@tencent_blade",
      "link": "",
      "conference": "DEFCON27",
      "description": "Peter Pi is a Senior Security Researcher of Tencent Blade Team. He has discovered many vulnerabilities of vendors like Google, Microsoft, Apple, Qualcomm, Adobe and Tesla. He was the #1 researcher of Google Android VRP in year 2016. He has spoken at many famous security conferences such as BlackHat, CanSecWest, HITB GSEC and Hitcon.",
      "id": 40147,
      "title": "Senior Security Researcher of Tencent Blade Team",
      "name": "Peter Pi",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@EyalItkin",
      "link": "",
      "conference": "DEFCON27",
      "description": "Eyal Itkin is a vulnerability researcher in the Malware and Vulnerability Research group at Check Point Software Technologies. Eyal has an extensive background in security research, that includes years of experience in embedded network devices and protocols, bug bounties from all popular interpreter languages, and an award by Microsoft for his CFG enhancement white paper.\n\nWhen not breaking I2P or FAX, he loves bouldering, swimming, and thinking about the next target for his research.",
      "id": 40148,
      "title": "Vulnerability Researcher at Check Point Software Technologies",
      "name": "Eyal Itkin",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@_dirkjan",
      "link": "",
      "conference": "DEFCON27",
      "description": "Dirk-jan is one of the core researchers of Active Directory and Azure AD at Fox-IT. Amongst the open source tools published to advance the state of AD research are aclpwn, krbrelayx, mitm6, ldapdomaindump and a Python port of BloodHound. He blogs at dirkjanm.io, where he publishes about new Active Directory attack chains, which included the discovery of the PrivExchange vulnerability. He is also co-author of ntlmrelayx and contributor to several other open source tools and libraries. After discovering that breaking stuff is a lot of fun he never looked back at his freelance web developer days, but is still thankful for the knowledge and experience that those days provided him.",
      "id": 40149,
      "title": "Security Expert - Fox-IT",
      "name": "Dirk-jan Mollema",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Hila Cohen is a passionate Security Researcher at XM Cyber, where she investigates new attack techniques and develops detection and mitigation capabilities. Hila has a vast knowledge in the fields of malware analysis, reverse engineering and incident response.",
      "id": 40150,
      "title": "Security Researcher, XM Cyber",
      "name": "Hila Cohen",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Amit Waisel is a Senior Technical Leader at XM Cyber. He is a seasoned data security expert with vast experience in cyber offensive projects. Prior to XM Cyber, Amit filled multiple data security positions in the Israeli intelligence community. Amit is well experienced with malware detection and analysis techniques, operating system internals and security-oriented software development. He graduated with honors from Tel Aviv University with a MSc. in Computer Science.",
      "id": 40151,
      "title": "Senior Technical Leader, XM Cyber",
      "name": "Amit Waisel",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@albinowax",
      "link": "https://skeletonscribe.net/",
      "conference": "DEFCON27",
      "description": "James Kettle is Head of Research at PortSwigger Web Security, where he designs and refines vulnerability detection techniques for Burp Suite's scanner. Recent work has focused on using web cache poisoning to turn caches into exploit delivery systems. James has extensive experience cultivating novel attack techniques, including server-side RCE via Template Injection, client-side RCE via malicious formulas in CSV exports, and abusing the HTTP Host header to poison password reset emails and server-side caches. He has spoken at numerous prestigious venues including both BlackHat USA and EU, and OWASP AppSec USA and EU.",
      "id": 40152,
      "title": "Head of Research, PortSwigger",
      "name": "albinowax",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@junior_baines",
      "link": "",
      "conference": "DEFCON27",
      "description": "Jacob is the founding member of Tenable's Zero Day Research group. He focuses much of his research efforts on routers and other IoT devices. Sometimes he even finds vulnerabilities.",
      "id": 40153,
      "title": "Research Engineer, Tenable",
      "name": "Jacob Baines",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "The alphabet soup: OSCP, CTL/CCT-APP\n\nSenior pentester and researcher for the last 3 years, with hundreds of successful engagements behind me. Passionate about security and involved in various article pieces for infosec magazine, the BBC and the UK consumer watchdog Which?. Last year I discovered and disclosed an exploit on some Android tablets that allowed RCE through the <img> tag. [ CVE-2018-16618 ]",
      "id": 40154,
      "title": "Senior Security Consultant, SureCloud Ltd",
      "name": "Elliott Thompson",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@darkartlab",
      "link": "",
      "conference": "DEFCON27",
      "description": "Matt is a PhD candidate at the Dawes Centre for Future Crimes, University College London, and leads technical research for the PwC Cyber Security practice in the UK. Prior to joining PwC, Matt led a technical R&D team for a law enforcement agency in the UK. His research interests include antivirus and sandboxing technologies, unconventional attack vectors, side-channels, and radio security.",
      "id": 40155,
      "title": "Cyber Security Research Lead, PwC UK",
      "name": "Matt Wixey",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@nahamsec",
      "link": "",
      "conference": "DEFCON27",
      "description": "Ben is the Hacker Operations Lead at HackerOne by day, and a hacker by night. He has helped identify and exploit over 500 security vulnerabilities across 100s of web and mobile applications for companies such as Yahoo, Airbnb, Snapchat, The US Department of Defense, Yelp, and more. He also invested time in the security community, by creating a community of 200+ active hackers who share ideas and their experiences. He has also held free workshops  and trainings to teach others about security and web application hacking.",
      "id": 40156,
      "title": "Nahamsec†",
      "name": "Ben Sadeghipour",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@daeken",
      "link": "",
      "conference": "DEFCON27",
      "description": "Cody is the Head of Hacker Education at HackerOne where he dedicates his time to teaching hackers to be more effective and empowered. A reverse engineer and software developer with well over a decade of experience. Cody is also the lead instructor for Hacker101, a free course for web security.",
      "id": 40157,
      "title": "",
      "name": "Cody Brocious (Daeken)",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@anishathalye",
      "link": "",
      "conference": "DEFCON27",
      "description": "Anish is a PhD student at MIT working on systems, security, and formal verification. He is currently interested in making hardware wallets more secure. In his free time, he enjoys bending neural networks to his will: among other exploits, he has mastered the art of transfiguration (as far as computers are concerned), exemplified by turning a turtle into a rifle.",
      "id": 40158,
      "title": "PhD student at MIT",
      "name": "Anish Athalye",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Christopher Roberts is a security researcher at REDLattice Inc. He has extensive vulnerability research experience in embedded systems and program analysis frameworks. He competes and speaks in George Masonís competitive cyber club. Heís known for building several tools which automatically solve and produce flags from pwnable and reverseing CTF problems. (Zeratool) (PinCTF)",
      "id": 40159,
      "title": "",
      "name": "Christopher Roberts",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Brad once told his parents that if they gave him a Commodore 64 it would be the last computer heíd ever want. He never got that Commodore 64. Nevertheless Brad managed to become a computer nerd at a young age. Brad studied Computer Engineering at Georgia Tech and jumped into embedded software engineering. He worked for many years helping developers to design embedded Linux into telecom, network, and mobile products. Brad also took a turn as a product manager for embedded development tools and a mobile location analytics product. At Carve he hacks IoT, embedded, and Linux systems.",
      "id": 40160,
      "title": "Security Consultant, Carve Systems",
      "name": "Brad Dixon",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@muellerberndt",
      "link": "https://www.linkedin.com/in/bernhardm/",
      "conference": "DEFCON27",
      "description": "Bernhard Mueller is an OG security engineer and researcher with experience in a variety of fields including Internet protocols, web apps, operating systems, server software and blockchain technology. His work in mobile and blockchain security has earned him two \"Best Research\" Pwnie Award nominations (and one win). In the Ethereum community he is known for creating the Mythril symbolic analyzer.",
      "id": 40161,
      "title": "ConsenSys Diligence",
      "name": "Bernhard Mueller",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "@cleanunicorn",
      "link": "https://www.linkedin.com/in/luca-daniel-5227267/",
      "conference": "DEFCON27",
      "description": "Daniel is a self-taught developer with experience in multiple programming languages. Having a hacker mindset he always tests the limits of software or hardware he interacts with. He likes to experiment with new technologies, always trying to develop his available toolchain. When he isn't glued to a computer screen, he likes to snowboard, read and meditate. He currently does security audits and builds tools for ConsenSys Diligence and the Ethereum ecosystem.",
      "id": 40162,
      "title": "",
      "name": "Daniel Luca",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40163,
      "title": "",
      "name": "Contests & Events",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40164,
      "title": "",
      "name": "The Dark Tangent & Goons",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Madhu Akula is a security ninja, published author and cloud native researcher with an extensive experience. Also he is an active member of the international security, devops and cloud native communities.\nMadhu frequently speaks and runs training sessions at security events and conferences around the world including DEFCON (26, 24), BlackHat USA (2018, 2019), USENIX LISA 2018, Appsec EU 2018, All Day DevOps (2016, 2017, 2018), DevSecCon (London, Singapore, Boston), DevOpsDays India, c0c0n(2018, 2017), Nullcon 2019, SACON 2019, Serverless Summit, null and multiple others.His research has identified vulnerabilities in over 200 companies and organisations including; Google, Microsoft, LinkedIn, eBay, AT&T, WordPress, NTOP and Adobe, etc. He is co-author of Security Automation with Ansible2 (ISBN-13: 978-1788394512), which is listed as a technical resource by Red Hat Ansible.",
      "id": 40165,
      "title": "Hacker",
      "name": "Madhu Akula",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Chris is a security researcher and part of the Offensive Security team at Sophos Labs in Vancouver, Canada. His focus are around reverse-engineering and exploitation, Windows and Linux OS internals, writing code and CTFs.",
      "id": 40166,
      "title": "Security Researcher, Sophos Labs",
      "name": "Chris Alladoum",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Axel is a computer and security enthusiast _.",
      "id": 40167,
      "title": "Hacker",
      "name": "Axel Souchet",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Besim Altinok (@AltnokBesim) has been researching Wi-Fi security for over a decade. He created WiPi-Hunter project against Wi-Fi hackers. He is the author of a book on Wi-Fi security. Besim's work on wireless security has been published in ArkaKapi Magazine and others. He has also spoken at top conferences including BlackHat Europe, Blackhat ASIA, Defcon, and others. \n\nBesim ALTINOK works currently at Barikat Internet Security in Turkey. Besim also founded Pentester Training project.",
      "id": 40168,
      "title": "Founder & CEO,Pentester Training",
      "name": "Besim Altinok",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Bahtiyar Bircan is security enthusiastic with 17 years of experience attacking and securing enterprise IT systems. During his career, he worked on many governments, military and private sector IT security projects.\nHis experience includes penetration testing, security audit, secure system design, and implementation, virtualization and cloud security, incident response, exploit development, security research, system and network administration.\nHe is a regular speaker of national and international security conferences like BlackHat, IDC, NATO, OWASP-TR, NOPCon, Tübitak Bilgi Güvenliği Konferans, IstSec, AnkaSec.\n\nCurrently, he is a senior security consultant, trainer and managing partner for Barikat Akademi. Previously, he worked in several defense contractors and government agencies, like Tubitak Cyber Security Institute and Havelsan in Turkey. He was a part of numerous security projects for government, military, and public institutions. Also, he is an adjunct instructor teaching cybersecurity at TOBB University. He has authored and contributed to various public/internal tools, training courses, and methodologies.",
      "id": 40169,
      "title": "Senior Consultant, Eurocontrol / EATM-CERT ",
      "name": "Bahtiyar Bircan",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Abhay Bhargav is the Founder of we45, a focused Application Security Company. Abhay is a builder and breaker of applications. He is the Chief Architect of \"Orchestron\", a leading Application Vulnerability Correlation and Orchestration Framework. \n\nHe has created some pioneering works in the area of DevSecOps and AppSec Automation, including the world's first hands-on training program on DevSecOps, focused on Application Security Automation. In addition to his work in Application Security Automation, he has created \"ThreatPlaybook\", a unique open-source framework that marries Threat-Modeling (as-Code) with Application Security Automation. In addition to this, Abhay is active in his research of new technologies and their impact on Application Security, namely Containers, Orchestration and Serverless Architectures.\n\nAbhay is a speaker and trainer at major industry events including DEF CON 25 and 26, BlackHat, OWASP AppSecUSA, EU and AppSecCali. His trainings have been sold-out events at conferences like AppSecUSA, EU, AppSecDay Melbourne, CodeBlue (Japan) and so on. He will be training at BlackHat USA 2019. He writes on IT and IT Security-focused areas in his blog. Abhay is the author of two international publications \"Secure Java: For Web Application Development\" and \"PCI Compliance: A Definitive Guide\"",
      "id": 40170,
      "title": "Founder, we45",
      "name": "Abhay Bhargav",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40171,
      "title": "",
      "name": "Nithin Jois",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40172,
      "title": "",
      "name": "Tilak Thimmappa",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Sam Bowne is the proprietor of Bowne Consulting and an instructor at City College San Francisco, and has been teaching hacking and security\nclasses for ten years. He has presented talks and workshops at Defcon, HOPE, RSA, BSidesLV, BSidesSF, and many other conferences. He\nhas a CISSP and a PhD and is a DEF CON Black Badge co-winner.",
      "id": 40173,
      "title": "Proprietor, Bowne Consulting",
      "name": "Sam Bowne",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Elizabeth Biddlecome is a senior researcher at Bowne Consulting, an independent consultant, and a part-time instructor at City College San\nFrancisco, delivering technical training and mentorship to students and professionals. She leverages her enthusiasm for architecture,\nsecurity, and code to design and implement comprehensive information security solutions for business needs. Elizabeth enjoys wielding\neverything from soldering irons to scripting languages in cybersecurity competitions, hackathons, and CTFs.",
      "id": 40174,
      "title": "Senior Researcher, Bowne Consulting",
      "name": "Elizabeth Biddlecome",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Ryan Chapman is an incident response (IR) analyst with a background in host and network forensic analysis; malware analysis; threat intelligence; and all the other fun facets of the blue team realm. Prior to working in IR, Ryan worked as a technical trainer for many years. Outside of work, Ryan spends time with his family, gets tapped on the jiu jitsu mats, and plays plenty of Street Fighter. Hadouken!",
      "id": 40175,
      "title": "Incident Response Analyst",
      "name": "Ryan Chapman",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Matt Cheung started developing his interest in cryptography during an internship in 2011. He worked on implementation of a secure multi-party\nprotocol by adding elliptic curve support to an existing secure text pattern matching protocol. Implementation weaknesses were not a priority and this\nconcerned Matt. This concern prompted him to learn about cryptographic attacks from Dan Boneh's crypto 1 course offered on Coursera and the\nMatasano/cryptopals challenges. From this experience he has given talks and workshops at the Boston Application Security Conference and the DEF CON\nCrypto and Privacy Village.",
      "id": 40176,
      "title": "Hacker",
      "name": "Matt Cheung",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Dino Covotsos is the founder and CEO of Telspace Systems. With over 20 years of experience, he leads the research and technical team at Telspace. Covotsos has many years of experience in the information security sector and has been involved in hundreds of information security projects worldwide. He is also a well-known presenter at international conferences, including Hack In the Box, Sector, H2HC, DEF CON and many more. Covotsos is also passionate about the information security community and is involved various community based projects. Covotsos has several industry certifications, such as the OSCE, OSCP, OSWP and CREST CRT.",
      "id": 40177,
      "title": "Founder & CEO, Telspace Systems",
      "name": "Dino Covotsos",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Having worked in the UK InfoSec industry for around five and a half years at Deloitte and later Context Information Security, Troy abandoned a dreary sun-less London and has been working in the Australian industry out of Sydney for nearly a year with PS+C Pure Hacking. His interest and experience is largely in bespoke penetration testing engagements (red teaming, scenario-based assessments, etc.), with broad coverage across the penetration testing spectrum. Other interests include music, electronics, the outdoors, travel, rugby, CTF, and being bad at golf.",
      "id": 40178,
      "title": "Hacker",
      "name": "Troy Defty",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Erik's first encounter with IT security was when he discovered the fascinating internals and configurability of ISDN NT boxes. Since then he has worked in various network security roles, spending the last few years as a penetration tester in the UK and Australia. He is currently heading up the offensive security team of PS+C Pure Hacking in Sydney. His main professional focus is scenario based and bespoke engagements, with particular interest in network and embedded device security. When not hard at work, you can find him somewhere close to the water, or playing tennis.",
      "id": 40179,
      "title": "Hacker",
      "name": "Erik Dul",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Philippe Delteil is Computer Science Engineer from the University of Chile, he gave his first talk at Defcon 26 Skytalks, called \"Macabre stories of a hacker in the public health sector\", his country's government sent 3 officials to record the talk, over 3 Ministries shut down all their information systems afraid that Philippe would reveal some serious bugs and that Defcon attendees would hack the government, but the systems only were down from friday to monday, the only days hackers work. While living in Brazil he hacked over 3,000 wifi routers of the biggest ISP. Most of the time, he gives classes for free in various topics: CTF, pentesting, programming, Basic computer knowledge. He's been working with Wifi hacking during the last 3 months. He has a company with a very clever name: Info-sec.",
      "id": 40180,
      "title": "Computer Science Engineer",
      "name": "Philippe Delteil",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Victor Faraggi is a student of Computer Science Engineering at the University of Chile. He has developed an interest for Mobile Development, Privacy and, of course, Computer Security. This year, he has been working as a mobile developer in his University Campus. His free time is spent between analog photography, family, friends and HTB. He's also a former student of Philippe's workshop 'Introduction to Pentesting and CTF's'. That's how they met. Now, together with Ilana Mergudich, they bring Wifi Hacking workshop that has already been done in this year's first Defcon China. He remembers dearly the little boy of 15 years old that played OverTheWire wargame's, coming to Defcon 27 is another step in his life.",
      "id": 40181,
      "title": "Student, University of Chile",
      "name": "Victor Faraggi",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Ilana Mergudich Thal is a Computer Science student at Universidad de Chile. She spent a semester in Sweden studying computer security and is currently specializing in cryptography. Trainee at Info-Sec doing Wifi hacking research. Works as a teaching assistant for mathematical and theoretical computer science courses and teaches computational thinking/programming to young children in schools. She became the first woman to represent her university internationally in competitive programming.",
      "id": 40182,
      "title": "Student, University of Chile",
      "name": "Ilana Mergudich Thal",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "eigentourist is a programmer turned data scientist, with 20 years in application development, and three years in the world of big data and machine learning. He began formal education in computer science when the height of software engineering discipline meant avoiding the use of GOTO statements. Over the course of his career, he has created code of beautiful simplicity and elegance, and of horrific complexity and unpredictability. Sometimes, it's hard to tell which was which. Today, he works on predictive models and computing clusters in the health care industry.",
      "id": 40183,
      "title": "Software Engineer, Data Scientist",
      "name": "eigentourist",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Isaac Evans is the leader of a small startup working on giving security tools directly to developers. Previously, he conducted research into binary exploitation bypasses for techniques like control-flow integrity and novel hardware defenses on new architectures like RISC-V as a researcher at the US Defense Department under a SFS program and at MIT Lincoln Laboratory. Isaac received his BS/MS degrees in EECS from MIT. Other interests include next-generation programming languages, secure-by-design frameworks, software-defined radio, and the intersection of cryptography and public policy.",
      "id": 40184,
      "title": "Hacker",
      "name": "Isaac Evans",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Sergei is a co-founder of Open Analysis, and volunteers as a malware researcher. When he is not reverse engineering malware Sergei is focused on building automation tools for malware analysis. Sergei is a strong believer in taking an open, community approach to combating cyber crime. He actively contributes to open source tools and tries to publish as much analysis as possible. With over a decade of experience Sergei has held roles both as the manager of an incident response team, and as a malware researcher.",
      "id": 40185,
      "title": "Co-Founder, Open Analysis",
      "name": "Sergei Frankoff",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Sean is a co-founder of Open Analysis, and volunteers as a malware researcher. He splits his time between reverse engineering malware and building automation tools for incident response. He is an active contributor to open source security tools focused on incident response and analysis. Sean brings over a decade of experience working in a number of incident response and application security roles with a focus on security testing and threat modelling. In his free time Sean loves fly fishing.",
      "id": 40186,
      "title": "Co-Founder, Open Analysis",
      "name": "Sean Wilson",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Richard Gold is a hands-on information security professional, who has over a decade's worth of experience in understanding and securing computer networks. With his background as a Certified SCADA Security Architect and a Ph.D. in Computer Networking, Richard uses knowledge he's gained from breaking into systems to better detect and protect networks, as well as build custom tooling. He regularly speaks on these topics at industry events, universities, and in the media.",
      "id": 40187,
      "title": "Hacker",
      "name": "Richard Gold",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Alex Hammer started hacking as a phreak using a Blue Box and running his own BBS. He's been hacking networks and computers for his entire career. Alex has worked as a computer forensic investigator, a penetration tester, and a security software architect. He has also written books and taught numerous classes on penetration testing, ethical hacking, and network defense. His specialties are PKI, Wi-Fi cracking, and teasing Pip when an 802.11 standard totally ignores standard security practices.",
      "id": 40188,
      "title": "Hacker",
      "name": "Alex Hammer",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Penelope 'Pip' Pinkerton is a veritable Goddess of Wi-Fi and all things RF. She is an expert in radio design, RF behavior, and IEEE standards, and holds an Extra level ham radio license. Pip has taught countless corporate IT staff Wi-Fi topics including security, site survey, RF coverage, and Wi-Fi configuration and management. She has worked at or with many of the large Wi-Fi chipset and device manufacturers and has provided input on standards. Her specialties are knowing pretty much every field defined in every 802.11 standard and making fun of Alex when he doesn't know one.",
      "id": 40189,
      "title": "",
      "name": "Penelope 'Pip' Pinkerton",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Ryan Holeman resides in Austin Texas where he works as the Global Security Overlord on Atlassian's Security team. He is also an advisor for the endpoint security software company Ziften Technologies. He received a Masters of Science in Software Engineering from Kent State University. His graduate research and masters thesis focused on C++ template metaprograming. He has spoken at many respected venues such as Black Hat, DEF CON, Lockdown, BSides, Ruxcon, Notacon, and Shmoocon. He has also published papers though venues such as ICSM and ICPC . You can keep up with his current activity, open source contributions and general news on his blog. His spare time is mostly spent digging into various network protocols, random hacking, creating art, and shredding local skateparks.",
      "id": 40190,
      "title": "Global Security Overlord, Atlassian",
      "name": "Ryan Holeman",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Ben (@CyberPraesidium) brings over 12 years of diverse experience in cyber security, IT, and law. He leads Polito's commercial services including vulnerability assessments, penetration testing, incident response, forensics, and threat hunting. Prior to joining Polito, Ben worked on APT hunt teams at federal and commercial clients. He holds CISSP, GCFA, GWAPT, and Splunk Power User certifications.",
      "id": 40191,
      "title": "Hacker",
      "name": "Ben Hughes",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Liana has a wide range of experience in cybersecurity. She has created tailored cybersecurity frameworks for companies and federal agencies. She has a background in building cybersecurity labs for clients, consulting on Defense-in-Depth strategies based on threat modeling, and performing penetration testing. She holds a Master's degree in Cybersecurity and has earned the Security+, CEH, and CISSP certifications.",
      "id": 40192,
      "title": "Hacker",
      "name": "Liana Parakesyan",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Mattia brings a wide range of experience in IT and cybersecurity, including as Desktop Support with the Italian agency for foreign trade and as a SOC analyst with a major US cybersecurity company. He has worked with SIEMs and conducted penetration testing. He has two Associate's of Applied Science degrees from Stark State College (Cyber Security & Forensics and Network Security, Linux Database Admin). He also has an MBA from Università di Napoli Federico II (Italy) and Security+ certification.",
      "id": 40193,
      "title": "Hacker",
      "name": "Mattia Campagnano",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "As Director of Cyber Operations at HORNE Cyber, Wesley McGrew oversees and participates in offense-oriented services for clients in many areas, including finance, healthcare, manufacturing, and national critical infrastructure. He has presented on topics of penetration testing and and malware analysis at DEF CON and Black Hat USA. He teaches a self-designed course on reverse engineering to students at Mississippi State University, using real-world, high-profile malware samples. Wesley has a Ph.D. in Computer Science from Mississippi State University for his research in vulnerability analysis of SCADA HMI systems.",
      "id": 40194,
      "title": "Hacker",
      "name": "Wesley McGrew",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Tyler Holland is an Operative-Analyst at HORNE Cyber, where he conducts penetration testing, red teaming, and application security engagements. Tyler is an expert in reverse engineering malicious software in support of incident handling engagements.\n",
      "id": 40195,
      "title": "Operator-Analyst, HORNE Cyber",
      "name": "Tyler Holland",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Yacin Nadji is an engineer at Security Scorecard where he applies machine learning to identify companies' infrastructure and understand their security risk. He received his Ph.D. from the School of Computer Science at Georgia Institute of Technology with a focus in Computer Security. He has published 20 academic papers with hundreds of citations, many focused on applying ML to solve security problems.",
      "id": 40196,
      "title": "Engineer, Security Scorecard",
      "name": "Yacin Nadji",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Joshua is a software engineer specializing in information and network security. He has worked in the critical infrastructure and cloud computing industries with employers heavily invested in software and hardware security. Among his passions are hacking, teaching kids to program, attending orchestral concerts with his wife, and figuring out how he can get paid to do it all... legally.\n\nJoshua is the maintainer of the boofuzz network protocol fuzzing framework.",
      "id": 40197,
      "title": "Software Engineer",
      "name": "Joshua Pereyda",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Carl is a security analyst with a passion for network and application security. He works as a blue team member in the higher education field by day and an independent red team researcher by night. His interests include poking around inside software and systems, figuring out what makes them tick. When he's not hunting bugs or writing code, you can find him exploring the great outdoors.",
      "id": 40198,
      "title": "Security Analyst",
      "name": "Carl Pearson",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Fotios (Fotis) Chantzis is a principal information security engineer at Mayo Clinic, where he manages and conducts technical security assessments on medical devices and clinical support systems as well as engaging in penetration tests and red team exercises. Fotis has over 10 years of experience in the information security industry, which includes time spent researching network protocol vulnerabilities and developing security tools. He has been a contributor to the Nmap project since 2009, when he wrote the Ncrack network authentication cracking tool and has published a video course on \"Mastering Nmap\". His research on network security includes exploiting the TCP Persist Timer (Phrack #66) and inventing a stealthy port scanning technique by abusing XMPP. He is a regular speaker in conferences of the information security industry and has been lately leading the technical segment of the Defcon Biohacking Village. His most recent research focus has been on medical device & IoT security.",
      "id": 40199,
      "title": "Principal Information Security Engineer, Mayo Clinic",
      "name": "Fotios Chantzis",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Joshua Reynolds is a Senior Security Researcher with CrowdStrike, where he performs malware reverse engineering and intelligence analysis. Joshua has presented at BSides Calgary, BSides Edmonton and RSAC focusing on Ransomware, malicious document analysis and cryptojacking malware. He is also the co-author of the SAIT Polytechnic Information Systems Security diploma malware analysis course.",
      "id": 40200,
      "title": "Senior Security Researcher, Crowdstrike",
      "name": "Josh Reynolds",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Anthony 'C01_' Rose, CISSP, is the Co-founder of BC Security and Lead Pentester at Merculite Security. He has more than a decade's worth of experience as an Electrical Engineer, managing Red and Blue teams, and hacking buffoonery. His work focuses on wireless network penetration and non-IP based system security with an emphasis on embedded systems security. He has presented at DEF CON 24 and RSA 2017.",
      "id": 40201,
      "title": "Co-founder, Blockchain Security",
      "name": "Anthony Rose",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Jake \"Hubble\" Krasnov is the Co-founder of BC Security. He has spent most of his career as an Astronautical Engineer but has transitioned to cybersecurity. He has spent the last three years developing embedded system cyber testing tools and as a member and Red Team Lead.",
      "id": 40202,
      "title": "Co-founder, Blockchain Security",
      "name": "Jacob \"Hubble\" Krasnov",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Vincent \"Halcyon\" Rose is a software engineer with experience in cloud services. He has a decade of experience in software development and networking. Recently, his focus has been on building ad-serving technologies, web and ad-tracking applications.",
      "id": 40203,
      "title": "Software Engineer",
      "name": "Vincent \"Halycon\" Rose",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Guillaume has worked as a security engineer and consultant, as a manager of blue teams, and way before that, as an enterprise IT person focused on endpoints. Guillaume is currently the Principal Security Researcher at Uptycs, finding new ways to defend systems using the power of osquery. He is also a trainer for Pluralsight, producing training content around topics such as network security monitoring.\nHaving worked for startups as well as Fortune50 companies, he knows how to build a security program, but having had to do the work, he also dislikes doing meaningless \"best practices\" work that has no practical value, and really enjoys leveraging the great open source software available to all of us. \n\nGuillaume has spoken and given workshops at various conferences like BSidesLV, Thotcon and Northsec on many topics, including mobile security, endpoint security, logging and monitoring and much more.",
      "id": 40204,
      "title": "Hacker",
      "name": "Guillaume Ross",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Elad Shamir leads a team of talented security consultants and operators as the Managing Security Consultant at The Missing Link Security.\nElad has a passion for red teaming, and extensive experience in identifying security design flaws in complex systems. He enjoys abusing intended functionality in novel attack techniques and chaining seemingly innocuous security issues in elaborate scenarios.",
      "id": 40205,
      "title": "Managing Security Consultant, The Missing Link Security.",
      "name": "Elad Shamir",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Matt Bush is a security consultant and operator at The Missing Link Security. Matt's current research focuses on developing and weaponizing novel tradecraft for advanced threat simulation.",
      "id": 40206,
      "title": "Security Consultant, The Missing Link Security",
      "name": "Matt Bush",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Philip Young, aka Soldier of FORTRAN, is a leading expert in all things mainframe hacking. Having spoken and taught at conferences around the world, including DEFCON, RSA, BlackHat and keynoting at both SHARE and GSE Europe, he has established himself as the thought leader in mainframe penetration testing. Since 2013 Philip has released tools to aid in the testing of mainframe security and contributed to multiple opensource projects including Nmap, allowing those with little mainframe capabilities the chance to test their mainframes. His hope is that through raising awareness about mainframe security more organizations will take their risk profile seriously.",
      "id": 40207,
      "title": "Hacker",
      "name": "Soldier of Fortran",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Chad Rikansrud, aka Big Endian Smalls, is the Director of North American Operations for RSM Partners - a world leader in IBM mainframe security consulting services. Chad is a nationally recognized security industry speaker, with appearances at: DEF CON, RSA2017, SHARE, and other regional conferences. Most of Chad's 20-year career has been in technology leadership for the financial services industry where he has held various senior leadership positions, including worldwide datacenter operations, infrastructure and recovery responsibility, as well as enterprise-wide system z storage",
      "id": 40208,
      "title": "Director of North American Operations for RSM Partners",
      "name": "Big Endian Smalls",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Gabriel Ryan is an offensive security R&D and consultant at SpecterOps. He is the author of EAPHammer, a toolkit for performing targeted rogue access point attacks against enterprise wireless networks. Gabriel has presented at DEF CON, DerbyCon, Hackfest, and several Security BSides conferences on topics ranging from infrastructure security to access control protocols and red team tradecraft. His professional interests include wireless security, systems internals, low-level programming, and infrastructure automation.",
      "id": 40209,
      "title": "This workshop will instruct attendees on how to carry out sophisticated wireless attacks against corporate infrastructure. Attendees will learn how to attack and gain access to WPA2-Enterprise networks, bypass network access controls, and perform replay attacks to gain administrative control over an Active Directory environment. External wireless adapters and preconfigured live USBs will be provided to all workshop attendees, and material learned in the lectures will be practiced within a realistic lab environment.s",
      "name": "Gabriel \"solstice\" Ryan",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Valerie Thomas is the Technical Director and utilizes her Electrical Engineering education and security consulting background to incorporate a variety of evaluation techniques specific to ICS.",
      "id": 40210,
      "title": "Technical Lead, Securicon",
      "name": "Valerie Thomas",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Harry Regan serves as the Vice President of Consulting Services and has over 40 years of experience in IT and ICS security environments.",
      "id": 40211,
      "title": "Technical Lead, Securicon",
      "name": "Harry Regan",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Harry Thomas is the Lead ICS Security Consultant and performs risk, vulnerability, and penetration tests and assessments for a multitude of ICS organizations. He's developed countless IT and ICS indicators of compromise to help protect the ICS industries against threats. He utilized both offensive and defensive skills to create, design, and implement safe ICS security practices.",
      "id": 40212,
      "title": "Technical Lead, Securicon",
      "name": "Harry Thomas",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Terry is the founder of D6 Research, an independent security analyst firm specializing in identity credentialing, authentication and access control. Terry has spent the last 15 years specializing in large scale enterprise assessments, strategy and remediation for both information and physical security. Terry is a trusted advisor to the enterprise information security, audit, and white hat communities. He is a frequent speaker and trainer to private industry and law enforcement, and is engaged with specialized red teams and active investigations for assistance with situations that involve identity and fraud related crime and attacks.",
      "id": 40213,
      "title": "Founder, D6 Research",
      "name": "Terry Gold",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Alexandrine Torrents is a cybersecurity consultant at Wavestone, a French consulting company. She is specialized in penetration testing, and performed several security assessment on ICS. She worked on a few ICS models to demonstrate attacks on PLCs and she developed a particular tool to request Siemens PLCs. Moreover, she is also working at securing ICS, in the scope of the French military law, enforcing companies offering a vital service to the nation to comply to security rules.",
      "id": 40214,
      "title": "Consultant, Wavestone",
      "name": "Alexandrine Torrents",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Arnaud Soullié is a manager at Wavestone, performing security audits and leading R&D projects. He has a specific interest in Active Directory security as well as ICS, two subjects that tend to collide nowadays. He teaches ICS security and pentests workshops at security conferences (BlackHat Europe 2014, BSides Las Vegas 2015/2016, Brucon 2015/2017, DEFCON 24, DEFCON 26) as well as full trainings (Hack In Paris 2015 and 2018, BlackHat Asia 2019).",
      "id": 40215,
      "title": "Manager, Wavestone",
      "name": "Arnaud Soullié",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Hugo is a computer enthusiast since he was a kid and always curious to know how things worked. He liked everything related to computers. He's a researcher by passion, consultant by job and penetration tester by heart. He finds himself at peace while poking holes in applications/networks/systems, while writing security tools tailored to the assessments requirement and indeed while meditating. Always wants to known a better more efficient way of doing things.",
      "id": 40216,
      "title": "Hacker",
      "name": "Hugo Trovao",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "He is a security analyst. Having more than six years of experience under his belt, his assignments have always been pointed towards reducing the state of insecurity for information. His research papers were accepted at NCACNS 2013, nullcon '14 & '18, HITCON '14, Defcamp '14, BruCON '15 '16 '17 '18, DEFCON 24, x33fcon '17 & '18, c0c0n-X '17, Bsides Delhi '17, BlackHat USA '18, DEFCON 26 + Co-author of \"DECEPTICON,\" an intelligent evil-twin. Being an avid CTF player, for him, solace is messing up with packets, frames, and shellcodes.",
      "id": 40217,
      "title": "Hacker",
      "name": "Rushikesh D. Nandedkar",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Mauricio Velazco (@mvelazco) is a Peruvian, Infosec geek who started his career as a penetration tester and jumped to the blue team 7 years ago. He currently leads the Threat Management team at a financial services organization in New York where he focuses on threat detection/hunting and adversary simulation. Mauricio has presented and hosted workshops at conferences like Defcon, Derbycon and BSides. He also holds certifications like OSCP and OSCE.",
      "id": 40218,
      "title": "Threat Management Team Lead",
      "name": "Mauricio Velazco",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Olindo Verrillo is a Senior Security Engineer who straddles the line between blue and red. He currently focuses most of his attention on purple teaming and detection engineering. Olindo has worked as Senior consultant, performing both offensive and defensive engagements for numerous Fortune 500 companies.",
      "id": 40219,
      "title": "Hacker",
      "name": "Olindo Verrillo",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Kristy Westphal is a versatile information technology professional with specific experience in providing advisory and management services in the area of information security and risk. She currently runs an incident response team at a large organization in Tempe, AZ. Specializing in leadership and program development, specific expertise in security areas includes: process analysis, risk assessments, security awareness programs, operating system security, network security, incident handling, vulnerability analysis and policy development.",
      "id": 40220,
      "title": "Hacker",
      "name": "Kristy Westphal",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Kent Britain has been professionally designing antennas for over 25 years. He has developed over 1200 specialized antennas for consumer products, government agencies, military applications, and satellites. The antenna columnist for Monitoring Times, Popular Communications, CQ, CQVHF, and DUBUS magazines.",
      "id": 40221,
      "title": "",
      "name": "Kent Britain",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Alex has over 25 years of experience in the Telecommunications, Information Technology and IT Security fields. He was responsible for the creation and deployment of solutions protecting networks, systems and information assets for a large number of organizations in both the private and public sectors.   Alex is a brain and architect behind Airbud appliance - the ultimate wireless development and testing platform ready to use with a full spectrum of wireless applications like pentesting and monitoring or router and firewall projects. Number of custom models developed are using antennas created together with Kent's help and advice. Reference - www.alftel.com",
      "id": 40222,
      "title": "",
      "name": "Alexander Zakharov",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Mark is a security engineer that does operating system security things on Windows and Linux. He likes coding in Go a lot and is a consistent believer that this year will be the Year of Linux on the Desktop.",
      "id": 40223,
      "title": "",
      "name": "Mark Ignacio",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Pavel is a security consultant for Context Information Security, based in London. Other than security related interests, hobbies include playing around with raspberry pi’s, making “books to read” lists that will never be read, and starting side-projects that never finish. Also, for 10 years he’s been a PHP developer therefore spends his extra time defending PHP.",
      "id": 40224,
      "title": "",
      "name": "Pavel Tsakalidis",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Tanner Barnes is a cyber security consultant for AON Cyber Solutions providing full scope security assessment services for clients. When he isn't assessing clients security he's building new tools to help improve the lives of others hackers.",
      "id": 40225,
      "title": "",
      "name": "Tanner Barnes",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "I’m a blue-team lead professionally.  I delight in thinking of ways to defeat my own processes and then admitting these flaws publicly.  I spoke at DEF CON 24 about using copiers to load code on closed networks, at the Lockpick Village at DEF CON 26 about exploiting human laziness on multi-dial combination locks, and at BSidesLV 2018 on quantitative risk analysis.  Lastly, I'm the only person I've ever met that's literally been bitten by an otter.  You think they are cuddly and cute; I think they are underestimated aquatic apex predators.",
      "id": 40226,
      "title": "",
      "name": "Mike Rich",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Emilio Couto (@ekio_jp) is a Security Consultant with more than 20 years of experience in the network and security field. Born and raised in Argentina, he is currently located in Japan where multitasking between language, culture and technologies is a must. Over the last decade focusing mainly on Finance IT and presenting tools in conferences (BlackHat Asia, HITB, AV Tokyo, SECCON and HamaSec) In his spare time he enjoys 3D printing, tinkering electronics and home-made IoT devices.",
      "id": 40227,
      "title": "",
      "name": "Emilio Couto",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Fabian Obermaier is a software engineer specializing in web technology. He is currently working in the health sector and visits DEF CON to see if his claims hold up against a crowd of hackers. His passions include free and open source soft- and hardware, the web and it's security.",
      "id": 40228,
      "title": "",
      "name": "Fabian Obermaier",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Jakub Botwicz works as a Principal Security Engineer at the Samsung Poland R&D Center leading a team of security researchers. He has more than 15 years of experience in information security and previously worked in one of the worlds leading payment card service providers, Big4 consulting company and vendor of network encryption devices. Jakub holds a PhD degree from the Warsaw University of Technology and multiple security community certificates including: GWAPT, CISSP, ECSA. Currently, he works providing security assessments (static and dynamic analyses) of different mobile and IoT components. His hobbies are rock climbing and mountaineering (especially on volcanoes!).",
      "id": 40229,
      "title": "",
      "name": "Jakub Botwicz",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Ralf Almon is a Security Analyst with years of experience in penetration testing. He works at usd AG in Germany and holds a master’s degree in Information Security from TU Darmstadt. He gained a lot of industry knowledge working as a consultant in various industries ranging from aerospace and aviation to the finance sector.",
      "id": 40230,
      "title": "",
      "name": "Ralf Almon",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Sebastian Puttkammer is a Security Analyst working for usd AG in Germany. His main interests are network/web app security and reverse engineering. He holds a master’s degree in computer science from TU Darmstadt. He is currently in charge of the Code Review Team at usd AG and performs black-box and white-box pentests.",
      "id": 40231,
      "title": "",
      "name": "Sebastian Puttkammer",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Aleksandar recently received his Masters in Computer Science from the University of Minnesota Duluth. In addition to his studies, he works part time at Sandia National Labs as a graduate intern. He works on various projects involving penetration testing, reverse engineering, and tool development. A security enthusiast, he has also pursued certifications in web penetration testing and offensive security. Aleksandar enjoys practicing his skills with CTFs, developing tools, and working on projects to make the security community better.",
      "id": 40232,
      "title": "",
      "name": "Aleksandar Straumann",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Gabriel Ryan is an offensive security R&D and consultant at SpecterOps. He is the author of EAPHammer, a toolkit for performing targeted rogue access point attacks against enterprise wireless networks. Gabriel has presented at DEF CON, DerbyCon, Hackfest, and several Security BSides conferences on topics ranging from infrastructure security to access control protocols and red team tradecraft. His professional interests include wireless security, systems internals, low-level programming, and infrastructure automation.",
      "id": 40233,
      "title": "",
      "name": "Gabriel Ryan",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Aseem Jakhar is the Director, research at Payatu Software Labs https://payatu.com a security testing company specialized in IoT, Embedded, cloud, mobile security. He is the founder of null-The open security community, a registered not-for-profit organization https://null.co.in and also organizes https://nullcon.net and https://hardwear.io security conferences. He has worked on various security software including UTM appliances, messaging/security appliances, anti-spam engine, anti-virus software, bayesian engine to name a few. He currently spends his time researching on IoT security and hacking things. He is an active speaker and trainer at security conferences like AusCERT, Black Hat, Brucon, Defcon, Hack.lu, Hack in Paris, Hack In The Box, PHDays and many more. He has authored various open source security software including   - EXPLIoT - IoT Exploitation Framework   - DIVA (Damn Insecure and Vulnerable App) for Android   - Jugaad/Indroid - Linux Thread injection kit for x86 and ARM   - Dexfuzzer - Dex file format fuzzer",
      "id": 40234,
      "title": "",
      "name": "Aseem Jakhar",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Murtuja Bharmal is an application and network security enthusiast, having 15+ years of industry experience on the offensive as well as the defensive side of security. He is the Co-Founder and Director at Payatu Software Labs, a security testing company specialized in IoT, Embedded, cloud, mobile security. He is also the Founder of null (The Open Security Community) - http://null.co.in, nullcon (International security conference) - http://nullcon.net and hardwear.io security conference - http://hardwear.io.   He has worked extensively on network and web application security assessment and served various financial organizations in India, Middle East, South East Asia, and Europe in a personal and professional capacity. He is X-IBMer and has worked on IBM-ISS (Internet Security System) product as Senior System Engineer. He started his career as a security product developer and developed a UTM (Unified Threat Management) product with features such as Firewall, IPS, VPN, and Application Proxies.",
      "id": 40235,
      "title": "",
      "name": "Murtuja Bharmal",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "East is a professional megalomaniac and dedicated troll. He lives in an underground bunker on an island in the south Pacific, where he spends his days eating Doritos, playing Counter Strike, and plotting world domination. When he is not busy destabilizing foreign governments, his hobbies include trolling phone scammers, hang gliding, and golf.",
      "id": 40236,
      "title": "",
      "name": "East",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Joakim Kennedy is the Threat Intel Manager for Anomali Research. His job involves playing with malware, tracking threat actors and everything else around threat intelligence.",
      "id": 40237,
      "title": "",
      "name": "Joakim Kennedy",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Parmanand Mishra is a security enthusiast who is currently working as Senior Malware Researcher at Qualys Inc. He works on malware analysis and adversary simulation based on ATT&CK and loves creating tools on the same. He has spoken at security conferences like c0c0n and goes by Kart1keya on GitHub.",
      "id": 40238,
      "title": "",
      "name": "Parmanand Mishra",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Rewanth Cool is a security consultant at Payatu Software Labs, India. Speaker at HITB (twice), Positive Hack Days(PHDays), CRESTCon, Bsides, Null Pune and trainer at MIT Pune. He is a programmer and open source contributor. Currently, he is focused on vulnerability research, web application security and contribution to security tools apart from his ongoing research on Machine Learning. One of his finest works include his collaboration with Nmap maintainer, Daniel Miller a.k.a bonsaviking and added 17,000 lines of code to Nmap.",
      "id": 40239,
      "title": "",
      "name": "Rewanth Cool",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Vadim is a senior product manager at Infoblox where he manages Security Ecosystem integrations, Security API, BloxOne Threat Defense. He has more than 15 years of experience in the network and security industry in various roles. He is an author of open source tools such as ioc2rpz (DNS RPZ feeds distribution server) and others. Vadim earned a Master of Science degree in Computer Science (Software Engineering) from a state university in Russia.",
      "id": 40240,
      "title": "",
      "name": "Vadim Pavlov",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Pramod Rana works as a Senior Security Engineer with Coupa Software (The All-In-One Business Spend Management Platform). Pramod is responsible for implementing DevSecOps functions in Coupa like penetration testing, threat modelling, secure source code review. He has presented at Black Hat Europe 2018 before. He loves to do offensive security research, coding and running in his personal time.",
      "id": 40241,
      "title": "",
      "name": "Pramod Rana",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Konark works as a Tech lead with Cliqz GmbH developing privacy-focused search engine and browser. He works on projects ranging across Privacy by design, Anonymous Data collection like Human Web, Anti-Tracking etc.  Prior to Cliqz, Konark was working with one of the largest e-commerce website in India(Makemytrip.com) in data platform and security team, solving interesting challenges related to DWH, BI and data security.  His recent personal projects, in an endeavor to help organizations fix vulnerabilities have spanned across browsers, health trackers, Government services, travel mobile apps etc.",
      "id": 40242,
      "title": "",
      "name": "Konark Modi",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Marcos Oviedo is an experienced, self-motivated, and results-driven software architect who loves to develop software not only to create code but to create value. He has had extensive experience with heterogeneous technologies and computer architectures. Over his years of professional work experience, computer security has long been his passion - whether it has been around designing exploit prevention capabilities of an endpoint security solution, or doing vulnerability research on carrier-grade telco charging software, or just participating on CTFs for fun. Marcos is currently working as an Endpoint Software Architect at McAfee. Marcos also organized the first-ever BSides conference in Cordoba, Argentina.",
      "id": 40243,
      "title": "",
      "name": "Marcos Oviedo",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Jaime Sánchez (aka @segofensiva) has worked for over 20 years as a specialist advisor for large national and international companies, focusing on different aspects of security such as consulting, auditing, training, and ethical hacking techniques. He holds a Computer Engineering degree and an Executive MBA. In addition, he holds several certifications, like CISA , CISM , CISSP , just to name a few, and a NATO SECRET security clearance, as a result of his role as advisory of many law enforcement organizations, banks and large companies in Europe and Spain.  He has spoken in renowned security conferences nationally and internationally, as in RootedCON , Nuit du Hack , Black Hat , Defcon , DerbyCON , NocOnName , Deepsec , Shmoocon or Cyber Defence Symposium , among others. As a result of his researches, he has notified security findings and vulnerabilities to top companies and vendors, like Banco Popular, WhatsApp, Snapchat, Microsoft, Apple etc.  He is a frequent contributor on TV (TVE, Cuatro, LaSexta, Telecinco), press (El Pais, El Mundo, LA Times, NBC News) and radio programs, and writes a blog called 'SeguridadOfensiva'",
      "id": 40244,
      "title": "",
      "name": "Jaime Sanchez",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Jeff Foley is the Founder and Project Leader of OWASP Amass. Jeff has spent nearly twenty years as an innovative technologist taking on challenges in the area of cyber warfare. He started the Amass project after noticing the need for practical OSINT tools that aid information security professionals in mapping complex networks.",
      "id": 40245,
      "title": "",
      "name": "Jeff Foley",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Anthony Rhodes has over five years of industry experience as a penetration tester, red teamer, and software engineer. He has been following the OWASP Amass Project since its inception and has recently joined as a contributor to help enrich its functionality beyond DNS enumeration and network mapping.",
      "id": 40246,
      "title": "",
      "name": "Anthony Rhodes",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Sri is a Security Software Engineer at Oblong Industries spending time on collaborative-conferencing platform security. During other times, he has fun with security, capturing flags & building tools at https://srinivas11789.github.io and github.com/srinivas11789.",
      "id": 40247,
      "title": "",
      "name": "Srinivas Piskala Ganesh Babu",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Ulf is a pentester by day, and a Security Researcher by night. Ulf is the author of the PCILeech direct memory access attack toolkit and the Memory Process File System. Ulf has previously presented his work at DEF CON, the Chaos Communication Congress and BlueHatIL. Ulf is interested in things low-level and primarily focuses on Memory Analysis and Direct Memory Access.",
      "id": 40248,
      "title": "",
      "name": "Ulf Frisk",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Ian Vitek has a background as a pentester but now works with information security in the Swedish financial sector. Ian has held several presentations at DEF CON, BSidesLV and other IT security conferences. The last years also performed as a DJ (VJ Q.Alba) at DEF CON and related private parties. Interested in web, layer 2, DMA and local pin bypass attacks.",
      "id": 40249,
      "title": "",
      "name": "Ian Vitek",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Diana Dragusin is currently a Senior Security Consultant at NCC Group, where she performs a variety of types of penetration tests, with a focus on networks, hardware, and embedded systems. Diana previously worked as a Network Security Architect, with the goal of building more secure internal and external infrastructures. In addition to hardware  hacking, Diana also enjoys applying her creativity and curiosity to world travel and the  culinary arts.",
      "id": 40250,
      "title": "",
      "name": "Diana Dragusin",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Etienne Champetier is an Operations Engineer at Anevia (a video software company). Day to day he troubleshoots complex ecosystems with lots of vendors and moving parts (i.e. uses tcpdump and strace), automates everything he can with Ansible, helps migrate Anevia softwares to Kubernetes, and does all kinds of small developments. He loves to understand how everything works and he contributes to open source software, like OpenWrt, when he can (@champtar on Github).",
      "id": 40251,
      "title": "",
      "name": "Etienne Champetier",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Jyoti Raval works as a Senior Web Application Security Analyst with Qualys. Jyoti is responsible for researching on improving Dynamic Application Security Testing(DAST)Tool, perform web application pen-testing; and understanding new security trends. She is also OWASP Pune chapter leader. She loves to assess things and hence presenting an assessment tool ;)",
      "id": 40252,
      "title": "",
      "name": "Jyoti Raval",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Manish Gupta is a Cyber Security Analyst at Societe Generale in India. Where he specializes in Offensive Security and Red Teaming Activities on Banking Environment. A part-time Bug Bounty Hunter and CTF Player. His Research interest includes Real World Cyber Attack Simulation and Advanced persistent Threat (APT). He currently working on developing Open-Source Offensive Security Toolkit which helps Red Teamers / Penetration Testers.",
      "id": 40253,
      "title": "",
      "name": "Manish Gupta",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "KaiJern (xwings), is Lab Director of The ShepherdLab, of JD Security by JD.COM. He presented his findings in different international security conferences like HITB, Codegate, QCon, KCon, Brucon, H2HC few different Defcon group and etc. He also conducted hardware Hacking course in various places around the globe.",
      "id": 40254,
      "title": "",
      "name": "KaiJern, Lau",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Dr.Nguyen Anh Quynh is a regular speaker at various industrial cybersecurity conferences such as Blackhat USA/Europe/Asia, Defcon,, Deepsec, XCon, Hitcon, Brucon, Zeronights, Tensec, H2HC, etc. He also presented his researches in academic venues such as Usenix, IEEE, ACM, LNCS. Dr. Nguyen is also the founder and maintainer: Capstone (http://capstone-engine.org), Unicorn (http://unicorn-engine.org) & Keystone (http://keystone-engine.org).",
      "id": 40255,
      "title": "",
      "name": "Dr. Nguyen Anh Quynh",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Max Compston is the Principal Software Engineer with Embedded Software Solutions. He has 30+ years of embedded software development experience. He has worked for 20+ years as a government defense contractor developing embedded systems. He has worked 10+ years in the commercial sector on mobile devices, network devices, network access points and IPTV set-tops. Max has a love of the outdoors. He plays tennis, hikes, bikes and is always training for his next triathlon. He has an undergraduate education in Computer Science with graduate work in Computer Security and Info Assurance.",
      "id": 40256,
      "title": "",
      "name": "Max Compston",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Utku Sen is a security researcher who is mostly focused on application security, network security and tool development. He presented his different tools and researches in Black Hat USA Arsenal, DEF CON Demo Labs and Packet Hacking Village in recent years. He's also nominated for Pwnie Awards on \"Best Backdoor\" category in 2016. He is currently working for Tear Security.",
      "id": 40257,
      "title": "",
      "name": "Utku Sen",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Emmanuel Law (@libnex) is currently a security engineer in the Bay Area. He spends his free time researching news ways to break stuff and has presented at various international conferences such as Black Hat Arsenal, Ruxcon, Kiwicon, Troopers etc.",
      "id": 40258,
      "title": "",
      "name": "Emmanuel Law",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Claudio Contin (@claudiocontin) is a security consultant with ZX Security in Wellington, New Zealand. Before working in security, he spent several years developing web applications. He has presented at Bsides SF, Kiwicon and OWASP conferences. During his free time, he contributed to various open-source projects such as BEeF framework and Gophish.",
      "id": 40259,
      "title": "",
      "name": "Claudio Contin",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Ionut Popescu works as a Product Security Engineer for UiPath. His focus lies on web application penetration testing, source code review, security architecture review and providing security trainings. In his free time, he also likes to do research focusing on Windows internals, ASM and exploit development. Ionut is a regular speaker at different conferences, e.g. Defcon, Defcamp or OWASP.",
      "id": 40260,
      "title": "",
      "name": "Ionut Popescu",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Marcello Salvati (@byt3bl33d3r) is a Security Analyst at BlackHills Information Security by day and by night a tool developer who discovered a novel technique to turn tea, sushi, alcohol and dank memes into somewhat functioning code. His passions include anything Active Directory related, trolling people on GitHub and developing open-source tools for the security community at large which he’s been doing for the past several years, some of his projects include SilentTrinity, CrackMapExec, DeathStar, RedBaron and many more.",
      "id": 40261,
      "title": "",
      "name": "Marcello Salvati",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Hyunjun Park is a senior engineer of Samsung SDS in South Korea and a graduate student of SANE Lab at Korea University (Supervisor: Seungjoo Gabriel Kim). His daily job is pentesting a broad range of Samsung products including smartphone, smart TV, wearable devices, etc. He also serves as the main staff of Kimchicon Security Conference in South Korea.",
      "id": 40262,
      "title": "",
      "name": "Hyunjun Park",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Soyeon Kim is a security researcher of Samsung SDS in South Korea. She is mainly doing a security assessment of Samsung IoT products. She is interested in analyzing Android apps and IOS apps using Frida.",
      "id": 40263,
      "title": "",
      "name": "Soyeon Kim",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Mike Kiser is insecure. He has been this way since birth, despite holding a panoply of security roles over the past 20 years—that might imply otherwise. In spite of this, he has designed, directed, and advised on large-scale security deployments for a global clientele. He is currently in a long-term relationship with fine haberdashery, is a chronic chronoptimist (look it up), and delights in needlessly convoluted verbiage. He is obsessed with identity’s role in security and is the co-host of a podcast illuminating all things identity. He warmly embraces the notion that security is more of a state of mind than a destination.",
      "id": 40264,
      "title": "",
      "name": "Mike Kiser",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Sanket Karpe is a security researcher with over decade of experience on reverse engineering malware and incident response. He is currently working as a Manager, Malware Research at Qualys Inc where his primary responsibilities include malware analysis, creating new malware detection techniques and tools development. He is the author for ANWI - All New Wireless IDS and likes to work on various IOT projects in his free time.",
      "id": 40265,
      "title": "",
      "name": "Sanket Karpe",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Benoit is an Application Security Engineer at Shopify having a strong interest in web application security and vulnerability research. Sometimes an active CTF player, he has taken part in multiple competitions with the team DCIETS/NorthernCoalition.",
      "id": 40266,
      "title": "",
      "name": "Benoit Côté-Jodoin",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Haowen Bai, a senior security research engineer at QiAnXin Threat Intelligence Center (@RedDrip7), has over 12 years’ work experience in network security with discovery of zero-day vulnerabilities in targeted attacks. Currently he is researching on innovative approaches to discover vulnerabilities and exploits on Windows platform, as well as to utilize big data analysis system to catch perilous threats in the wild.",
      "id": 40267,
      "title": "",
      "name": "Haowen Bai",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Yavuz Atlas is a cyber security researcher. He has academic and professional experience in areas like cyber security, software development, data science and information visualization. He works as a Tech Lead for Biznet. His current work focuses on pentesting and secure code reviews. Yavuz is also developer of Vulmon project.",
      "id": 40268,
      "title": "",
      "name": "Yavuz Atlas",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Fatih Ozel specializes in web application assessments, penetration testing, and software development. He is a former software developer and an open source enthusiast. He holds a Computer engineering degree from Suleyman Demirel University. Fatih is currently working as a Penetration tester for Biznet Bilisim.",
      "id": 40269,
      "title": "",
      "name": "Fatih Ozel",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "d4rkm4tter is a mad scientist hacker who likes to meddle with hardware and software. He is particularly obsessed with wireless. He has a degree in computer science from Southern Utah University which he has put to use building and breaking a wide array of systems. These include web application pentesting, wireless monitoring and tracking as well as good old fashioned reverse engineering. He is the creator of the #WiFiCactus and has been seen presenting Demolabs at DEF CON and DEF CON China Beta. He is a Kismet cultist and active in the wireless and wardriving communities.",
      "id": 40270,
      "title": "",
      "name": "Mike Spicer",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Francis Brown is the Chief Technology Officer (CTO) at Bishop Fox, a consulting firm providing cyber security services to the Fortune 1000, global financial institutions, and high-tech startups.  Before founding Bishop Fox, Francis worked for Honeywell International where he performed network and application penetration testing, product security evaluations, incident response, and risk assessments of critical infrastructure.  Prior to that, Francis was a consultant with the Ernst & Young.  Francis holds a Bachelor of Science and Engineering from the University of Pennsylvania with a major in Computer Science and Engineering and a minor in Psychology.",
      "id": 40271,
      "title": "",
      "name": "Francis Brown",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "Matthew Gleason is a Senior Security Associate at Bishop Fox, where he focuses on application security penetration testing, source code review, and network penetration testing.  Prior to joining Bishop Fox, Matthew worked as a software engineer for Boeing, where his work involved validation testing for the AH-64E attack helicopter.   Matthew holds a Master of Science from Arizona State University in Computer Science. He also has earned a Bachelor of Science in Economics and a Bachelor of Science in Mathematics from Arizona State University.",
      "id": 40272,
      "title": "",
      "name": "Matt Gleason",
      "updated_at": "2019-07-27T17:33+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40273,
      "title": "",
      "name": "sund0wn",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40274,
      "title": "",
      "name": "Milind Bhargava",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40275,
      "title": "",
      "name": "Adam Podgorski",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40276,
      "title": "",
      "name": "Brendan O'Connor",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40277,
      "title": "",
      "name": "Wendy Knox Everette",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40278,
      "title": "",
      "name": "Jennifer Chermoshnyuk",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40279,
      "title": "",
      "name": "Joe Slowik",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40280,
      "title": "",
      "name": "Mike Raggo",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40281,
      "title": "",
      "name": "Chet Hosmer ",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40282,
      "title": "",
      "name": "Lee Brotherston",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40283,
      "title": "",
      "name": "Anna Weisfeiler",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40284,
      "title": "",
      "name": "ihadamonkey",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40285,
      "title": "",
      "name": "algorythm",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40286,
      "title": "",
      "name": "Ethan Gregory Dodge",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40287,
      "title": "",
      "name": "Redacted at speaker's request",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40288,
      "title": "",
      "name": "Richard Thieme aka Neuralcowboy",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40289,
      "title": "",
      "name": "f(x)",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40290,
      "title": "",
      "name": "Zhanna Malekos Smith",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40291,
      "title": "",
      "name": "Vic Harkness",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40292,
      "title": "",
      "name": "Steve Pordon",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40293,
      "title": "",
      "name": "Soldier of FORTRAN",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40294,
      "title": "",
      "name": "Bigendian Smalls",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40295,
      "title": "",
      "name": "noodle",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40296,
      "title": "",
      "name": "Oryx",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40297,
      "title": "",
      "name": "3ncr1pt3d",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40298,
      "title": "",
      "name": "Audie",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40299,
      "title": "",
      "name": "tyercel",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40300,
      "title": "",
      "name": "Security Panda",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40301,
      "title": "",
      "name": "Maggie Mayhem",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40302,
      "title": "",
      "name": "Dr. Russ Handorf",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40303,
      "title": "",
      "name": "Kurt Opsahl",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40304,
      "title": "",
      "name": "karver",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40305,
      "title": "",
      "name": "Pyr0",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "",
      "id": 40306,
      "title": "",
      "name": "Liz Borden",
      "updated_at": "2019-07-30T05:24+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@investigatorchi is a security researcher, speaker, and Senior Information Security Analyst at University at Buffalo with over 20 years of highly technical experience. In her current role, Cathy is a data forensics and incident response (DFIR) specialist, performing incident management, intrusion detection, investigative services, and personnel case resolution in a dynamic academic environment. She additionally builds security awareness amongst faculty and staff via a comprehensive department-wide program which educates and informs users about how to prevent and detect social engineering threats, and how to compute and digitally communicate safely. Cathy has presented at numerous prestigious information security conferences including DEF CON and Hacker Halted. In her (minimal) spare time, she enjoys visiting her adopted two-toed sloth Flash at the Buffalo zoo, researching death and the dead, and learning more about hacking things to make the world a more secure place.",
      "id": 40307,
      "title": "",
      "name": "investigatorchi",
      "updated_at": "2019-07-31T02:08+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@fryx0r is a Security Engineer on Google's detection and response team. He works out of the Sydney office, having previously worked for the Department of Defence, FireEye and Commonwealth Bank. He enjoys writing Golang and making memes, and in his spare time travels around the world running Magic the Gathering tournaments.",
      "id": 40308,
      "title": "",
      "name": "fryx0r",
      "updated_at": "2019-07-31T02:08+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@JSteeleIR is a Security Engineer with 6+ years of experience in Detection, Response, Forensics, Reverse Engineering, and Automation. Some of that's been at Google. Some has been in the cloud. Some of it was good. When not sparring in the cyberspaces, he can be found camping, collecting odd input devices (possibly using those to reimplement the less PAGER in Golang) or attempting (and failing) to sleep on a normal schedule.",
      "id": 40309,
      "title": "",
      "name": "JSteeleIR",
      "updated_at": "2019-07-31T02:09+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@sopooped leveraged her development background, Christine builds tools to automate security for cloud environments as a Security & Tools Engineer. She's relatively new to the industry, so she provides a fresh pair of eyes. And with her colossal appetite to learn and execute, she's rapidly conquering the world!",
      "id": 40310,
      "title": "",
      "name": "sopooped",
      "updated_at": "2019-07-31T02:09+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@ch33r10 works for a Financial Services Fortune 500 Company. She is a graduate of the SANS 2017 Women’s Academy, has an MBA in IT Management, and currently holds the CFR, GSEC, GCIH, GCFE, GMON, GDAT, and GPEN certifications.  She is a member of the Financial Services Information Sharing and Analysis Center (FS-ISAC), Yara Exchange, and FuzzySnugglyDuck.  @ch33r10 serves as an Advisor for a Cybersecurity Apprenticeship Program in Chicago and she is on the Advisory Board of SANS EMEA CyberThreat 2019 with the National Cyber Security Centre in London and SANS Purple Team Summit.",
      "id": 40311,
      "title": "",
      "name": "ch33r10",
      "updated_at": "2019-07-31T02:10+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@gkapoglis an Incident Responder at Verizon Media where I have the chance to work on complex problems at scale! I am originally from Greece and have been living in the US for the past 4 years. Got my Master’s in Cybersecurity from Stevens Institute of Technology in Hoboken NJ and hold GCIH and GNFA from GIAC.",
      "id": 40312,
      "title": "",
      "name": "gkapoglis",
      "updated_at": "2019-07-31T02:10+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@uncl3dumby is enamored with defense and protective thinking. My career has focused on security operations, but I love understanding the way systems operate. I'm passionate about investigating root cause of incidents, or how things came to be the way they are. Security is a full-stack, cross discipline field and I love learning about and digging into it all!",
      "id": 40313,
      "title": "",
      "name": "uncl3dumby",
      "updated_at": "2019-07-31T02:10+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@marcosd4h is an experienced, self-motivated, and results-driven software architect who loves to program not only to create code but to create value. He has had extensive experience with heterogeneous technologies and computer architectures. Over his years of professional work experience, computer security has long been his passion - whether it has been around designing exploit prevention capabilities of an endpoint security solution, or doing vulnerability research on carrier-grade telco charging software, or analyzing an exploit/malware to create a detection signature, or just participating on CTFs for fun. Marcos is currently working at McAfee as a Software Architect, leading the development of the exploit-prevention technology components which are part of the company's next-generation flagship product called Endpoint Security (ENS). This product is currently deployed over millions of endpoints worldwide. Marcos also led the organization of the first-ever BSides conference in Cordoba, Argentina.",
      "id": 40314,
      "title": "",
      "name": "marcosd4h",
      "updated_at": "2019-07-31T02:11+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@chgaray is an experienced infosec analyst who drives strategic initiatives and provides thought leadership and insights regarding the ever-changing global threat landscape at Claro America Movil offices in South America. He organized the 1hackparaloschicos local security conferences in the past, and now he is working on the organization of the first-ever BSides conference in Cordoba, Argentina.\r\n\r\n",
      "id": 40315,
      "title": "",
      "name": "chgaray",
      "updated_at": "2019-07-31T02:11+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@markaorlando started his security career in 2001 as a Security Analyst, and since then has been both fighting for blue team resources and trying to automate them out of a job. He has built, assessed, and managed security teams at the Pentagon, the White House, the Department of Energy, global Managed Security Service Providers, and numerous financial sector and Fortune 500 clients. Short on patience and attention, Mark is constantly working on new projects to improve defensive security through automation and other short cut-y things so defenders can be more agile and creative. While Director of Operations at Foreground Security, he designed and launched a Managed Detection and Response (MDR) service offering and helped to invent an automated cyber threat hunting technology, both of which were later acquired. He enjoys teaching and learning from others but spends far more time doing the latter.\r\n\r\n",
      "id": 40316,
      "title": "",
      "name": "markaorlando",
      "updated_at": "2019-07-31T02:11+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@v4tl4 currently works as a security engineer. He has spent the last three years developing signatures for detecting threats on the network. Prior to that he was a SOC analyst.\r\n\r\n",
      "id": 40317,
      "title": "",
      "name": "v4tl4",
      "updated_at": "2019-07-31T02:11+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@jamesdickenson has worked as a security engineer for five years focusing on detection engineering, threat intel and network security monitoring.\r\n\r\n",
      "id": 40318,
      "title": "",
      "name": "jamesdickenson",
      "updated_at": "2019-07-31T02:11+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@connormorley is a Threat Hunter at Countercept, a 24/7 manager Threat hunting service by MWR Infosecurity. A keen investigator of malicious TTP’s, he enjoys experimenting and dissecting malicious tools to determine functionality and developing detection methodology. As a threat hunter as well as holding OSCP accreditation he is experienced with traditional and “in the wild” malicious actors behaviour.\r\n\r\n",
      "id": 40319,
      "title": "",
      "name": "connormorley",
      "updated_at": "2019-07-31T02:12+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@laciefan is a Threat Hunter at Countercept, a 24/7 managed Threat hunting service by MWR Infosecurity. Previously an Incident Response investigator, she carries a deep interest in forensics investigations and attack detection. Having knowledge in both offensive and defensive security, she currently holds both CPIA and OSCP accreditation.\r\n\r\n",
      "id": 40320,
      "title": "",
      "name": "laciefan",
      "updated_at": "2019-07-31T02:12+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@9ian1i is a security researcher, core member of 0keeTeam, Information Security Department of Qihoo 360 Technology Company. He specializes in the construction of Blue Team and security architecture, especially the auto-detection of security vulnerabilities.\r\n\r\n",
      "id": 40321,
      "title": "",
      "name": "9ian1i",
      "updated_at": "2019-07-31T02:12+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@Lak5hmi5udheer is a Security Researcher at Adobe. She holds a Master of Science in Information Security and has been in the security industry for about four years now. At Adobe, she works on reviewing architectures and providing security guidelines to various product teams. Prior to Adobe, she was at a startup doing all things Application Security and has experience with security consulting at Bishop Fox. She has also spoken about her open source projects at security conferences like RSA 2018, Appsec USA & AppSec Cali.\r\n\r\n",
      "id": 40322,
      "title": "",
      "name": "Lak5hmi5udheer",
      "updated_at": "2019-07-31T02:13+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@dhivus is a Security Researcher at Adobe. She received her master’s degree in Information Security and Information Technology from Carnegie Mellon University in 2017. At Adobe, she provides proactive security guidance to key product teams, develops security automation tools and enjoys reviewing security of new technologies. She loves talking about her open source projects at conferences, most recent being Girls Who Code, DefendCon and CISO summit.\r\n\r\n",
      "id": 40323,
      "title": "",
      "name": "dhivus",
      "updated_at": "2019-07-31T02:13+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@yugoslavskiy is leading Threat Detection team at Tieto Security Operations Center (SOC) in Czech Republic, Ostrava. Before that, he was responsible for processes and systems architecture development of Informzaschita SOC in Moscow, Russia. Daniil spent more than six years in Practical Computer Security and Network Monitoring domains. He holds OSCP, CCNP Security, GCFA and GNFA certifications. He had talks at Code Europe, CONFidence, Amsterdam FIRST Technical Colloquium, x33fcon, EU MITRE ATT&CK community workshops, presenting Intelligence-Driven Defence approach implementation and MITRE ATT&CK operationalization. Daniil is also member of GIAC Advisory Board, Krakow 2600 Meetings coordinator and creator of Atomic Threat Coverage project.\r\n\r\n",
      "id": 40324,
      "title": "",
      "name": "yugoslavskiy",
      "updated_at": "2019-07-31T02:13+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@Understudy77 is an obsessive clicker of links, Shawn is a current Paranoid and Head of Security Operations at Verizon Media with a past history of Incident Response, threat hunting, and malware analysis.\r\n\r\n",
      "id": 40325,
      "title": "",
      "name": "Understudy77",
      "updated_at": "2019-07-31T02:14+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@CyberPraesidium brings over 12 years of diverse experience in cyber security, IT, and law. He leads Polito's commercial services including vulnerability assessments, penetration testing, incident response, forensics, and threat hunting. Prior to joining Polito, Ben worked on APT hunt teams at federal and commercial clients. He holds CISSP, GCFA, GWAPT, and Splunk Power User certifications.\r\n\r\n",
      "id": 40326,
      "title": "",
      "name": "CyberPraesidium",
      "updated_at": "2019-07-31T03:11+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@politoinc has over 10 years of federal and commercial expertise in the field of Endpoint and Mobile based Intrusion Detection and Protection, Network Security, e-Discovery, Mobile Application Security, and Penetration Testing. Jeffrey holds a Masters of Science in Digital Forensics from George Mason Univ. along with a Bachelors in Business IT from St Johns Univ. Jeffrey also has earned certifications such as GIAC Certified Forensic Analyst, Encase Examiner and Encase E-Discovery, Xways, and Cellebrite Certifications.\r\n\r\n",
      "id": 40327,
      "title": "",
      "name": "politoinc",
      "updated_at": "2019-07-31T03:11+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@olafhartong is a person of many interests with a passion for defensive security and data. He has over 12 years experience in security, he specializes in building and operationalizing SOC teams through the use of SIEM systems or log management systems such as Splunk. He is an expert Threat Hunter and works in close collaboration with the Red Team to facilitate Purple teaming workshops for his clients. He is the author of several security focused tools and blogs. Before joining Deloitte, Olaf worked as a Security Officer for a large managed hosting provider serving Governmental and Commercial service clients. Olaf has spoken at MITRE ATT&CKcon, ISF Live, Splunk Live, BlackHat EU Arsenal.\r\n\r\n",
      "id": 40328,
      "title": "",
      "name": "olafhartong",
      "updated_at": "2019-07-31T03:11+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@thezachw has been involved with osquery since the earliest design documents in 2015. He has brought his extensive experience to the delivery of core features such as AWS logging and syslog consumption in osquery, as well as the development Kolide Fleet, the most popular open-source osquery Fleet manager. These days he can be found cheerfully helping out users in the osquery community, or developing features for Fleet. As the founder of Dactiv LLC, he consults with technical organizations to reap the benefits of Fleet and osquery.\r\n\r\n",
      "id": 40329,
      "title": "",
      "name": "thezachw",
      "updated_at": "2019-07-31T03:11+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@iheartmalware is a Senior Threat Researcher with Agari; has been fighting and trolling BEC scammers for over three years with the help lots of friends. Like, more than 600 of them, and many are feds, too! The industry has started to gain a deep understanding with all of the intricate parts of BEC, such as romance scams, lottery scams, real estate scams, account takeover, wire fraud, W2 fraud, IRS scams, gift card scams, and direct deposit scams, just to name a few. How do you eat an elephant? In this workshop you will learn about the different types of BEC threats as well as identifying areas of engagement with BEC actors to help drive up their costs of operation.\r\n\r\n",
      "id": 40330,
      "title": "",
      "name": "iheartmalware",
      "updated_at": "2019-07-31T03:12+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@malware_traffic based in Texas, specializes in traffic analysis of malware and suspicious network activity. After more than 21 years in the US Air Force, Brad transitioned to cyber security in 2010. He is currently a Threat Intelligence Analyst for Palo Alto Networks Unit 42. Brad is also a volunteer handler for the Internet Storm Center (ISC) and has posted more than 140 diaries at isc.sans.edu. He routinely blogs technical details and analysis of infection traffic at www.malware-traffic-analysis.net, where he's provided over 1,600 malware and pcap samples to a growing community of information security professionals.\r\n\r\n",
      "id": 40331,
      "title": "",
      "name": "malware_traffic",
      "updated_at": "2019-07-31T03:12+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@krypt3ia is a security professional with over 13 years experience specializing in areas such as DFIR Ethical Hacking/Pen Testing, Social Engineering Information, Security Auditing, ISO27001, Threat Intelligence Analysis, Steganography Application and Detection.\r\n\r\n",
      "id": 40332,
      "title": "",
      "name": "krypt3ia",
      "updated_at": "2019-07-31T03:12+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@sirmudbl00d located in Boston, is a cyber security enthusiast with a decade of experience. He is the CEO and founder of Null Hat Security which focuses on incident response, cyber security training, threat hunting, and security operations. He founded Null Hat Security as he believes new methods a required to cultivate defenders in order to combat advanced attacks and defend organizations. O'Shea is also the co-founder of \"Intrusion Diversity System\", a bi-monthly hosted cyber security podcast.\r\n\r\n",
      "id": 40333,
      "title": "",
      "name": "sirmudbl00d",
      "updated_at": "2019-07-31T03:12+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@apiary Sarah Gibson is an application security consultant who focuses on working with developers to understand and fix the security issues within their code. Showing developers how secure code is good code. She has been working in application security testing for the past six years and enjoys poking at the internet.\r\n\r\n",
      "id": 40334,
      "title": "",
      "name": "apiary",
      "updated_at": "2019-07-31T03:12+0000"
    },
    {
      "twitter": "",
      "link": "",
      "conference": "DEFCON27",
      "description": "@crlowell is a member of the security team at a SF based tech company where he performs incident response, detonates malware, and helps protect employee devices.\r\n\r\n",
      "id": 40335,
      "title": "",
      "name": "crlowell",
      "updated_at": "2019-07-31T03:13+0000"
    }
  ],
  "updated_at": "2019-08-01T00:55+0000"
}