{
  "updated_at": "2019-08-02T05:36+0000",
  "speakers": [
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Winnona DeSombre is an Asia Pacific threat intelligence researcher at Recorded Future, focusing on Chinese underground hacking communities and East Asian cyber espionage campaigns. She tracks trends in cybercriminal activity, analyses new malware and tooling, and improves East-Asian sourcing within Recorded Future. In recent years, Winnona spoke at the Forbes 30 under 30 summit, won the Harvard Belfer Center D3P Hackathon by constructing risk rule calculation software to combat social media influence campaigns, and was a semi-finalist in the Atlantic Council’s Cyber 9/12 competition. She was also one of the youngest individuals featured in Threatcare’s “Tribe of Hackers” book, containing career advice from some of the world's best information security professionals.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31601,
      "name": "Winnona DeSombre",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Arnaud Soulli√© is a manager at Wavestone, performing security audits and leading R&D projects. He has a specific interest in Active Directory security as well as ICS, two subjects that tend to collide nowadays. He teaches ICS security and pentests workshops at security conferences (BlackHat Europe 2014, BSides Las Vegas 2015/2016, Brucon 2015/2017, DEFCON 24, DEFCON 26) as well as full trainings (Hack In Paris 2015 and 2018, BlackHat Asia 2019).",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31602,
      "name": "Arnaud Soullie",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Alon Weinberg is a security researcher at Deep Instinct. Before Alon joined Deep Instinct two years ago, he served in the IDF for 4.5 years in an elite cyber unit as a security researcher. \nAs part of his role in Deep Instinct, Alon is in charge of finding new ways to enhance protection and defense mechanisms. Alon leverages his cyber-offense experience and OS internals knowledge to conduct malware analysis and RE, explore attack surfaces in Windows and macOS, and research existing or new attack vectors and evasion techniques. \nAlon is addicted to cross-fit and enjoys riding his motorcycle during his free time.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31603,
      "name": "Alon Weinberg",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Lavi leads a group of security researchers called Group Charlie which is focused on security research of emerging technologies. Lavi and his group are doing vulnerability research; writing about information security for security magazines and blogs in Israel and internationally; and coding prototypes and proof of concepts. Lavi holds a master’s in computer science and cryptography and a CISSP which is always nice to have. Prior to his work at CyberArk, he served in the Israeli Air Force for 11 years as a pilot and as an intelligence officer.  ",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31604,
      "name": "Lavi Lazarovitz",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Andy Grant is a Technical Vice President for NCC Group. While at NCC Group, Andy has worked on a wide-variety of security assessment and advisory projects. He has performed numerous application assessments on mobile (Android, iOS, WP7), desktop (OS X/macOS, Windows, Linux), and web platforms. He has also performed many internal and external network penetration tests and widget/third-party platform reviews. Andy has worked with small tech start-ups, small and large software development groups, and large financial institutions. Andy has a BS in Computer Science and Advanced Computer Security Certificate from Stanford University.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31605,
      "name": "Andy Grant",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Sarah is a security professional and has worked in tech for about a decade now, but she had a not-so standard start into the IT industry, and eventually found her way into security. In this talk, Sarah shares how - as a contrary teenager - she definitely didn't do what everyone will tell you to do career-wise but still managed to build a successful security career, and how we need to embrace individuals with non-linear careers to address the skills shortage in cyber.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31606,
      "name": "Sarah Young",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31607,
      "name": "India McKinney",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Mathieu Saulnier is a “Security Enthusiast” ©@h3xstream. He has held numerous positions as a consultant within several of Quebec’s largest institutions. For the last 6 years he has been focused on putting in place a few SOC and has specialized in detection (Blue Team), content creation and mentorship. He currently holds the title of « Senior Security Architect » and acts as “Adversary Detection Team Lead” and “Threat Hunting Team Lead” for Bell Canada, one of Canada’s largest carrier. In the last decade, he has taken two separate sabbaticals to travel Africa and Asia.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31608,
      "name": "Mathieu Saulnier",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Former supervisory agent with the FBI, PhD in Cognitive Psychology, deep expertise in infosec, and a faculty position at UCF's IST group. there, Matt is a member of LabX (Laboratory for Autonomy-Brain Exchange), and works with UCF's own infosec groups to build large-scale experiments into what makes individuals susceptible to cyberattack.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31609,
      "name": "Matt Canham",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Maxwell Aliapoulios is a PhD student at NYU Tandon. Max's published work includes tracking ransomware, IPTV pirarcy, and supply chains in underground cybercriminal marketplaces. He continues to apply academic research principles to understand cybercrime activity, including natural language processing, stylometry, and machine learning. Max also works as a Research Developer at Flashpoint.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31610,
      "name": "Maxwell Aliapoulios",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "r. Ben D. Sawyer is an applied neuroscientist and human factors engineer known for using brainwaves, eye movements, and mathematical theory to build better human-machine teams. His models and algorithms power trustworthy machines that work with their human partners. His design recommendations are leveraged by Fortune 500 companies. His work has been covered by Forbes, Reuters, Fast Company, and The BBC. With the US Air Force, he studied the mathematical underpinnings of attention in cyberdefense. At MIT his work focused upon designing superior connections between humans and machines. At UCF, where he is Faculty in Industrial Engineering and Director of LabX, he works to optimize, or disrupt, these connections.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31611,
      "name": "Ben D Sawyer",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Greg Caswell is an engineer at heart who enjoys helping make software systems slightly less terrible. For the past five years he has been building and managing an application security team at Indeed, responsible for teaching security concepts to developers, assessing the security of 1000’s of applications, triaging bug bounty submissions, and automating as much as they can in the process. He holds degrees in electrical and computer engineering. Outside of security, he enjoys bee-keeping, aquaponics, and cooking.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31612,
      "name": "Gregory Caswell",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "My interest in security began in 1987, fueled by the need to protect my lame video games from pirates. Ever since, I've been interested in the security of systems, and information in general, as it pertains to people using systems. To that end, I've hacked unlikely things like tent-pole film sets, nuclear energy facilities, banks, and hospitals.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31613,
      "name": "Paul Dant",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Chris Roberts Roberts has led or been involved in information security assessments and engagements for the better part of 20\nyears, and has a wealth of experience with regulations such as GLBA, HIPAA, HITECH, FISMA, and NERC/FERC.\nHe has also worked with government, state and federal authorities on standards such as CMS, ISO, and NIST. And worst case, to jog the memory, Chris was the researcher who gained global attention in 2015 for \ndemonstrating the linkage between various aviation systems, both on the ground and while in the air that\nallowed the exploitation of attacks against flight control system.  Most importantly, Chris has shared several commentaries on career development and job search in our community. He will share his thoughts on what participants need to take full advantage of while at BSidesLV for their career development.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31614,
      "name": "Chris Roberts",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Nick Landers is the Technical Lead at Silent Break Security. His work involves security consulting, red team operations, malware development, and offensive research. He has authored and presented the \"Dark Side Ops\" course series for over 3 years at BlackHat and other conferences. Internally, he develops tooling, evasions, and strategies for offensive operations.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31615,
      "name": "Nick Landers",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31616,
      "name": "Falcon Darkstar",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Robert Paul is the Director of Research & Development for NuID, an authentication and cyber security company. At NuID, Robert studies the identity landscape from a security perspective and looks to uncover real-world threats in authentication and other identity technologies. Robert is a seasoned white hat hacker and red-teamer, with experience on the security teams at Microsoft, Ericsson, and McAfee. Before NuID, he most recently held a position at Microsoft working on the cryptographic libraries for Azure. Robert is CISSP and OSCP certified.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31617,
      "name": "Robert Paul",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Andrea Matwyshyn is a professor in the law school and engineering\nschool at Penn State, the Associate Dean of Innovation at Penn State\nLaw (University Park), and the founding director of the Penn State\nPILOT Lab (Policy Innovation Lab of Tomorrow), an interdisciplinary\ntechnology policy lab. n 2014, she served as the Senior Policy\nAdvisor/ Academic in Residence at the U.S. Federal Trade Commission. ",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31618,
      "name": "Andrea Matwyshyn",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Allan Friedman is Director of Cybersecurity at National Telecommunications and Information Administration in the US Department of Commerce. He coordinates NTIA's multistakeholder processes on cybersecurity, focusing on addressing vulnerabilities in IoT and across the software world. Prior to joining the Federal Government, Friedman spent over 15 years as a noted InfoSec and tech policy scholar at Harvard's Computer Science Department, the Brookings Institution and George Washington University's Engineering School. He is the co-author of the popular text Cybersecurity and Cyberwar: What Everyone Needs to Know, has a degree in computer science from Swarthmore College and a PhD in public policy from Harvard University, and is quite friendly for a failed professor-turned-technocrat.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31619,
      "name": "Allan Friedman",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Cybersecurity student out of Pensacola Fl, who spends his time breaking electronics, fixing them, and breaking them again. I have been experimenting with hardware and software for 13 years, mainly focusing on setting up networking and security for small businesses and amateur radio. Now I spend most of my time trying to finish up my degree program, and educating my friends on security best practices through my blog.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31620,
      "name": "Nick Koch",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "I have 12 years of experience within the Navy, the Intelligence Community, and in the corporate cyber security world with focuses on building and maturing Security Operations / InfoSec teams, SIEM/IDS/IPS engineering, malware analysis, and cyber operations.I'm currently working for my own company that focuses on \"unique\" requests for solutions.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31621,
      "name": "John Grigg",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Mart√≠n Vigo is a red teamer and researcher with a background in product security and software engineering. He previously focused on Mobile security, Identity and Authentication, helping keep \"the cloud\" secure.  Since then, he has shifted to pure offensive security work, putting on the black hat to catch the bad guys. Mart√≠n is also involved in educating developers on security essentials and best practices.\n\nMartin has presented several topics including accounts takeover by voicemail cracking, breaking password managers, exploiting Apple's Facetime to create a spy program and mobile app development best practices. These were given at conferences such as DEF CON, Blackhat EU, Ekoparty, BSides Las Vegas, Kaspersky Security Analyst Summit and Shakacon.\n\nOutside the office, Martin enjoys research, bug bounties, gin tonics and scuba diving.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31622,
      "name": "Martin Vigo",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "He is currently a Cyber Security Consultant, focusing on OS and Services Hardening, Cryptography, AI Security, and Reverse Engineering.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31623,
      "name": "Gerald Doussot",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "David (@Matir) is a Red Team engineer for a major internet company and a security researcher focusing on IoT and embedded devices.  When not working on these things, he likes to build CTFs for BSidesSF and BSidesLV, and occasionally still finds time to play in a CTF.  He also sometimes builds electronic things just for fun.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31624,
      "name": "David Tomaschik",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Justin sits at the intersection of hacker and maker. His passion for knowing how things work as lead him into research of IoT devices, Drones, and RFID. Justin has worked on many Raspberry Pi projects including two Debian based distros; Vap0r, and RedSkyz for which he was the main contributor. He has spoken and taught at a multitude of security conferences and enjoys sharing his knowledge and learning from others around him.  \n\nJustin also has experience in external and internal penetration testing across a wide range of sectors (e.g. government, healthcare, financial, aerospace, automotive). He is the Founder and CEO of Digital Silence.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31625,
      "name": "Justin Whitehead",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Suchi is a data privacy and cybersecurity lawyer (@SuchiPahi). She was supposed to be a doctor, but went rogue and wound up in law school arguing about the CFAA. After 4 years of working on some of the most incredible incidents as a cybersecurity lawyer and of helping companies of all sizes set up privacy and security practices, she decided to leave the law firm life so that she could do more tech law things. She currently lives in DC, where she is Director of Privacy and Business Affairs at Rally Health, Inc.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31626,
      "name": "Suchi Pahi",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "David (they/them) joined Google's Detection & Response team in Kirkland 3 years ago as a Security Engineering Manager. They manage several teams related to detection in Google Cloud, as well as the ATC team that is the subject of this presentation. Prior to Google they led the Microsoft security incident response team in responding to incidents such as Heartbleed and Stuxnet. They are a Quora Top Writer on topics such as security, management, and the tech industry. In their free time, they enjoy playing with their kids, hiking, climbing, camping, sailing, chess, and homebrewing beer.\n\nQuora profile: https://www.quora.com/profile/David-Seidman",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31627,
      "name": "David Seidman",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Steve Luczynski retired from the Air Force in 2017 after a 25-year career flying F-15s & F-22s. He transitioned to cyber policy as the Deputy Director for Cyber Plans & Operations, Office of the Secretary of Defense at the Pentagon. Steve worked closely with National Security Council staff, other government agencies, the Joint Staff, and US Cyber Command on efforts to counter foreign threats and protect U.S. interests. He created and led Department-wide initiatives to ensure compliance with Presidential directives that enabled military cyberspace operations. Steve played a key leadership role in the Department's increased support for US government efforts to address aviation cybersecurity challenges. Steve is currently the Chief Information Security Officer for T-Rex Solutions, LLC where he oversees the protection of corporate and customer data across all lines of business and is responsible for directing information security risk management, compliance, policies, and standards.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31628,
      "name": "Steve Luczynski",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Ian Gray is the Director of Americas Research and Analysis at Flashpoint, where he focuses on Deep & Dark Web intelligence. Ian actively researches cybercriminal usage of new and emerging technologies for malicious purposes in English and Portuguese language communities. Additionally, he has been researching policy gaps that contribute to various forms of fraud, as well as the economic factors contributing to cybercrime. Ian is also an adjunct Professor at Fordham University's Master of Cybersecurity Program.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31629,
      "name": "Ian Gray",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Jeremy Galloway has been active in the security scene since 2002, focusing on the dark corners of the internet, hacktivism, pen-testing, intelligence gathering, privacy technologies, and incident response. When he's not reading old text files or dreaming in 7-bit ASCII, his time is spent cycling, hiking, meditating, making street art, and generally practicing civil disobedience. Although he aims to protect the internet at large, his dream is to become Beyonc√©'s personal cyber-bodyguard. Jeremy is a proud member of both the Electronic Frontier Foundation and The Satanic Temple.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31630,
      "name": "Jeremy Galloway",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Veronica Weiss is currently a security analyst in the financial industry. She is a data science researcher in her personal time, and is very passionate about gradient boosting algorithms and has recently been focusing on cloud security. Veronica is also an undergraduate college student studying Computer Science and Statistics at Skidmore College, and can be found playing Capture the Flag (CTF) competitions with RPISEC.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31631,
      "name": "Veronica Weiss",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Matt Cheung started developing his interest in cryptography during an internship in 2011. He worked on implementation of a secure multi-party protocol by adding elliptic curve support to an existing secure text pattern matching protocol. Implementation weaknesses were not a priority and this concerned Matt. This concern prompted him to learn about cryptographic attacks from Dan Boneh's crypto 1 course offered on Coursera and the Matasano/cryptopals challenges.  From this experience he has given talks and workshops at the Boston Application Security Conference and the DEF CON Crypto and Privacy Village.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31632,
      "name": "Matt Cheung",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "During the workday: Chris Hanlon runs an Information Security Consulting Business where he monitors and protects Endpoints, Routers, Servers, and Cloud Systems.  In addition to protecting infrastructure, Chris also coaches software companies on ways to minimize vulnerabilities in their code, and reduce their vulnerability to social engineering attacks.\n\nDuring his \"free time\", Chris finds/reports security vulnerabilities, hosts hack-a-thons, uses real world exploits to help developers understand security vulnerabilities, lectures at colleges, presents at conferences, organizes security conferences, and volunteers on the presentation review board for for a BSides Conference.\n\nBased on multiple vulnerability submissions, Chris was added to the Google Security Hall Of Fame in 2014.  Chris has also been recognized for security vulnerabilities reported to the University of British Columbia and a Linux Kernel File System Module.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31633,
      "name": "Chris Hanlon",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "@lilyhnewman",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31634,
      "name": "Lily Hay Newman",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Luke is an Offensive Security Certified Professional and a professionally trained digital forensic analyst regularly involved in local and national cybersecurity events, including competing yearly at DEF CON. Luke currently works as a Security Analyst on the Azure team at Microsoft, applying his passion for offensive security to provide expert-level risk analysis. He has previously led penetration tests as a part of 3PAO engagements for clients pursuing FedRAMP accreditation, and he has extensive experience driving vulnerability management in hyperscale cloud environments and scoring risks using CVSS.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31635,
      "name": "Luke Szczutowski",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Toru Shimanaka is a Security Researcher at Fujitsu System Integration Laboratories. Toru has over 20 years of experience developing workstations, routers and network switches as a software engineer. His interests over the past five years are cyber range and cyber deception. Toru has gave presentation in HICSS-52 and BSides Sendai in the past.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31636,
      "name": "TORU SHIMANAKA",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Roger Meyer is a Principal Security Engineer at NCC Group with extensive experience in managing and leading complex engagements.  Roger specializes in web application security, network penetration testing, configuration reviews, and secure software development and architecture design. Roger has conducted over a hundred security audits, penetration tests, source code reviews, and architecture reviews over the last 6 years at NCC Group.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31637,
      "name": "Roger Meyer",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Peter is an accomplished information security and risk management professional that for the past 20+ years has excelled in both the information security domain and the business domain. He has worked as an information security and risk management business leader in a variety of industries among others Maritime, Oil and Gas, Banking, Insurance and Food and Beverage. \n\nPeter is an expert practitioner of the discipline of collaboration across an organization to achieve desired goals. He has defined and executed (IT) information security and risk management strategies in some of the biggest and most complex global organizations and has always done so through the optics of the business strategy and with an inclusive holistic business approach.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31638,
      "name": "Peter Lidell",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "I'm a security analyst at Rally Health on their secops team and I am very focused on teaching others. I've been working in security for 2 years and over the those 2 years I've realized that automation is a must in security ops and I've created a format to teach the rest of my teammates. Keeping them motivated as well as challenged are things I want to talk about",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31639,
      "name": "Joe O'Connell",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "As a senior security engineer, Priyank's primary areas of focus are mobile application penetration testing and secure source code reviews. Over the past 4 years, he has advised Fortune 500 brands and startups and does mobile and IoT related research in his spare time. He also believes it is unwise to place trust in your smartphones.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31640,
      "name": "Priyank Nigam",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Stephanie is the resident Information Security Analyst for a global law firm. She is the creator and editor of StephAndSec.com, a blog focused on technology, inclusion and lifetime learning. She spends her time mentoring high school students, hosting virtual labs via Women In Tech-a-thons, being Chapter Head for WoSEC Houston, and giving back to the community.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31641,
      "name": "Stephanie Ihezukwu",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Lakshmi Sudheer is a Security Researcher at Adobe. She holds a Master of Science in Information Security and has been in the security industry for about four years now. At Adobe, she works on reviewing architectures and providing security guidelines to various product teams. Prior to Adobe, she was at a startup doing all things Application Security and has experience with security consulting at Bishop Fox. She has also spoken about her open source projects at security conferences like RSA 2018, Appsec USA & AppSec Cali.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31642,
      "name": "Lakshmi Sudheer",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Joseph Cox covers the digital underground, hackers, and social media platforms for VICE's Motherboard. His work has triggered multiple government investigations into the sale of AT&T, T-Mobile, and Sprint real-time location data, and his series on Facebook content moderation caused the world's biggest social network to ban white nationalism.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31643,
      "name": "Joseph Cox",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Hyrum Anderson is the Chief Scientist¬†at Endgame, where he leads research on detecting adversaries and their tools using machine learning. ¬†¬†Prior to joining Endgame he conducted information security and situational awareness research as a researcher at FireEye, Mandiant, Sandia National Laboratories and MIT Lincoln Laboratory. ¬†He received his PhD in Electrical Engineering (signal and image processing + machine learning) from the University of Washington and BS/MS degrees from BYU. ¬†Research interests include adversarial machine learning, large-scale malware classification, and early time-series classification.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31644,
      "name": "Hyrum Anderson",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Ezra is an information security practitioner, with a passion for reverse engineering, data analysis, and exploitation. He is the leader of the Tel Aviv DC9723 Defcon group and a co-founder and organizer of BSidesTlv. Currently, he works as a Security Research Manager at a Fortune 500 company.\nEzra has presented at T2 Infosec Conference, BSidesLV, 44CON, Skytalks, BlackHat Arsenal, AppsecIL",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31645,
      "name": "Ezra Caltum",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Michael Wylie, MBA, CISSP is the Director of Cybersecurity Services at Richey May Technology Solutions. In his role, Michael is responsible for delivering information assurance by means of vulnerability assessments, cloud security, penetration tests, risk management, and training. Michael has developed and taught numerous courses for the U.S. Department of Defense, Moorpark College, California State Universities, and clients around the country. Michael holds the following credentials: CISSP, CCNA R&S, CCNA CyberOps, GPEN, TPN, CEH, CEI, VCP-DCV, CHPA, PenTest+, Security+, Project+, and more. Michael is responsible for identifying four zero-day vulnerabilities in major tax software in 2018. Twitter: @TheMikeWylie",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31646,
      "name": "Michael Wylie",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31647,
      "name": "Michael Rich",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Anne An is a senior security researcher at McAfee's Advanced Programs Group (APG), where she leads threat analysis projects, performs qualitative research on advanced attacks and monitors cybercriminal threats in the Asia-Pacific region. Prior to joining McAfee, she held a variety of research positions at Intel Corporation, Dell SecureWorks, VeriSign iDefense (Accenture) and the Project 2049 Institute.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31648,
      "name": "Anne An",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Nicolas Daubresse (@nicolas_dbresse) is senior security consultant at Wavestone. For four years, he has mainly performed penetration tests on global IT infrastructure and Active Directory environments. Involved in the CERT-W, he also had the occasion to see the other side of the attack and saw these vulnerabilities exploited in the wild.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31649,
      "name": "Nicolas Daubresse",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Jay Angus is a career civil servant and currently the federal lead for Industrial Control System vulnerability management and coordination.  He has worked for the federal government for 15 years and spent the past ten years involved in cybersecurity.  Specifically the past five years he has worked with the Department of Homeland Security supporting industrial control system operations and vulnerability management.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31650,
      "name": "Jay Angus",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Sarah Yoder is a Cyber Security Engineer for the MITRE Corporation. She enjoys furthering her red team skills and applying cyber threat intelligence to ATT&CK‚Ñ¢. Prior to joining MITRE, Sarah worked as an Exploit Analyst with the Department of Defense. Sarah received her M.P.A. in Public Administration and B.S. in Cybersecurity from California State University, San Bernardino (CSUSB).",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31651,
      "name": "Sarah Yoder",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Vanessa Redman has been fully immersed in the Cybersecurity industry for the last 4 years, but has been involved with computers since getting a Commodore Vic-20 in the late 1980s.  She currently teaches Cyber Operations fundamentals.  Vanessa has also worked for a certified Red Team, and as such, is always playing the Devil's Advocate and looking for assumptions to disprove.  She is also studying Algorithmic Game Theory for use in Cyber Threat Intelligence and Attack Detection.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31652,
      "name": "Vanessa Redman",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Matteo Rebeschini is a Principal Solutions Architect and Security Specialist at Elastic, where he works with customers on architecting real-time security analytics solutions using the Elastic Stack. Matteo has 18+ years of experience in the cybersecurity industry covering various roles, from software engineering to technical product management and more recently consulting and solutions architecture.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31653,
      "name": "Matteo Rebeschini",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Emily is a Senior Engineer at Mailchimp, where she leads the Defensive Security team. With a background in data science, she takes an analytical approach to blue teaming and uses statistical methods to guide abuse prevention and security efforts. Under her guidance, the team has developed data-driven procedures for monitoring and detection and continues to explore other innovative ways to defend Mailchimp. An avid runner and triathlete, you can find her on the trails when she's not in front of a screen.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31654,
      "name": "Emily Austin",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Russ Handorf works for the United States Federal Bureau of Investigation.  \n\nRuss is a lot of things: hacker, friend, father, husband, teacher and a Fed. While not chasing squirrels... \n\nWell, he is always chasing squirrels. Who he is actually isn't important, but what he's bringing is; cyber ninjas, you're invited.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31655,
      "name": "Russell Handorf",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Jim Manico is the founder of Manicode Security where he trains software developers on secure coding and security engineering. He is also an investor/advisor for KSOC, Nucleus Security, Signal Sciences, Secure Cicle and BitDiscovery. Jim is a frequent speaker on secure software practices, is a member of the Java Champion community, and is the author of \"Iron-Clad Java: Building Secure Web Applications\" from Oracle Press. Jim also volunteers for the OWASP foundation as the project co-lead for the OWASP Application Security Verification Standard and the OWASP Proactive Controls. For more information, see http://www.linkedin.com/in/jmanico.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31656,
      "name": "Jim Manico",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Chloé Messdaghi is Security Researcher Advocate, board member for 4 nonprofits, one of the Women in Security (WoSEC) founders & heads SF Chapter, founder of WomenHackerz online community, mentors women to enter infosec and remain, speaker on diversity and inclusion, bug bounty, and safe harbor in InfoSec, and Drop Labels founder. https://www.chloemessdaghi.com Twitter: @ChloeMessdaghi",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31657,
      "name": "Chloe Messdaghi",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "When he's not busy crashing bikes or sampling tiki drinks, John runs the threat modelling, application security, data retention, and privacy regulations functions for an independent financial services firm in Chicago, IL. He has over 20 years' experience breaking systems and getting them fixed before the next workday. He is a CISSP and proud owner of several lapsed certifications.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31658,
      "name": "John Orleans",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "https://meliorsec.com/",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31659,
      "name": "Joshua Reynolds",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Andre was Head of IT Security at Tanium, a cybersecurity software company, where he was responsible for security operations, engineering, incident response, and governance/risk/compliance of Tanium systems and networks worldwide. Most notably, Andre served as an FBI Cyber Special Agent in New York City, before being promoted to Supervisory Special Agent at FBI Headquarters in Washington DC. Before entering the FBI Academy at Quantico in 2009, Andre earned his degree from Brown University, and started his career at Goldman Sachs and Cardinal Health. He is on the Board of Directors for the National Cybersecurity Center and on the CFTC's Technology Advisory Committee. In his free time, Andre is the technical consultant for the NBCUniversal TV show Mr. Robot.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31660,
      "name": "Andre McGregor",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Matt Brown works by day as an infosec professional and by night as a Free Software hacker. His interests in IoT security began at his first Defcon (23) where he placed 2nd in the IoT CTF. Today, Matt works as an internal IoT pentester for a major home security company. Matt specializes in IoT pentesting and reverse engineering. When not hacking, you will find Matt serving at his local church or gaming on his PCI passthrough setup.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31661,
      "name": "Matt Brown",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Dhivya Chandramouleeswaran is a Security Researcher at Adobe. She received her master's degree in Information Security and Information Technology from Carnegie Mellon University in 2017. At Adobe, she provides proactive security guidance to key product teams, develops security automation tools and enjoys reviewing security of new technologies. She loves talking about her open source projects at conferences, most recent being Girls Who Code, DefendCon and CISO summit.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31662,
      "name": "Dhivya  Chandramouleeswaran",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Sanne Maasakkers works as a Cyber Security Expert / Ethical Hacker at Fox-IT. In her current role, Sanne mainly deals with performing internal penetration tests, web app penetration tests, code reviews and social engineering. Next to this she stands ‘for a more secure society’, for example during awareness trainings, hack demos and guest lectures (also for kids!).",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31663,
      "name": "Sanne Maasakkers",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Chris Kubecka is founder and CEO of HypaSec has established expertise in technical management operations and executive leadership. Chris has practical and strategic hands-on experience in several cyber warfare incidents: USAF Space Command, detecting and helping to halt the July 2009 Second Wave attacks from the DPKR against South Korea and helping to recover and reestablish international business operations after the world's most devastating cyber warfare attack, Shamoon in 2012. \nPrior to establishing HypaSec, Chris headed the Information Protection Group, network operations, security operations and a joint-international intelligence team for the Aramco family. Helping to recover Aramco from a nation-state attack.  Expert advisor and panelist for several governments and parliaments. Author of several books, offensive security trainer, digital security course creator, recognized expert in several digital security fields including IT/IOT/ICS SCADA oil & gas, electric, water and nuclear.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31664,
      "name": "Chris Kubecka",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "As EFF's Grassroots Advocacy Organizer, Nash works directly with community members and organizations to take advantage of the full range of tools provided by access to tech, while engaging in empowering action toward the maintenance of digital privacy and information security.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31665,
      "name": "Nathan Shepard",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Shay is a Senior Security Researcher on Akamai's Threat Research Team where he focuses on bot detection and web application attacks research for Akamai's cloud security solutions all together. In addition to working with Akamai, Shay is active in many bug bounty programs and is part of the Bugcrowd Researcher Council.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31666,
      "name": "Shay Shavit",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Dr Katherine Pratt received her B.S. in aerospace engineering from MIT in 2008, and her PhD in Electrical and Computer Engineering (ECE) from the University of Washington (UW) in 2019. During undergrad she completed several internships with the private space venture Blue Origin, working in systems and propulsion engineering. She has served four years in the United States Air Force, working primarily as an operational flight test engineer on the F-35 Joint Strike Fighter. Her doctoral dissertation focused on the privacy, ethics, and policy of information derived from elicited neural signals. She was the recipient of a NSF Graduate Research Fellowship and the 2018-19 UW ECE Irene Peden Endowed Fellowship. During graduate school she interned with the ACLU of Washington through the Speech, Privacy, and Technology Project. She also completed a six month fellowship as the first Congressional Innovation Scholar through Tech Congress where she crafted technology policy and legislation.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31667,
      "name": "Katherine Pratt",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Sean Lyngaas has been writing about security issues as a journalist for several years. He is currently senior reporter at CyberScoop, where he focuses on the security of industrial control systems, medical devices, and other machines of modern society. He likes to talk to as many hackers as possible. Sean's reporting career outside of infosec has seen him cover military mutinies and presidential elections in West Africa, asylum seekers in the United States, and democracy activists in the Persian Gulf.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31668,
      "name": "Sean Lyngaas",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Former Intelligence Community officer, current NATO SOF cyber trainer and volunteer of many BSides conferences. I was a SME for iOS and Mac forensics and now apply these skills to the private sector. I have teenage twins at New Mexico State University, I graduated from Georgia Tech, and I enjoy teaching others what I have learned.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31669,
      "name": "Will Baggett",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Alexander Manners is a Lead Cyber Security Engineer at The MITRE Corporation and a Cyber Warfare Operations Officer in the United States Air Force (USAF) Reserve.  He is a member of MITRE's Adversary Emulation and Security Orchestration team where he researches and develops red team and blue team automation solutions. Prior to MITRE, Alex separated from the USAF after four years as a Cyber Warfare Officer and went to work at BIT Systems (A CACI Subsidiary) in their Cyber Capabilities and Development Division filling a variety of different roles. His operational experience and technical background provides a solid footing for developing new, relevant cyber technologies.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31670,
      "name": "Alexander Manners",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Over years working both on a contractual basis and as an employee for New Horizons (NH), Kevin has become a world-class CCSI & MCT instructor teaching classes to thousands of students from Microsoft MCSE Networking and MCSE Private Cloud to Cisco's CCNP and CCNA classes. Kevin has several times ranking in the top 10 NH instructors worldwide and has won Cisco's coveted \"Routing & Switching | Instructor Excellence Award\" over many consecutive years. He has taught over 20,000 hours. Kevin has been mainly hacking Cisco, Microsoft, and linux networks and devices in his capacity as systems/network Admin and infrastructure networking consultant. He enjoys creating/using Raspberry Pi tools and a good SQLi.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31671,
      "name": "Kevin King",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "John has over 20 years of infosec experience, and is currently head of security at CMD.  Settling in San Francisco in 2000, he has run security teams at retail and travel e-commerce companies, as well as a mobile security startup.  He once cooked the breakfast bar at Michigan Big Boy restaurants.  In his free time he plays guitar in an Alt-Country band and plays beer-league ice hockey.  His dog probably hates him.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31672,
      "name": "John Brunn",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "James is a computer enthusiast who started off slinging CAT5, coax and silver satin in exchange for ice cream at the age of eight. As a naval officer in the intelligence community, he worked with NSA across the world and has over 13 years of Information Technology management experience. More recently he has been burning out GPUs, stopping criminals, and spreading comradery through cheap pcb.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31673,
      "name": "James Dietle",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Richard Harang is a Director of Data Science Research at Sophos with over eight years of research experience at the intersection of computer security, machine learning, and privacy. Prior to joining Sophos, he served as a scientist at the U.S. Army Research Laboratory, where he led the research group investigating the applications of machine learning and statistical analysis to problems in network security. He received his PhD in Statistics from the University of California, Santa Barbara. Research interests include randomized methods in machine learning, adversarial machine learning, and ways to use machine learning to support human analysis. By day he uses bad guys to catch math. By night he teaches killer robots to protect his garden from squirrels",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31674,
      "name": "Richard Harang",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Tod Beardsley is the Director of Research at Rapid7. He has over 30 years of hands-on security experience, stretching from in-band telephony switching to modern IoT implementations. He has held IT Ops and Security positions in large organizations such as 3Com, Dell, and Westinghouse, as both an offensive and defensive practitioner. Today, Tod directs the security research program at Rapid7, is a frequent speaker at industry conferences, is a CVE Board member, and is a contributing author to a number of research papers produced by Rapid7.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31675,
      "name": "Tod Beardsley",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Jen is a Security Advocate on Google Cloud. In this role she helps software developers and IT professionals stay out of trouble while getting the most out of cloud computing. Previously she worked in a wide variety of engineering roles from robotics at NASA, to developer advocacy for Google Glass.    She is passionate about education, especially on the subjects of technology and science. If she's away from her laptop, she's probably playing ice hockey, or running a D&D game.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31676,
      "name": "Jen Tong",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Udi Yavo has more than 15 years of experience in cyber-security with a proven track record in leading cutting edge cyber-security R&D projects. Prior to enSilo, Udi spearheaded the direction of the cyber-security unit at the National Electronic Warfare Research & Simulation Center of Rafael Advanced Defense System and served as its CTO. Additionally, he developed and led Rafael's cyber training programs. Udi's achievements at Rafael have been recognized, winning him excellence and innovation awards on complex security projects. Prior to Rafael, Udi served as a system architect at the IDF. He holds a BA in Computer Science from the Open University. Udi is a past speaker in Blackhat, RSA conference and BSidesLV.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31677,
      "name": "Udi Yavo",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Vanessa Frost is a current cybersecurity graduate student working with Dr. Kevin Butler at the FICS research lab at the University of Florida. Her research interests include protecting consumer data privacy from third-parties, limiting the effectiveness of mass-surveillance techniques, and promoting anti-censorship technologies and protocols. After two years in a PhD program, she's pretty convinced that nothing is secure and never will be and that the human species really took the Stone Age for granted. She's grateful for the Internet that allows her to play video games with friends and still can't wrap her head around the fact that most of the giants in computer science are still living. Her heroes include her mother and caffeine. She hates lima beans and public speaking.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31678,
      "name": "Vanessa Frost",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31679,
      "name": "Colin Morgan",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Eva Galperin is EFF's Director of Cybersecurity. Prior to 2007, when she came to work for EFF, Eva worked in security and IT in Silicon Valley and earned degrees in Political Science and International Relations from SFSU. Her work is primarily focused on providing privacy and security for vulnerable populations around the world. To that end, she has applied the combination of her political science and technical background to everything from organizing EFF's Tor Relay Challenge, to writing privacy and security training materials (including Surveillance Self Defense and the Digital First Aid Kit), and publishing research on malware in Syria, Vietnam, Kazakhstan. When she is not collecting new and exotic malware, she practices aerial circus arts and learning new languages.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31680,
      "name": "Eva Galperin",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "flyingpenguins, Cyberwar History, Threat Intel, Hunt, Active Defense, Cyber Letters of Marque, Cloudy Virtualization Container Security, Adversarial Machine Learning, Data Integrity and Ethics in Machine Learning (Formerly Known as Realities of Securing Big Data). Davi works at MongoDB and is author of the book, \"The Realities of Securing Big Data\" (Wiley 2019).",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31681,
      "name": "Davi Ottenheimer",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Trained physicist, now security data scientist, Jack has worked with companies large and small to enhance their capabilities through the practical application of analytics.\nHaving lead a number of Spark / Metron based security projects in Melbourne, New York, and Los Angeles working on distributed computing and infosec problems are passions followed very closely by talking about them.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31682,
      "name": "Jack Burgess",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Brett Goldstein is the Director of Defense Digital Service, where he leads a team of technologists focused on high-impact problems at the Department of Defense. Throughout his career, Brett has served in a range of mission-driven leadership roles across government, the private sector, and academia. He is deeply committed to improving government through data and technology, and by creating tools and new approaches for smarter decision making and better services.  Brett began his technology career at OpenTable, where he helped grow the company from an early stage startup to a multinational corporation. He later joined the Chicago Police Department where he led the department's efforts at predictive analytics. He became Chicago and the nation's first Chief Data Officer and later Chicago's Chief Information Officer. Brett continues to serve as a Senior Fellow and Special Adviser for Urban Science at the University of Chicago.  ",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31683,
      "name": "Brett Goldstein",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Matt is a Director of Information Security at First Information Technology Services with over 10 years of professional experience in the regulatory environments of IT security, housing, and accounting. He specializes in vulnerability management and risk analysis, and he is an expert in FedRAMP Continuous Monitoring with working knowledge of the entire FedRAMP process. In his role at FITS, Matt manages continuous monitoring work for commercial clients and provides guidance to customers for their compliance audits. He uses his expertise to help customers drive vulnerability remediation and improve their cybersecurity risk posture.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31684,
      "name": "Matthew Hahn",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Pablo Breuer is currently the director of US Special Operations Command Donovan Group and senior military advisor and innovation officer to SOFWERX.  He's served at the National Security Agency and U.S. Cyber Command as well as being the Director of C4 at U.S. Naval Forces Central Command.  He is a DoD Cyber Cup and Defcon Black Badge winner, and has been adjunct faculty at National University, California State University Monterey Bay, and a Visiting Scientist at Carnegie Mellon CERT/SEI.  He has taught classes for various U.S. government agencies and industry on topics ranging from malware reverse engineering and exploit development to cyber policy and authorities.  Pablo is also a founder and board member of The Diana Initiative, an InfoSec event focused on advancing the careers of women in cyber security, and is on the staff for BSides Las Vegas and CircleCityCon.  Pablo holds degrees in computer science.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31685,
      "name": "Pablo Breuer",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Manuel Nader is a Security Researcher at Trustwave Spiderlabs. He works on tracking new vulnerabilities, identifying how those vulnerabilities are exploited and writing code that detects the presence of or exploits those vulnerabilities. Previously worked in the offensive side of security and before that he worked on the defensive side of security. Manuel's favorite independent research involve web attacks.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31686,
      "name": "Manuel Nader",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Elizabeth is currently wrapping up her International Master in Intelligence, Security, and Strategic Studies with a concentration in Security & Technology – a degree jointly awarded by the University of Glasgow in Scotland, Dublin City University in Ireland, and Charles University in the Czech Republic. Her thesis concentrates on the intersection of Artificial Intelligence and Human Security. She is a recipient of the fully funded Erasmus Mundus scholarship for her studies. Before that, she was a self-taught software developer after her undergraduate studies in International Business with a concentration in Russian language and culture. In her free time, Elizabeth is a hobby photographer, training aerialist, musician, and gamer.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31687,
      "name": "Elizabeth Wilson",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Nimrod Stoler is a cybersecurity researcher at CyberArk Labs where he focuses on researching the latest attack techniques and applying lessons learned to improve cyber defenses. Nimrod's primary research areas are network defense, DevOps analysis and security and Linux containers. Prior to CyberArk, Nimrod served in several high-technology roles doing research and development of software and hardware.\nNimrod holds an LLB in law and BA in economics.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31688,
      "name": "Nimrod Stoler",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Eli Sugarman is a Program Officer at the William and Flora\nHewlett Foundation. He manages the Cyber Initiative, a ten-year, $130\nmillion grant-making effort that aims to build a more robust\ncybersecurity field and improve policy-making.\n\nPreviously, he was a consultant and strategist to private sector and\nnonprofit leaders. He has served as a foreign affairs officer at the\nU.S. Department of State, where he focused on international security\nissues.\n\nA San Diego native and graduate of Middlebury College, he holds a J.D.\nfrom Stanford University Law School.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31689,
      "name": "Eli Sugarman",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "I started tinkering with webpage vulnerabilities when I was around 17 years old. I had no clue it was a real job. I was soon, purposefully, infecting my own computers with spyware to see what happens and how they work. Then I joined the military (around 19 years old) as a Signals Intelligence Analyst (National Guard 2003, active duty Army 2005, and ended my career last year in the reserves).\nI've done some threat targeting downrange in Afghanistan and Iraq and even more targeting back here stateside. \nI left the targeting-focused world for a short time when I worked at the Department of Energy as their Senior Reverse Engineer. \nCurrently, I am working at Fidelis as a Principal Threat Researcher.\nAs you can see, my career grew up in the shadows of digital conversations. I saw and learned so much.\nA target is a target - human or digital.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31690,
      "name": "Yasmine Johnston-Ison",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "John works on the Detection and Response team at Salesforce, which focuses on aggregating all security logs at Salesforce, applying rules and models to obtain high fidelity alerts, and sharing those results with other pertinent Security teams. In particular, John performs machine learning on security logs to alert to new attacks, to improve our existing alerts and rules, and to find/make new contextual data to help in investigations. He previously focused on data science at a startup focused on social media security. He has presented at several security cons, including BSidesLV, Black Hat, DEF CON, and SecTor.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31691,
      "name": "John Seymour",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Nir started his career as a squad leader in the Israeli Intelligence Corps. He helped with gathering intelligence tracking the growth of terrorist organizations. \nNir has over 15 years of experience in identity management, user behavior and insider threat analysis. Currently, Nir is a Principal Solutions Engineer for Preempt. \nNir publishes his posts on LinkedIn and speaks occasionally at security conferences.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31692,
      "name": "Nir Yosha",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Tomer Zait (Principal Security Researcher at F5Networks) worked in a range of professions in the security industry (Web Application Firewall Integrator, Penetration Tester, Application Security Engineer, Security Researcher, Etc.). During this time, he developed open-source projects (most of them are security tools). His projects include: x64dbgpy; PyMultitor (Presented In BlackHat Arsenal ASIA/US/EU 2017); SubDomain-Analyzer; AutoBrowser; phantom-requests, and more. Tomer writes regularly for online security magazines and is a 4-time winner of the Israeli Cyber Challenge (CTF).",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31693,
      "name": "Tomer Zait",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Roy Wattanasin @wr0 is a healthcare information security professional and a faculty member of over 10+ years. He has experience in many industries and spends most of his time developing information security programs, teaching students and helping to build the local communities. Roy is also a member of multiple advisory groups including OWASP Boston etc. He was an adjunct instructor at Brandeis University as part of the Health and Medical Informatics and Information Security Master's degree programs. He is also co-founder of the Health & Medical Informatics program and credited for bringing back Security BSides Boston many years ago.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31694,
      "name": "Roy Wattanasin",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Highly sought-after dinner guest Ty Atkin is a Security Operations Center Lead and Co-Founder of FullMetal CyberSecurity.   Firm believer that anything worth doing is not only worth doing right but should be done with excellence. Ty strives to touch the “Corner Post” in all aspects of his life. Ty wants to live so that you wonder if he’s working or playing.  Hard work, self-reliance, respect, humor, determination and honor are not antiquated beliefs. “I want those values to be contagious and rub off on others when they interact with me.”  Ty’s wife is classiest and prettiest lady in the history of… well, everything. True story.  Ty is a swashbuckling Patriot, debonair rogue, DeLorean time traveling consultant, and stately gentleman. Ty loves 80’s movies and music, playing guitar, drag racing, heavy metal, Firefly, and Grandma Atkin’s homemade Pumpkin Roll.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31695,
      "name": "Ty Atkin",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Ty Sbano is an Information Security leader with over 13 years of experience, mainly in Financial Technology organizations.  Currently, Ty is the Cloud Chief Information Security Officer at Sisense, who acquired Periscope Data in May 2019. Ty's career has been focused on developing application and product security programs for Capital One, JPMorgan Chase, LendingClub, and Target. Key areas of knowledge include developing security champions, threat modeling, secure code training, static code analysis, component analysis, dynamic analysis, penetration testing and red teaming. Ty's security mentality has been concentrated on enabling engineering and product teams to securely move at the speed of the business to make it a competitive advantage. Ty graduated from Penn State University with a B.S. in Information Science & Technology and from Norwich University with a M.S. in Information Assurance. He currently holds a CISSP, CEH, CCSK and CPT.  To learn more, please visit - tysbano.com",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31696,
      "name": "Ty Sbano",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Nimrod Levy is a seasoned security researcher with over a decade of experience in the field of web application penetration testing and infrastructure attack simulations (i.e Red Team). Nimrod is the CTO and Co-founder at Scorpiones, a cyber security company which, among rest, illustrate potential attack vectors routes for its clients and recommending how to mitigate them. Nimrod enjoys giving back to the community, therefore the security tools he wrote in his free time are available through open-source projects.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31697,
      "name": "Nimrod Levy",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Rohan (@Decode141) started his career as a bounty hunter and then moved into specialist consultancy. He primarily assesses Windows systems, but has previously contributed to application and software research (such as Formula Injection and client-sided code execution vulnerabilities in common software). Rohan holds certs such as OSCE, OSCP and CREST CCT.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31698,
      "name": "Rohan Durve",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Serenity Smile is a SANS Diversity Cybertalent Immersion Academy Graduate.  She holds the GIAC GSEC (GIAC Security Essentials), GIAC GCIH (GIAC Certified Incident Handler), and GIAC GCIA (GIAC Certified Intrusion Analyst) Certifications.  Additionally, she’s earned five different yoga and meditation teaching certifications and is a health and wellness consultant.  She also co-directs Women Who Code in her city and is an avid cybersecurity researcher, chair of an Arboretum Board, a Coursera Beta-Tester, and an avid lifelong learner.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31699,
      "name": "Serenity Smile",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Having used Wireshark ever since it was Ethereal, David has been analyzing network traffic for well over a decade. He has spent the majority of his professional career understanding how networks and applications work, currently as Principal Threat Researcher for Awake Security, which enables rapid, iterative, conclusive investigations & threat hunting by placing context at security teams' fingertips. David holds computer security degrees from the Rochester Institute of Technology (BS) and Carnegie Mellon University (MS).",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31700,
      "name": "David Pearson",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Patrick Kiley is a security consultant and researcher with a strong interest in transport and critical infrastructure systems. His more than 18 years of information security experience includes working with both private sector employers and the Department of Energy/National Nuclear Security Administration (NNSA). Patrick has spent many years researching transportation systems, and he is currently building an experimental aircraft in his garage. Patrick was one of the first people to receive the Advanced Penetration Testing and Exploit development (GXPN) certifications from SANS and also holds GPEN, GAWN, GCIH, CISSP, MCSE certifications, and a pilot’s license.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31701,
      "name": "Patrick Kiley",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Cameron's service in government has focused on internet scanning and direct reporting as a policy forcing function. He was the product manager for \"Cyber Hygiene\", a vulnerability scanning service that helps users detect flaws and adopt modern security protocols. He was the lead technical author of several cybersecurity directives that require civilian executive branch agencies maintain good practices in web encryption, email authentication, and DNS security. He also managed the development of open source tools to track the directives' progress. \n\nIn 2018, Cameron served as the deputy program manager for the .gov top-level domain at the General Services Administration, where he ran day-to-day operations. Key outcomes of his work included mandatory two-factor authentication to the .gov registrar, a plain-language website for the TLD, and guiding new domain registrants to publish a security contact to WHOIS and adopt security features like HSTS preloading or strong DMARC policies.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31702,
      "name": "Cameron Dixon",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "David Hunt is a Principal Cyber Security Engineer at MITRE, where he works on automated adversary emulation. He is currently leading development of the open-source CALDERA platform, along with contributing to other projects in MITRE's internal research and development portfolio. Prior to MITRE, David led engineering for FireEye's threat intelligence division from 2016 to 2018. There, he orchestrated the storage and assimilation of APT behavioral data at scale, improving analysts' access to sensitive information. In addition to a decade in systems and software engineering, David has 5 years of experience in red team environments for both large companies and security start-ups. This time in the field has given David valuable insight into how adversaries operate in the wild. He has a passion for combining these experiences to solve real-world problems in creative ways.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31703,
      "name": "David Hunt",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Yolan is a security researcher at Kudelski Security delving into (and dwelling on) cryptography, crypto coding, blockchains technologies and other fun things. He has spoken at Black Hat USA, BSidesLV, NorthSec, Cryptovillage and DEF CON, on topics including cryptography, public keys vulnerabilities, or vulnerability research, and presented at FDTC the first known practical fault attack against the EdDSA signature scheme. Yolan tweets as @anomalroil.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31704,
      "name": "Yolan Romailler",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Oleksandr Mirosh, Software Security Researcher, Micro Focus Fortify\nOleksandr Mirosh has over 11 years of computer security experience, including vulnerability research, penetration testing, reverse engineering, fuzzing, developing exploits and consulting. He is working for Fortify Software Security Research team in Micro Focus investigating and analyzing new threats, vulnerabilities, security weaknesses, new techniques of exploiting security issues and development vulnerability detection, protection and remediation rules. In the past, he has performed a wide variety of security assessments, including design and code reviews, threat modelling, testing and fuzzing in order to identify and remove any existing or potentially emerging security defects in the software of various customers.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31705,
      "name": "Oleksandr Mirosh",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Keren Elazari is an internationally recognized researcher, author and speaker on all matters cyber security and hacker culture. Since 2000, Keren has worked with leading security firms, public organizations and Fortune 500 companies. Keren's independent research about cyber security has been featured by Scientific American, WIRED , TED,  CNN, Financial Times and more. Keren's TED talk \"Hackers: the Internet's immune system\" has been viewed by millions online, translated to 30 languages, selected as \"Most Powerful Ideas' and helped shape a global conversation about the role of hackers in the information age. In 2016 Keren founded BSidesTLV, a community event for hackers in Israel. Keren is also a visiting faculty member of Singularity University. In 2016 she collaborated on the Amazon bestseller book for \"Women in Tech\" (Penguin Random House).",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31706,
      "name": "Keren Elazari",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Andrew Case is the Director of Research at Volexity and a core developer of the Volatility memory analysis framework. His professional experience includes digital forensic investigations, incident response handling, malware analysis, penetration tests, and source code audits. Andrew is a co-author of the award-winning book \"The Art of Memory Forensics: Detecting Malware and Threats in Windows, Linux, and Mac Memory\". Andrew also co-teaches the \"Digital Forensics & Incident Response\" class at Black Hat. Andrew's primary research focus is physical memory analysis, and he has presented his research at conferences including Black Hat, RSA, SecTor, SOURCE, BSides, OMFW, GFirst, and DFRWS.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31707,
      "name": "Andrew Case",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Ronnie Obenhaus is a cybersecurity professional with over 20 years of experience in varying fields. He served with the United States Army and solidified his background in Network Defense and brings that background knowledge to the forefront of his job with the Defense Cyber Crime Center (DC3) as the Deputy Chief of Analytics. He loves movies and comic books. Do not ask him about the latter unless you are prepared for a lengthy conversation about the state of the industry today.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31708,
      "name": "Ronnie Obenhaus",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Andy Applebaum is a security researcher at The MITRE Corporation, where he works on applied and theoretical security research problems, including as one of the leads on the CALDERA automated adversary emulation project and as a member of the ATT&CK team. His work tends to lie at the intersection of security, automation, and reasoning, with a growing personal interest in understanding how attackers can thwart machine learning algorithms in security settings. Andy received his PhD in computer science from the University of California Davis and he holds the OSCP certification. Outside of work, Andy is an avid chess player, having recently won the 2018 DEF CON chess championship.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31709,
      "name": "Andy Applebaum",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Jon runs the Detect function at Photobox Group, which covers Security Operations, Incident Response and Red Team Testing. He also leads the Security Innovation Hub, running projects to evaluate technologies and processes that support data-informed decision making, process automation and a DevOps engineering culture. Prior to Photobox, Jon did worked in various roles doing strategy, architecture, product management, project management and data analytics for companies that ranged from startups to federated multi-nationals. When he's not doing security he's either longboarding or writing music.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31710,
      "name": "Jon Hawes",
      "link": ""
    },
    {
      "updated_at": "2019-08-02T05:36+0000",
      "title": "",
      "description": "@pwnEIP is a security researcher that spends his days training and developing red and blue teams.  He specializes in teaching operational tradecraft, tool specialization and skill proficiency.  When he is not training, he builds and competes in CTFs.  He loves to operationally apply CTF experiences and also take real world scenarios and develop them into compelling CTFs",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31711,
      "name": "Barrett Darnell",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Alyssa is a hacker, blue-teamer, experienced speaker and security evangelist with over 15 years of experience in the security industry. She is the Manager of the Information Security Solutions Practice for CDW, working with customers to deliver security assessment and strategic advisory services. Alyssa is also the head of the WoSEC Milwaukee chapter and an advocate for developing truly inclusive culture as an avenue for promoting sustainable diversity within organizations and the information security community.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31712,
      "name": "Alyssa Miller",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Graduated from the Costa Rican Institute of Technology with a BS in Computer Science in 2017. Started working as an intern in National Instruments, getting a full-time position later as a Information Security Analyst. Currently in charge of managing the logs throughout the Elastic Stack platform, incident response and also testing new tools related to security, he is currently pursuing a certification as a Cloud Security specialist and architect.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31713,
      "name": "Pedro Rodriguez",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Cherie Burgett is an Intelligence Analyst, Threat Researcher, Public Speaker, Theologian, and ISAC Operations, Director. As the Director of ISAC Operations for the Mining and Metals ISAC, Cherie Burgett leads the ISAC's cyber intelligence program, enables sharing and coordinates responses to active threats, provides the link between the public and private sector, and supports companies develop strategies as they undergo digital transformation.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31714,
      "name": "Cherie Burgett",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Harlan Lieberman-Berg is an engineer with the Defense Digital Service, currently focusing on reforming the background investigation process for federal employees.  With a background in operations and information security, he is a passionate advocate for free and open source software and the ethical responsibilities of software engineers and technologists of all stripes.\n\nHarlan's career began as a *nix administrator, working in startups from online music sales, adult entertainment, and ad tech.  He served several roles at Chitika, Inc., including the Director of Engineering, before starting his own company building a high-frequency ad trading system for the adult entertainment industry.  Before joining the Defense Digital Service, he was an information security architect at Akamai Technologies, the first and largest CDN in the world.\n\nHarlan is also former Kernel Security Lead of Gentoo Linux, currently leads the Debian Let's Encrypt team maintaining (among other things) certbot, the EFF’s premier Let's Encrypt client.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31715,
      "name": "Harlan Lieberman-Berg",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Dimitri has been in the security industry for over 15 years, and is the CTO of a cyber security company. Having enjoyed many years of Passwords, and password-related talks, he is branching out to cover another one of his passions: Ways to exfiltrate data. Dimitri has spoken at BSides in a few countries as well as PasswordsCon and other conferences.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31716,
      "name": "Dimitri Fousekis",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Remi Escourrou (@remiescourrou) is senior security consultant at Wavestone. For four years, he has been developing his skills as a pentester of IT infrastructure, red teamer and more specifically on Active Directory environment. He is also involved in the CERT-W as First Responder and already saw the other side of the attack.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31717,
      "name": "Remi Escourrou",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Katie Ledoux the Manager of Trust and Security Governance at Rapid7 in Boston, Massachusetts. Her team is responsible for security risk management, security compliance, security awareness training, security policy development and exception management, business continuity plan and IR plan development and testing, and access recertification. She has also contributed to projects in data privacy and responsible vulnerability disclosure. You can find her on Twitter @kledoux.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31718,
      "name": "Katie Ledoux",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Security Manager in the Norwegian Insurance Corporation Storebrand, with responsibility of ensuring security in digital services and increasing web application awareness, working closely with developers and DevOps teams. Previously Cyber Threat meanagement consultant in EY, leading teams in penetration testing engagements. Holder of multiple certifications including GXPN, GWAPT, GPEN, OSCP.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31719,
      "name": "Kenny Jansson",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Hailing from a town where the wifi infrastructure hasn't been upgraded since 2004, I got my collegiate footing in global security but have since fallen victim to the slippery slope of information security. Now I spend my days using the tools of vendors whose parties I went to at my first DefCon in 2017 (hint: less champagne). I'm hoping to expand my InfoSec horizons and please my research-loving brain by partnering with a mentor to present on a topic I'm incredibly passionate about- China.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31720,
      "name": "Anna Skelton",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Ram Shankar is a Data Cowboy in Azure Security Data Science at Microsoft, working on the intersection of Machine Learning and Cyber Security. Ram is also an affiliate at the Berkman Klein Center at Harvard University, and Technical Advisory Board Member at University of Washington. He graduated from Carnegie Mellon University with a masters in Computer Engineering and a second masters in Innovation Management.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31721,
      "name": "Ram Shankar Siva Kumar",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Kyle is a Cloud Security Architect/Shaman/Dude with experience in AWS and Azure and dealing with large Enterprises. When he's not Securing the world from the Cloud that may fall, he enjoys teaching those about Cloud Security, mixing his own experiences in to achieve how to obtain peace between their company and skylords.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31722,
      "name": "Kyle Dickinson",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Alexandrine Torrents is a cybersecurity consultant at Wavestone, a French consulting company. She is specialized in penetration testing, and performed several security assessment on ICS. She worked on a few ICS models to demonstrate attacks on PLCs and she developed a particular tool to request Siemens PLCs. Moreover, she is also working at securing ICS, in the scope of the French military law, enforcing companies offering a vital service to the nation to comply to security rules.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31723,
      "name": "Alexandrine Torrents",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Chrissy heads up the IT Security Operations for a Close Protection company by day and is a Security Researcher by night. Being an ex-Bodyguard herself, she brings this unique perception into the community and currently undertakes security research to help protect her the guys on the front-line.  She is actively involved within the information security community across a wealth of subjects including the rights for researchers within vulnerability disclosure.   As a recent masters graduate, she has accomplished the following successes so far: Winner of Cyber Security Challenge UK (University Challenge - Team Edinburgh Napier), Finalist for Pragyan CTF, A BlackHat Challenge Coin winner for OSINT from Social Engineer.org and Black Hat Scholarship, the Steelcon Award, a WISP Sponsorship, she was the BSides London Rookie Track Winner for 2018 and lastly finalist for (ISC)² up and coming information security professional for 2019.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31724,
      "name": "Chrissy Morgan",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Brian manages an incredible team of security professionals at the George Washington University. He attended college at University of Maryland and has been working in information security for over 16 years. When not reviewing resumes or contracts, he's explaining vulnerabilities in plain English, valiantly fighting off vendors, and trying (failing) desperately to get to inbox zero.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31725,
      "name": "Brian Markham",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Benjamin Edwards joined the Cyentia Institute as a Senior Data Scientist at the beginning of 2019. He was formerly with IBM Research, where he worked in applying advanced machine learning techniques to solve real world security problems and shaped the next generation of analytical security models. Before that he received his Ph.D. from the University of New Mexico with a research focus that blended the fields of security, data science, and complex systems. His work has lead to a better understanding of global attack trends, the effects of security interventions, and even nation state cybersecurity policy.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31726,
      "name": "Benjamin Edwards",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31727,
      "name": "Pavel Tsakalidis",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31728,
      "name": "Kristin Dahl",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Steve Allor is Director of the Americas for Secure Code Warrior, a global security company that makes software development better and more secure. Since joining Secure Code Warrior soon after its inception, Steve has been passionate about helping large global enterprises in the finance, technology and telecommunications industries to scale an engaging, interactive learning approach, enabling these organizations to rally their developers as the first line of defense in their cybersecurity strategies. \nOver the past 20 years, Steve has held various executive leadership roles in sales, business development and marketing for technology companies, where his focus was on enabling customer success as he helped scale and grow the business. Steve has earned a Bachelor of Science degree in Marketing at Boston College Carroll School of Management, as well as a Master of Business Administration at Harvard.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31729,
      "name": "Steve Allor",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Sibusiso is a former professional athlete that has represented his country at the highest sporting level, the Olympic games. After retiring from the athletics he transitioned into cyber security and has been doing penetration testing for the past five years. Sibusiso co-founded a majority black owned cyber security company called Ironsky Pty Ltd in South Africa where he serves as a technical director and penetration tester. Sibusiso has always had an interest for passwords and how users create and use passwords within the organisation.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31730,
      "name": "Sibusiso Sishi",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Omri has a decade of experience in the security field leading the R&D of large-scale defensive security solutions, performing incident response and conducting low-level research. Nowadays, as the security research team leader at enSilo he digs into OS internals and exploits, reverse engineer malware and develops new offensive and defensive techniques. Omri is a past speaker in BSidesLV.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31731,
      "name": "Omri Misgav",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Mr. Stoner has over 18 years of experience in the national security sector working a variety of roles, including most recently as a Cyber Threat Analyst, Cyber Counterintelligence Analyst and Instructor. His work experience includes IT, instruction and course design, cyber exercise and testing, intelligence collection, threat support, SIGINT (Signals Intelligence), and Cyber Operations. He holds A+, Net+, CEH, CHFI, CEI, CISD, CASP and CISSP certifications. He loves soccer and is an avid coach and fan. He is currently the Chief of Analytics, in DCISE at DC3.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31732,
      "name": "John Stoner",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Joey Maresca is the Director of Security at Data Machines and has over 13 years experience in information security with a background that covers certification & accreditation, encryption compliance, and red-team offensive security testing. This experience has covered a variety of business sectors including commercial technology companies, government, healthcare, and financial sectors. Joey is a lifelong hacker who enjoys finding security problems, discovering solutions to fix them, and sharing his knowledge while hosting the Hackers with Bourbon weekly video stream.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31733,
      "name": "Joey Maresca",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "For over two decades, Mike has focused on building highly performing organizations that solve important and challenging problems in security.  Most recently, he was the Chief Security Officer at Lookout, where he ran teams that discovered major threat actors in the mobile space and the protection of Lookout's customer base of over 150M mobile users.  He previously lead Product Development Security at GE Healthcare, where he built a global team to secure the Healthcare Internet of Things. Prior to that, he co-founded The Hacker Academy and MAD Security, and has held leadership positions at companies including nCircle Network Security, Liberty Mutual Insurance and Neohapsis.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31734,
      "name": "Mike Murray",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Mitch Wasson is currently working as a software engineer on Cisco’s Advanced Malware Protection (AMP) for Endpoints data engineering team. Aside from merging bugs into master, he creates detection platforms and middleware that support millions of endpoints. Mitch also holds a master’s degree in computer engineering from the University of Toronto. Outside of tech, he enjoys most winter sports - like skiing in the Canadian Rockies.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31735,
      "name": "Mitch Wasson",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Jared Chandler is a graduate student at Tufts University. His research is focused on automated reverse engineering of network protocols and other applied formal methods in support of cybersecurity. He has over a decade of industry experience as a software developer and systems engineer. Prior to studying computer science at Tufts he studied European history and fine arts, receiving degrees in both from the University of Alaska Anchorage.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31736,
      "name": "Jared Chandler",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Tanner is a full scope penetration tester for Aon providing red team, social engineering, physical security, and source code review consulting for a myriad of clients in diverse industries. As a software engineer, he discovered the cyber security world through his first job and has been hooked ever since! Now he applies his knowledge of writing software towards breaking it along with developing tools to enhance his and other hackers abilities.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31737,
      "name": "Tanner Barnes",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Rob is a researcher on the Advanced Threat Hunting team in Booz Allen Hamilton Dark Labs. He has a PhD in computer science from the University of Maryland, Baltimore County and multiple years of experience in the computer security field.  His research interests include semantic modeling of computer programs, reverse engineering, and cataloging the inevitable failure of human efforts to build well-engineered systems.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31738,
      "name": "Rob Brandon",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "With nearly 20 years of experience in the cyber-security industry, Guy held various positions in both corporates and start-ups",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31739,
      "name": "Gregory Price",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Mike Sconzo has been around the Security Industry for quite some time, and is interested in creating and implementing new methods of detecting unknown and suspicious network activity as well as different approaches for file/malware analysis. This includes looking for protocol anomalies, patterns of network traffic, and various forms of static and dynamic file analysis. He works on reversing malware, tool creation for analysis, and threat intelligence. Currently a lot of his time is spent doing data exploration and tinkering with statistical analysis and machine learning to solve detection and threat intelligence related problems.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31740,
      "name": "Mike Sconzo",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Alvaro Mu√±oz Sanchez, Software Security Researcher, Micro Focus Fortify\nAlvaro Mu√±oz (@pwntester) is Principal Security Researcher at Micro Focus Fortify where he researches new software vulnerabilities and implement systems to detect them. His research focuses on web application frameworks where he looks for vulnerabilities or unsafe uses of APIs. Before joining the research team, he worked as an Application Security Consultant helping enterprises to deploy application security programs. Mu√±oz has presented at many Security conferences including BlackHat, DEF CON, RSA, OWASP AppSec US & EU, JavaOne, etc and holds several infosec certifications, including OSCP, GWAPT and CISSP. He plays CTFs with Spanish int3pids team and blogs at http://www.pwntester.com.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31741,
      "name": "Alvaro Munoz",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Beau Woods is a leader with the I Am The Cavalry grassroots initiative, Cyber Safety Innovation Fellow with the Atlantic Council, and Founder/CEO of Stratigos Security. His work bridges the gap between the security research and public policy communities, to ensure connected technology that can impact life and safety is worthy of our trust. He formerly served as Entrepreneur in Residence with the US FDA, and Managing Principle Consultant at Dell SecureWorks. Over the past several years in this capacity, he has consulted with the energy, healthcare, automotive, aviation, rail, and IoT industries, as well as cyber security researchers, US and international policy makers, and the White House. Beau is a published author, frequent public speaker, often quoted in media, and is often engaged for public or private speaking\nvenues.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31742,
      "name": "Beau Woods",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Nick is an undergraduate at Middlebury College and a computer science major focusing in computer systems. He first became interested in computer security after the disclosure of the Spectre and Meltdown hardware vulnerabilities last year.  He has an interest in assembly programming and compilers, and ROPC is a natural combination of these two.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31743,
      "name": "Nicholas Mosier",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "A 14-year Cloud and Datacenter Microsoft MVP, Darren has a wealth of experience in Identity and Access Management and was the CTO and founder of SDM software, a provider of Microsoft systems management solutions. Prior to launching SDM, Darren held senior infrastructure architecture roles in Fortune 500 companies and was also the CTO of Quest Software. As a Microsoft MVP, Darren has contributed to numerous publications on Windows networks, Active Directory and Group Policy, and was a Contributing Editor for Windows IT Pro Magazine for 20 years. As a thought leader, Darren has over 20K subscribers to his blog (gpoguy.com) and an extremely active twitter following @grouppolicyguy.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31744,
      "name": "Darren Mar-Elia",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31745,
      "name": "Bryson Bort",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31746,
      "name": "Daniel Abeles",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Kent Brake is a Principal Solutions Architect based in Richmond, VA. At Elastic, Kent works with Department of Defense customers as well as commercial partners with a focus on security analytics. Before joining Elastic, Kent spent 9 years building Cloudmark based messaging security with customers like AT&T, Facebook and Fireeye.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31747,
      "name": "Kent Brake",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "BSidesTLV chairman and CTF lead, Public speaker, and recipient of the Cisco “black belt” security ninja honor – Cisco’s highest cyber security advocate rank. With nearly 20 years of experience in the cyber-security industry, Guy held various positions in both corporates and start-ups\n\nHe is currently a Cyber Security Consultant, focusing on OS and Services Hardening, Cryptography, AI Security, and Reverse Engineering.\n\nhttps://meliorsec.com/",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31748,
      "name": "Guy Barnhart-Magen",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Kathleen \"Katie\" Trimble currently serves as the Section Chief of the Vulnerability Management and Coordination section of the Cyber Threat & Risk Analysis (CTRA) branch of the NCCIC of DHS, where she leads the Department's primary operations arm for coordination of the responsible disclosure and mitigation of identified cyber vulnerabilities in control systems and enterprise hardware and software used in the 16 critical infrastructure sectors and all levels of U.S. government organizations.\n\nPrevious to this position, within the Department, she served as the Senior Communications Infrastructure Sector Analyst in the Office of Cyber and Infrastructure Analysis (OCIA), in this capacity, she operated as the focal point for efforts related to wired and wireless communications between interagency government partners, DHS components, and Private Industry stakeholders in response to National Security Council requirements.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31749,
      "name": "Katie Trimble",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Sara-Jayne \"SJ\" Terp is a data scientist, strategist, old-school AI researcher and community builder who focuses on complex business and social problems. She's currently working on the Global Disinformation Index (an independent disinformation rating system), and running a Credibility Coalition working group on the application of information security principles to misinformation; her previous work covers belief systems and situation awareness across many disciplines (including autonomous systems,intelligence analysis, crisis data, journalism, online advertising and political data science).",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31750,
      "name": "SJ Terp",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Pete has spent over 15 years at the intersection of Business and Technology. Understanding the complexities of enterprise business as well as the intricacies of running a small company is something, he prides himself in. He has worn many hats (often at the same time) throughout his career including Data Analyst, Product Owner, Business Analyst, Software Engineer, Team Leader, QA Engineer and probably several others he’s forgotten. Out of all of this, he’s discovered his passion is really in identifying simple and effective applications of technology to the problems all businesses face. This has driven his leadership of the technology team at RevCult since day one and has proven to be enjoyable, sustainable and productive for the company.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31751,
      "name": "Pete Thurston",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Monta Elkins is \"Hacker-in-Chief\" for FoxGuard Solutions, an ICS patch information provider.  A security researcher/consultant and U.S. patent grantee, he is considered by many of his friends to be the Chuck Norris of ICS Cybersecurity.\n\nMonta has been a speaker at more security conferences than even his enormous ego can remember including: DEFCON, CS3STHLM, BSIDES, GE Digital Energy, ICSJWG, Toshiba ICS, GridSecCon, ICS CyberSecurity, UTC Telecom, SANS ICS Summit and was named Cybersecurity Professional of the Year by EnergySec.  In his spare time, Monta creates the totally-safe-for-work \"Coke and Strippers\" electronic projects YouTube channel https://tinyurl.com/y6vpmbw4\n\nMonta is the author of \"Defense Against the Dark Arts\" hands-on hacker tools and techniques classes, and a Certified SANS instructor.  He is also a guest lecturer for colleges, universities and elsewhere.  As a small child, he entertained himself by memorizing Pi -- backwards.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31752,
      "name": "Monta Elkins",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "With over 20 years in IT security and associated subjects, Richard has held both offensive and defensive roles encompassing operational, research and strategic tasks.  Richard has worked for a range of government and industry organisations in highly trusted positions and currently holds a senior technical role in the UK’s National Cyber Security Centre, supporting the UK economy and its citizens.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31753,
      "name": "Richard Manning",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Abdessamad Temmart is an information security consultant and App Sec Engineer. He worked through a variety of sources to provide security professional services to clients. Abdessamad is also a member of the OWASP Proactive controls Project, where he contributes in the update of his Top-Ten document, and also a co-author of the Mobile Security Testing guide.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31754,
      "name": "Abdessamad TEMMAR",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Maurice Turner is Senior Technologist at the Center for Democracy & Technology, a Washington, DC-based non-profit advocacy organization dedicated to ensuring the internet remains open, innovative and free. Supporting work across all of CDT's programmatic areas, Turner focuses on the Election Security and Privacy Project identifying and updating election cybersecurity practices and infrastructure, and working through potential remedies. Turner brings a unique mix of formal education and practical work experience in technology and local, regional, and national policymaking to the Internet Architecture team. After receiving a bachelor's in political science from Cal State Fullerton, he went on to earn a master's in public administration from the University of Southern California focusing on emerging communication technologies, privacy, and civic engagement. In addition, he holds a graduate certificate in cybersecurity strategy from Georgetown University, and has nearly a decade of municipal management experience complemented by numerous private-sector technology positions, fellowships, and internships.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31755,
      "name": "Maurice Turner",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Will Pearce is Senior Security Consultant/Researcher at Silent Break Security. His work involves security consulting, red team operations, and offensive research. He has presented \"Dark Side Ops\" course series for blackhat and other groups. His research is focused primarily on malware development, windows techniques, and exploring the intersection of machine learning and offensive operations.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31756,
      "name": "Will Pearce",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Kim Zetter is an award-winning investigative journalist and book author who covers security, cybercrime, digital warfare, surveillance and civil liberties. She has been covering computer security and the hacking underground since 1999, first for PC World magazine, and more recently for WIRED, where she began writing in 2003. In 2004, long before fears of Russia hacking US presidential elections became an issue, she wrote a series of award-winning investigative pieces about the security problems with electronic voting machines and their susceptibility to hacking. She was among the first journalists to cover Stuxnet, and in 2014, Crown/Random House.published her widely acclaimed book on the topic titled Countdown to Zero Day: Stuxnet and the Launch of the World's First Digital Weapon.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31757,
      "name": "Kim Zetter",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Colin began his career at Rapid7, working to take research from the data science team, build production quality services, and integrate them into the InsightIDR platform. Eventually, after working on IDR's detection team to build attacker signatures for its customers, Colin started working at Dropbox. Since working on the Detection and Response Team at Dropbox Colin has had the chance to dive deep into D&R work, learning to engage with the red team, and take on challenges that D&R teams face.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31758,
      "name": "Colin OBrien",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "After 21 years of classified intelligence work for the US Air Force, Brad transitioned to cyber security in 2010, and he is a currently a Threat Intelligence Analyst for Palo Alto Networks Unit 42. Brad specializes in network traffic analysis. He is also a handler for the Internet Storm Center (ISC) and has posted more than 140 diaries at isc.sans.edu. Brad routinely blogs technical details and analysis of infection traffic at www.malware-traffic-analysis.net, where he provides traffic analysis exercises and over 1,600 malware and pcap samples to a growing community of information security professionals.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31759,
      "name": "Bradley Duncan",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Matthew Cornelius is a Senior Advisor for Technology and Cybersecurity at the Office of Management and Budget (OMB). He leads OMB's Federal IT Modernization Cross Agency Priority Goal, recently published as one of the key pillars of the President's Management Agenda. Mr. Cornelius worked with Congress to authorize and appropriate the Modernizing Government Technology Act (MGT Act), which established the Technology Modernization Fund (TMF). He established the Technology Modernization Board (chaired by the Federal CIO) that oversees the evaluation of projects for funding by the TMF and serves as executive secretary and principle executor of the TMF. Previously at OMB, he led the development of the Report to the President on Federal IT Modernization.  Prior to OMB, Mr. Cornelius served as the Senior Advisor for Cybersecurity to the Administrator of the General Services Administration. He began his Federal career as a Policy Analyst at the Department of the Treasury.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31760,
      "name": "Matthew Cornelius",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Jen Ellis is the vice president of community and public affairs at Rapid7. Jen's primary focus is on building productive collaboration between those in the security community and those operating outside it. She works extensively with security researchers, technology providers and operators, and various government entities to help them understand and address cybersecurity challenges. She believes effective collaboration is our only path forward to reducing cybercrime and protecting consumers and businesses. She has testified before Congress and spoken at a number of security industry events including SXSW, RSA, Derbycon, Shmoocon, SOURCE, UNITED, and various BSides.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31761,
      "name": "Jen Ellis",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Wade Baker is co-founder of the Cyentia Institute. In addition to his role with the Cyentia Institute, Wade is a professor in Virginia Tech's College of Business, teaching in the MBA and Master of IT programs. He's also proud to serve on the Advisory Boards of the RSA Conference and FAIR Institute. Wade loves learning from cybersecurity data and sharing those lessons to help others learn as well - whether that's in the classroom, boardroom, or anywhere in between. Prior to founding Cyentia, Wade was the VP of Strategy and Analytics at ThreatConnect and before that had the great fortune of leading Verizon's Data Breach Investigations Report team for a number of years.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31762,
      "name": "Wade Baker",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Leonard is Special Counsel for National Security in the Department of Justice's (DOJ) Computer Crime and Intellectual Property Section (CCIPS) and Head of CCIPS' Cybersecurity Unit. He joined DOJ's Terrorism and Violent Crime Section in 1991. In the late 1990's, he served as Special Counsel and Special Investigative Counsel to DOJ's Inspector General and supervised sensitive investigations of Department officials and programs. In 2000, he joined CCIPS where he has prosecuted computer crime and intellectual property cases; advised on matters related to searching and seizing electronic evidence and conducting electronic surveillance; and chaired the Organization of American States' Group of Government Experts on Cybercrime.  Leonard has taught courses on cybersecurity and cybercrime at Georgetown Law School and Columbus School of Law in Washington, D.C.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31763,
      "name": "Leonard Bailey",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Joshua Corman is a Founder of I am The Cavalry (dot org) and CSO for PTC. Corman previously served as Director of the Cyber Statecraft Initiative for the Atlantic Council, CTO for Sonatype, Director of Security Intelligence for Akamai, and in senior research & strategy roles for The 451 Group and IBM Internet Security Systems. He co-founded RuggedSoftware and IamTheCavalry to encourage new security approaches in response to the world's increasing dependence on digital infrastructure. Josh's unique approach to security in the context of human factors, adversary motivations and social impact has helped position him as one of the most trusted names in security. He also serves as an adjunct faculty for Carnegie Mellon's Heinz College and on the Congressional Task Force for Healthcare Industry Cybersecurity.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31764,
      "name": "Joshua Corman",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Jamie Williams is a Cyber Adversarial Engineer for The MITRE Corporation where he works on various efforts involving security operations and research. He is also a member of both the MITRE ATT&CK‚Ñ¢ and ATT&CK Evaluations teams. Before joining MITRE, Jamie received his M.S. in Information Systems Engineering from Johns Hopkins University and his B.S. in Information Systems from the University of Maryland, Baltimore County (UMBC).",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31765,
      "name": "Jamie Williams",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Kurt Opsahl is the Deputy Executive Director and General Counsel of the Electronic Frontier Foundation. \n\nIn addition to representing clients on civil liberties, free speech and privacy law, Opsahl counsels on EFF projects and initiatives. \n\nOpsahl is the lead attorney on the Coders' Rights Project, and a board member of the USENIX association.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31766,
      "name": "Kurt Opsahl",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Professional on Information Technology with over seven years of work experience in the Information Security field. He has worked for large companies, including HP and IBM on Enterprise Vulnerability Management and Secure Operation Center, and he is currently employed as the Information Security Operations Lead at National Instruments. In his current role, Rodrigo supports the security event and incident management plus other security initiatives and projects.\n\nhttps://www.linkedin.com/in/brenessa/",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31767,
      "name": "Rodrigo Brenes",
      "link": ""
    },
    {
      "updated_at": "2019-08-01T05:36+0000",
      "title": "",
      "description": "Bob Lord is the Chief Security Officer at the Democratic National Committee, bringing more than twenty years of experience in the information security space to the Committee, state parties, and campaigns. Previously he was Yahoo’s CISO, covering areas such as risk management, product security, security software development, e-crimes, and APT programs. Before that he acted as the CISO in Residence at Rapid 7, and before that headed up Twitter’s information security program as its first security hire. You can see some of his hobbies at https://www.ilord.com.",
      "conference": "BSIDESLV2019",
      "twitter": "",
      "id": 31768,
      "name": "Bob Lord",
      "link": ""
    }
  ]
}